{"contests": [{"name": "round1", "title": "Round 1", "edition": "10th Edition", "tasks": [{"name": "christmas", "title": "Greedy Santa", "statement": "Santa Claus loves everything about his job: the sled, the reindeers, the chilly weather, the smiles of children when they receive their gifts… everything except one thing: he really hates his managers. As a matter of fact, the North Pole Holdings LLC is a very demanding company, and its top executives are arrogant and hard to please. Every year Santa tries his best to spend as little as possible to buy the gifts, be as fast as possible to deliver them in time, and yet there is always some manager complaining! That is why, this year, Santa feels a little \"vindictive\": he will buy very expensive gifts (for example, he's thinking about buying a vacation to Hawaii as a gift for himself) in order to squander all of the budget provided by the company, a total of B euros. Santa wants to use all of the company's budget even if that means having to pay something out of his own pockets! In other words...", "points": 4430, "medpos": 30, "avgpos": 54.02439024390244, "average": 13.18452380952381, "highest": 100, "positive": 82, "fullscore": 100, "fullscores": 21, "highlights": [{"id": "/region/tre/tnps01000v", "name": "Galileo Galilei, Trento", "description": "is the institute with the most points (290)"}, {"id": "/region/emi", "name": "Emilia-Romagna", "description": "is the region with the most points (790)"}]}, {"name": "exhibitions", "title": "Pet Fair", "statement": "Edoardo and Luca decided to diversify their businesses by organizing an astounding pet fair. However, they are already fighting for its organization, since Luca is a huge fan of dogs and Edoardo a strong supporter of cats! This fair consists in N different exhibitions, each of them with a specific awesomeness coefficient A_i (positive integer), involving a certain pet P_i (a dog or a cat), and presented by a certain guide G_i (a dog-lover or a cat-lover), for i = 0 … N-1. Note that a cat exhibition is not necessarily presented by a cat-lover, and similarly for dogs. During the fair, M groups of tourists will arrive, starting from different exhibitions E_j for j = 0 … M-1. The guides, after presenting their exhibition to the incoming group, will direct the group to another exhibition of their choice. The groups will continue to follow the instructions of the guides, until they will reach in this way an exhibition they have already seen: at that point, the group will leave the fair...", "points": 1625, "medpos": 25, "avgpos": 38.69047619047619, "average": 4.836309523809524, "highest": 100, "positive": 42, "fullscore": 100, "fullscores": 8, "highlights": [{"id": "/region/emi/bois01400r", "name": "I.I.S. F. Alberghetti, Imola", "description": "is the institute with the most points (180)"}, {"id": "/region/emi", "name": "Emilia-Romagna", "description": "is the region with the most points (300)"}]}, {"name": "kitchen", "title": "Master Chef", "statement": "William is attending the finals of Master Chef Italia! For this last round of selection he will have to prepare N different dishes, each of them taking H_i units of heat in order to be cooked. Time is very limited, so he needs to plan carefully in order to cook everything in time. For this round, William will be provided of M stoves of various sizes, each of them taking T_i seconds to emit a full unit of heat (larger stoves are faster, smaller ones are slower). On each stove, William can put only one of the dishes he has to prepare at a time: he may put other ones only after the dishes previously cooked there are ready. Furthermore, each dish can only be put on a single stove from the beginning until the end: changing stoves halfway through cooking may seriously impair the quality of the prepared dishes. After spending half of his time planning, William is still puzzled about how to schedule the different dishes on the various stoves...", "points": 1796, "medpos": 22, "avgpos": 43.80487804878049, "average": 5.345238095238095, "highest": 100, "positive": 41, "fullscore": 100, "fullscores": 4, "highlights": [{"id": "/region/lom/mnis01100e", "name": "I.S. Fermi MN, Mantova", "description": "is the institute with the most points (205)"}, {"id": "/region/lom", "name": "Lombardia", "description": "is the region with the most points (415)"}]}, {"name": "malls", "title": "Shopping Malls", "statement": "Luca's friend is tired of all new technological startup being created and, in response, wants to start a traditional business: a shopping mall. Before constructing the physical structure, she plans to carefully analyze the locations of already existing malls, as she obviously does not want to see her business cannibalized by competitors. On the path from Milan to Bergamo (near where Luca lives) there is an astonishing number of big malls, approximately aligned on a \"virtual straight road\". With the help of some acquaintances, she has obtained information about N malls. For each one, it is known the distance in kilometers from the center of Milan, considered at distance 0 by convention. The new mall must be constructed within this \"virtual road\" of lenght K, extremes included. Luca has been called to find the best position for his friend's new activity: where should he advise her to build the mall, in order to maximize the minimum distance with an existing mall?", "points": 6770, "medpos": 100, "avgpos": 64.47619047619048, "average": 20.148809523809526, "highest": 100, "positive": 105, "fullscore": 100, "fullscores": 53, "highlights": [{"id": "/region/tre/tnps01000v", "name": "Galileo Galilei, Trento", "description": "is the institute with the most points (410)"}, {"id": "/region/lom", "name": "Lombardia", "description": "is the region with the most points (1245)"}]}, {"name": "muffin", "title": "Muffin Selection", "statement": "You may not know that William is an expert about muffins: he is even able to immediately judge the taste T_i of a muffin without even biting it! He is now in front of a long row of N muffins, and he really wants to eat some of them. The only way to pick up a muffin is to use a wide paddle that can lift exactly K muffins at a time, precisely the number that William wants. Help him choosing the best range of K adjacent muffins with the highest sum of tastes, to maximize his satisfaction!", "points": 13100, "medpos": 60, "avgpos": 68.58638743455498, "average": 38.98809523809524, "highest": 100, "positive": 191, "fullscore": 100, "fullscores": 78, "highlights": [{"id": "/region/tre/tnps01000v", "name": "Galileo Galilei, Trento", "description": "is the institute with the most points (680)"}, {"id": "/region/lom", "name": "Lombardia", "description": "is the region with the most points (2130)"}]}, {"name": "numpad", "title": "Call for Help", "statement": "Edoardo was playing with a new device when suddenly he pushed the wrong button and he was transformed into an ant! In order to try and reverse the effect of the device, Edoardo is now trying to call the helpline of the company that made it. The toll-free phone number is written on the back of the device, and is formed by N digits. Edoardo is initially located on top of his phone numpad, specifically on the number \"0\". At any moment, Edoardo can choose to either: (1) Jump on the spot. This will press the number where he's located. (2) Jump in the direction of some adjacent number: this will change his location but will not press the number after \"landing\". He can move only in 4 directions: up, down, left, right. Compute how many jumps he will need to perform to dial the whole number.", "points": 10680, "medpos": 100, "avgpos": 89.0, "average": 31.785714285714285, "highest": 100, "positive": 120, "fullscore": 100, "fullscores": 100, "highlights": [{"id": "/region/tre/tnps01000v", "name": "Galileo Galilei, Trento", "description": "is the institute with the most points (400)"}, {"id": "/region/lom", "name": "Lombardia", "description": "is the region with the most points (2130)"}]}, {"name": "poker", "title": "Tournament Planning", "statement": "Giorgio is so confident in his poker skills that he is planning his participation in the next N tournaments based on the assumption that he will always win. However, the plan is not trivial since some tournaments may overlap, and others may be too expensive to participate in! More precisely, each tournament i for =0 … N-1 is held in day D_i, starts at time S_i, ends at time E_i, has a buy-in of a poker tournament is the participation fee required to access it. B_i and a prize P_i. Before the start of the tournaments, Giorgio was able to borrow M euros from friends to spend on buy-ins. Now, Giorgio has to select a subset of the tournaments such that for each i among them: (1) every other selected tournament j on the same day does not overlap (i.e., either S_i ≥ E_j or S_j ≥ E_i); (2) Giorgio is able to pay for the buy-in B_i, assuming to have collected all the prizes for the selected tournament j finished before the start of i...", "points": 1715, "medpos": 10, "avgpos": 32.98076923076923, "average": 5.104166666666667, "highest": 100, "positive": 52, "fullscore": 100, "fullscores": 9, "highlights": [{"id": "/region/tre/tnps01000v", "name": "Galileo Galilei, Trento", "description": "is the institute with the most points (195)"}, {"id": "/region/lom", "name": "Lombardia", "description": "is the region with the most points (350)"}]}, {"name": "restaurants", "title": "N-Restaurants", "statement": "Cooking reality shows are now widespread on television. Not being much different from everyone else, Giorgio occasionaly watches his favourite one: \"quattro ristoranti\" (Italian for \"four restaurants\"). The format is straightforward: alternately, all but one restaurateurs plus Alessandro Borghese (the host of the show) dine in the restaurant of the remaining restaurateur, giving each a mark from 0 to 10. The episode is won by the restaurateur who got the maximum score, defined as the sum of the marks of other restaurateurs plus the mark given by Alessandro Borghese. Giorgio keeps receiving notifications from his smartphone and thus is not able to pay full attention to the television. Sometimes, right in the middle of the show, he wonders: who is winning at the moment? Help him by determining, after each round, who leads the ranking (or, in other words, who has the maximum score).", "points": 20460, "medpos": 100, "avgpos": 96.96682464454976, "average": 60.892857142857146, "highest": 100, "positive": 211, "fullscore": 100, "fullscores": 203, "highlights": [{"id": "/region/tre/tnps01000v", "name": "Galileo Galilei, Trento", "description": "is the institute with the most points (900)"}, {"id": "/region/emi", "name": "Emilia-Romagna", "description": "is the region with the most points (3520)"}]}], "points": 60576, "fullscore": 800, "positive": 247, "highest": 800, "average": 180.28571428571428, "avgpos": 245.24696356275302, "medpos": 190, "teams": 336, "id": "1", "ed_num": 10, "highlights": [{"id": "/edition/10/round/1/exhibitions", "name": "Pet Fair", "description": "is the most difficult task of this contest"}, {"id": "/region/tre/tnps01000v", "name": "Galileo Galilei, Trento", "description": "is the institute with the most points (3184)"}, {"id": "/region/lom", "name": "Lombardia", "description": "is the region with the most points (10390)"}], "rank_tot": 221, "rank_reg": 38, "scores": [0, 0, 0, 0, 60, 0, 0, 0], "total": 60}, {"name": "round2", "title": "Round 2", "edition": "10th Edition", "tasks": [{"name": "bankrupt", "title": "Forced Sales", "statement": "These are hard times for the OIS… sponsors are getting scarcer every day and the balance sheet is in a huge deficit. In order to avoid bankruptcy, Edoardo is thus forced to renounce to the mega-mansion the OIS just bought for ensuring his best possible focus while preparing the tasks. The perimeter of Edoardo's mansion is a polygon with N sides of integer length, all of them either horizontal or vertical. From the cadastral map, he knows the exact position (X_i, Y_i) of each vertex P_i of the polygon. Help Edoardo compute the area of his mansion, in order to set an adequate price for it! ", "points": 2970, "medpos": 75, "avgpos": 67.5, "average": 8.839285714285714, "highest": 100, "positive": 44, "fullscore": 100, "fullscores": 19, "highlights": [{"id": "/region/lom/mnis01100e", "name": "I.S. Fermi MN, Mantova", "description": "is the institute with the most points (300)"}, {"id": "/region/lom", "name": "Lombardia", "description": "is the region with the most points (760)"}]}, {"name": "carpets", "title": "Colorful Carpets", "statement": "William was supervising some kids in a big rectangular room (of size R × C meters), when he suddenly got an unexpected call from Giorgio to discuss urgent duties for the next round of the OIS. Before answering the phone, he gave the kids K rectangular carpets (numbered from 1 to K) of various sizes to play with. When the call ended, William came back to check the situation and found a giant mess of carpets lying on the floor, some even on top of others: what a disaster! However, he thought that he could turn this awful moment in a catchy Instagram post. He has already taken a picture of the room from above, but he misses the description. Of course, being a precision lover, William wants to enter a boring but accurate description: the exact coordinates of each of the carpets. Help him!", "points": 5685, "medpos": 100, "avgpos": 76.82432432432432, "average": 16.919642857142858, "highest": 100, "positive": 74, "fullscore": 100, "fullscores": 45, "highlights": [{"id": "/region/tre/tnps01000v", "name": "Galileo Galilei, Trento", "description": "is the institute with the most points (460)"}, {"id": "/region/lom", "name": "Lombardia", "description": "is the region with the most points (1140)"}]}, {"name": "chips", "title": "Chips", "statement": "William is crazy about cosmic poker! In this game, coins of three colors (r, g, b) are used instead of cards. The game is simple, the casino defines two numbers A and C as coefficients for calculating bets, and the player's win is calculated with the formula: A * (r^2 + g^2 + b^2) + C * min {r, g, b} where r, g, b are the number of red, green and blue chips in the game. William is facing the following task: there are already r red, g green and b blue chips on the table, but with one last move, he can add on the table exactly one chip of any color. Help him choose a colour to maximize his win. Moreover, William wants to solve this problem for T different game configurations.", "points": 17625, "medpos": 100, "avgpos": 80.11363636363636, "average": 52.455357142857146, "highest": 100, "positive": 220, "fullscore": 100, "fullscores": 173, "highlights": [{"id": "/region/tre/tnps01000v", "name": "Galileo Galilei, Trento", "description": "is the institute with the most points (900)"}, {"id": "/region/emi", "name": "Emilia-Romagna", "description": "is the region with the most points (3505)"}]}, {"name": "enigmath", "title": "Enigmath Machine", "statement": "Giorgio has to send a new task proposal to William for the next round of the OIS. Since he needs to be extra careful to avoid information leaks, he decided to use cryptography to protect the transfer of information. Inspired by the Enigma machine, popular during World War II, he decided to build his own version: the Enigmath machine! To start, he has already decided the encoding algorithm. Starting with a number N (e.g., N=29), he computes the sum s(N) of the digits of N (e.g., s(29) = 2+9 = 11), and then the sum s(s(N)) of the digits of the sum of the digits of N (s(s(29)) = s(11) = 1+1 = 2), and so on until he obtains a single digit. The encoded number E is then the sum of all the numbers generated this way: E = N + s(N) + s(s(N)) + … For example, if N=29, then E = 29 + 11 + 2 = 42. Of course, for the encoding to be useful, it is necessary to design a corresponding decoding algorithm...", "points": 1400, "medpos": 60, "avgpos": 60.869565217391305, "average": 4.166666666666667, "highest": 100, "positive": 23, "fullscore": 100, "fullscores": 5, "highlights": [{"id": "/region/tre/tnps01000v", "name": "Galileo Galilei, Trento", "description": "is the institute with the most points (210)"}, {"id": "/region/fri", "name": "Friuli-Venezia Giulia", "description": "is the region with the most points (360)"}]}, {"name": "grasshopper", "title": "Imaginary Grasshopper", "statement": "Luca is attending a course about graph algorithms but he is a bit bored: the lectures are covering pretty basic topics on graphs, which have been already explained many times. To kill time, Luca starts playing with his imagination and dreams a grasshopper jumping on graph nodes. Everyone knows that dreams are often an exaggeration of the reality: the grasshopper, in this dream, does not jump directly from a vertex on the graph to an adjacent vertex. Instead, it always jumps two vertices at a time: when it passes on the vertex in the middle, it's still \"flying\"! The lesson is ending and Luca just woke up from the dream. He is still thinking about it, puzzled with an important question: how many vertices could the imaginary grasshopper reach, starting from vertex 0 and jumping however many times it wants?", "points": 3160, "medpos": 65, "avgpos": 63.2, "average": 9.404761904761905, "highest": 100, "positive": 50, "fullscore": 100, "fullscores": 22, "highlights": [{"id": "/region/lom/mnis01100e", "name": "I.S. Fermi MN, Mantova", "description": "is the institute with the most points (300)"}, {"id": "/region/lom", "name": "Lombardia", "description": "is the region with the most points (630)"}]}, {"name": "luck", "title": "Lucky Numbers", "statement": "Sick of losing every lottery he participates in, Giorgio decided to stop relying on chance… and instead relying on a seer to find his lucky number once and for all! However, unexpectedly, the old witch found that Giorgio has actually a whopping K lucky numbers, each of them 4-digits long. Thrilled by this unexpected news, Giorgio can't wait to buy a lottery ticket… but he wants the luckiest one! Given that the serial number of lottery tickets are C-digits long, find out the one with the highest amount of lucky numbers in it.", "points": 541, "medpos": 30, "avgpos": 27.05, "average": 1.6101190476190477, "highest": 53, "positive": 20, "fullscore": 100, "fullscores": 0, "highlights": [{"id": "/region/tre/tnps01000v", "name": "Galileo Galilei, Trento", "description": "is the institute with the most points (90)"}, {"id": "/region/fri", "name": "Friuli-Venezia Giulia", "description": "is the region with the most points (120)"}]}, {"name": "trip", "title": "Bus Trip", "statement": "In Italy there are N cities numbered from 0 to N-1. Luca lives in city S, but for the holidays he decided to go visit city E. Being just a student he doesn't want to spend a fortune in plane tickets, so he decided to have a nice bus trip! Luca used a Bash script to download the complete schedules of all the bus companies in the country. He collected M bus routes, and for each of those he has collected the following four details: (1) the starting city; (2) the time of bus departure; (3) the arrival city; (4) the time of bus arrival. Assuming that Luca is located in the city S at time t = 0, help him compute the earliest possible time he can reach the city E to enjoy his holiday, by using as many buses as needed.", "points": 2520, "medpos": 100, "avgpos": 74.11764705882354, "average": 7.5, "highest": 100, "positive": 34, "fullscore": 100, "fullscores": 20, "highlights": [{"id": "/region/lom/mnis01100e", "name": "I.S. Fermi MN, Mantova", "description": "is the institute with the most points (280)"}, {"id": "/region/lom", "name": "Lombardia", "description": "is the region with the most points (640)"}]}, {"name": "typewriter", "title": "Old Typewriter", "statement": "Edoardo found a very old typewriter that is undoubtedly fashionable, but not particularly efficient. In particular, when you type a string, the following errors may (randomly) happen: (1) Stuck key: when you type the same character two times consecutively (e.g. \"aa\"), only one of them is written (e.g. obtaining \"a\"). (2) Wild key: when you type a character (e.g. \"a\"), it may be repeated twice (e.g. obtaining \"aa\"). Furthermore, these errors may happen multiple times for the same string, and even multiple times for the same characters: for instance, a doubly stuck key would change \"aaa\" into \"a\" and a doubly wild key would do the opposite change. Before the first round, Edoardo wrote the password of the contest server three times with the typewriter, obtaining strings S_1, S_2, S_3. Edoardo does not remember the password any more and thus he needs to reconstruct it from these strings...", "points": 2680, "medpos": 100, "avgpos": 99.25925925925925, "average": 7.976190476190476, "highest": 100, "positive": 27, "fullscore": 100, "fullscores": 26, "highlights": [{"id": "/region/tre/tnps01000v", "name": "Galileo Galilei, Trento", "description": "is the institute with the most points (300)"}, {"id": "/region/fri", "name": "Friuli-Venezia Giulia", "description": "is the region with the most points (700)"}]}], "points": 36581, "fullscore": 800, "positive": 226, "highest": 753, "average": 108.87202380952381, "avgpos": 161.86283185840708, "medpos": 100, "teams": 336, "id": "2", "ed_num": 10, "highlights": [{"id": "/edition/10/round/2/luck", "name": "Lucky Numbers", "description": "is the most difficult task of this contest"}, {"id": "/region/tre/tnps01000v", "name": "Galileo Galilei, Trento", "description": "is the institute with the most points (2605)"}, {"id": "/region/lom", "name": "Lombardia", "description": "is the region with the most points (6948)"}], "rank_tot": 96, "rank_reg": 18, "scores": [0, 0, 100, 0, 0, 0, 0, 0], "total": 100}, {"name": "round3", "title": "Round 3", "edition": "10th Edition", "tasks": [{"name": "columns", "title": "Composable Columns", "statement": "By selling his marvellous mega-mansion, Edoardo was able to cover the OIS deficit and even save some money to build a more humble replacement. However, the only affordable way left is to use some of the N discounted prefabricated columns of length L_i available from exhausting stocks. These columns may be used for their exact length L_i, or may be combined in pairs (i,j) to produce a single column of length L_i + L_j. Combining more than two columns together is never allowed for safety reasons. The new OIS building will require M columns each of the same height H (produced from one or two of the available prefabricated columns). This height has to to be at least T in order to fit all the workers and equipments, and of course, the smaller the building, the cheaper the final price. Help Edoardo determine the minimal height H for which a working building can be made!", "points": 2640, "medpos": 30, "avgpos": 45.51724137931034, "average": 7.857142857142857, "highest": 100, "positive": 58, "fullscore": 100, "fullscores": 15, "highlights": [{"id": "/region/tre/tnps01000v", "name": "Galileo Galilei, Trento", "description": "is the institute with the most points (380)"}, {"id": "/region/tre", "name": "Trentino", "description": "is the region with the most points (510)"}]}, {"name": "exatlon", "title": "Exatlon Battle", "statement": "Like every year, Luca is organizing the famous Exatlon Battle: a test of strength, skill and logic. As usual, the competitors will be split in two teams, The Famous (the red team) and The Warriors (the blue team). Luca's favorite test in the competition is as follows: each team receives a square formed by N boards of equal shape, but of different color. Each board has length N and width 1. The boards are formed by square cells of sizes 1 × 1, each of them being painted red or blue. For example, the following figure shows a board of length 6, where the first and the fourth zones are painted red, while the zones 2, 3, 4 and 6 are blue: The players can reorder the boards, but they cannot change the colors in each individual board. The goal of each player is to produce a rectangular zone of the maximum possible area, painted with the color of their team. The team which forms the largest rectangular area of their own color will win the match...", "points": 1310, "medpos": 10, "avgpos": 28.47826086956522, "average": 3.8988095238095237, "highest": 100, "positive": 46, "fullscore": 100, "fullscores": 5, "highlights": [{"id": "/region/tre/tnps01000v", "name": "Galileo Galilei, Trento", "description": "is the institute with the most points (180)"}, {"id": "/region/lom", "name": "Lombardia", "description": "is the region with the most points (250)"}]}, {"name": "joc", "title": "Crazy Lights Hotel", "statement": "Giorgio loves reading before going to sleep, but today he's not at home but in a cheap hotel abroad for a conference. In the Crazy Lights hotel, each room has N lights and the corresponding N buttons; if you press the i-th button and the i-th light was off, it will immediately turn on! Now Giorgio is in the bed and he wants to start reading: he needs to switch off all the lights but the K-th. There is an odd behaviour though: he noticed that by using the i-th button not only the i-th light turns on but also some other lights turn off! He spent a few minutes to map all the switches to the lights and now he knows exactly what each button does. The management told Giorgio to never use the i-th button if the i-th light is already on, otherwise there will be a peak of power and all the hotel will go black! Help Giorgio, who wants to start reading as soon as possible: which is the minimum number of buttons to press in order to switch off all the lights but the K-th one?", "points": 1060, "medpos": 70, "avgpos": 50.476190476190474, "average": 3.1547619047619047, "highest": 100, "positive": 21, "fullscore": 100, "fullscores": 3, "highlights": [{"id": "/region/fri/udps05000p", "name": "Liceo Scientifico N. Copernico, Udine", "description": "is the institute with the most points (200)"}, {"id": "/region/lom", "name": "Lombardia", "description": "is the region with the most points (320)"}]}, {"name": "pasi", "title": "Gift Delivery", "statement": "Christmas is coming and, as you may easily imagine, this is the most stressful period of the year for Santa Claus. One of his resolutions for this year is to organize better the delivery of the gifts. He has instructed his assistants to take a map of the city and divide it in N × M rectangular neighborhoods. For each, they have also reported the total number of gifts which should be delivered. Santa's headquarter, which is the starting point, is located in the neighborhood (x,y) in the map. From there, the van is able to reach an adjacent neighborhood (in the four directions) in a minute. Santa's benevolence and generosity are not in his favour: when he crosses with his van a neighborhood, even if he has already delivered the gifts, children demand again the same gifts. Santa Claus, who is pure-hearted, is unable to refuse and gives them another load of gifts...", "points": 185, "medpos": 20, "avgpos": 37.0, "average": 0.5505952380952381, "highest": 75, "positive": 5, "fullscore": 100, "fullscores": 0, "highlights": [{"id": "/region/tre/tnps01000v", "name": "Galileo Galilei, Trento", "description": "is the institute with the most points (75)"}, {"id": "/region/tre", "name": "Trentino", "description": "is the region with the most points (75)"}]}, {"name": "paths", "title": "Railway Schedule", "statement": "The railway network in the Pordenone county consists of N train stations connected by N-1 tracks (X_i, Y_i) so that from every station is possible to reach any other station: in other words, the tracks form a tree. This choice makes the transportation system extremely inefficient: trains going in opposite directions cannot cross each other on a single track, so they need to perform lengthy and complex manoeuvres to pass each other. The new administration founded its campaign trail on changing this situation once and for all… and now it's time to keep promises! Edoardo, the local leading expert in logistics, already has a mind-blowing idea for fixing the situation: making each track one-way, so that no crossings will ever occur! Of course, the tricky part is choosing the orientations so that the service remains acceptable for the majority of the population. After inspecting the traffic patterns, Edoardo discovered that most people travel between one of M pairs (A_i, B_i) of stations...", "points": 115, "medpos": 35, "avgpos": 38.333333333333336, "average": 0.34226190476190477, "highest": 70, "positive": 3, "fullscore": 100, "fullscores": 0, "highlights": [{"id": "/region/fri/udps05000p", "name": "Liceo Scientifico N. Copernico, Udine", "description": "is the institute with the most points (70)"}, {"id": "/region/fri", "name": "Friuli-Venezia Giulia", "description": "is the region with the most points (70)"}]}, {"name": "pens", "title": "Forgotten Pencil Case", "statement": "Forgetting things is one of the most played \"sport\" worldwide, and university students make no exception. To be more accurate, students keep forgetting their pencil cases, often because they leave it on the desk at their home. When the first lecture starts in the morning, they suddenly realize that they are unable to take class notes, as they have no pen at their disposal. What usually happens next is that these students start asking pens to other students, seated increasingly away, until someone happened to brought many pens with them and is thus able to lend one. Luca, who is notoriously a calm person, finds that this process is rather messy and produces too much noise. Wouldn't it be simpler if, considered a row of seatings, a student could only ask a pen to the student seated at their immediate left or right? Luca wants to experiment with the rule above, worried that maybe too many students will be left without a pen...", "points": 18300, "medpos": 100, "avgpos": 85.91549295774648, "average": 54.464285714285715, "highest": 100, "positive": 213, "fullscore": 100, "fullscores": 162, "highlights": [{"id": "/region/tre/tnps01000v", "name": "Galileo Galilei, Trento", "description": "is the institute with the most points (900)"}, {"id": "/region/lom", "name": "Lombardia", "description": "is the region with the most points (3210)"}]}, {"name": "scopa", "title": "Italian Scopa", "statement": "Each hand is formed by 3 cards, and there are 4 more cards which are placed on the table. Cards have a number (from 1 to 10) and a suit (Golds, Swords, Cups, Batons). When it's their turn, a player will use one of his cards to take some more cards from the table, he can do so only if the values of those cards sum up to the value of the card he's using (regardless of the suit). If he manage to obtain such a sum he will keep all those cards. For example if in his hand he has a seven and on the table there is a 3, a 4, a 5 and a 10 he can choose to take the 3 and the 4. There are many strategy to play this game, Giorgio's one is the following: (1) If he can get a sette bello (the 7 of Golds), he will; (2) If he can make a scopa (take all the cards from the table), he will; (3) He'll try to take as many 7 as he can; (4) Otherwise he will try to take as many cards as he can from the table. As you can imagine, Giorgio is an avid scopa player...", "points": 4570, "medpos": 35, "avgpos": 45.7, "average": 13.601190476190476, "highest": 100, "positive": 100, "fullscore": 100, "fullscores": 5, "highlights": [{"id": "/region/lom/mnis01100e", "name": "I.S. Fermi MN, Mantova", "description": "is the institute with the most points (310)"}, {"id": "/region/lom", "name": "Lombardia", "description": "is the region with the most points (1040)"}]}, {"name": "tickets", "title": "Meal Tickets", "statement": "Luca is starving, his fridge is empty and in his small town there aren't fast food resturants nor food delivery. His only option is to go to the small supermarket near his house. The plan is simple: he will rush between the aisles, pick just the dinner, pay and finally eat on his way home. There are just a few lines where to pay, and of course he went to the less crowded one: what a bad move! The only person in front of him is Evil William, and he has loads of meal tickets. A meal ticket is like a banknote of a certain value, you can use it to pay instead of money, but some rules apply in this supermarket: you cannot use 2 tickets of the same value and the total value of used tickes must not exceed the total of your shopping. Evil William has to pay T euros and he has the ticket of all the possible values (from 1 euro up to at least T euros)...", "points": 16900, "medpos": 80, "avgpos": 82.4390243902439, "average": 50.29761904761905, "highest": 100, "positive": 205, "fullscore": 100, "fullscores": 81, "highlights": [{"id": "/region/tre/tnps01000v", "name": "Galileo Galilei, Trento", "description": "is the institute with the most points (750)"}, {"id": "/region/lom", "name": "Lombardia", "description": "is the region with the most points (2980)"}]}], "points": 45080, "fullscore": 800, "positive": 231, "highest": 710, "average": 134.16666666666666, "avgpos": 195.15151515151516, "medpos": 185, "teams": 336, "id": "3", "ed_num": 10, "highlights": [{"id": "/edition/10/round/3/paths", "name": "Railway Schedule", "description": "is the most difficult task of this contest"}, {"id": "/region/tre/tnps01000v", "name": "Galileo Galilei, Trento", "description": "is the institute with the most points (2740)"}, {"id": "/region/lom", "name": "Lombardia", "description": "is the region with the most points (8330)"}], "rank_tot": 228, "rank_reg": 33, "scores": [0, 0, 0, 0, 0, 0, 0, 0], "total": 0}, {"name": "round4", "title": "Round 4", "edition": "10th Edition", "tasks": [{"name": "atc", "title": "Air Traffic Control", "statement": "Edoardo has recently been hired by the municipality of Milan as an Air Traffic Control operator. For his first week, he has been assigned by his boss to tackle the paper-plane project. The paper-plane project is an effort to connect the city of Milan with a network of paper planes. To do this, Edoardo should build a number of control towers. We can assume the city is represented by a square grid of size N × N, where each cell can be either: (1) Empty space, indicated with a \".\" in input. (2) An obstacle such as a mountain or building or other obstructing item, indicated with a \"#\" in input. (3) A control tower, indicated with a \"T\" in input. A control tower placed on cell (i, j) can throw a paper plane in four directions: up, down, left, right. The paper plane will travel in that direction until either another control tower or an obstacle is encountered. If a paper plane reaches a control tower, then it can be launched again from there...", "points": 2850, "medpos": 10, "avgpos": 38.0, "average": 8.482142857142858, "highest": 100, "positive": 75, "fullscore": 100, "fullscores": 12, "highlights": [{"id": "/region/lom/mnis01100e", "name": "I.S. Fermi MN, Mantova", "description": "is the institute with the most points (260)"}, {"id": "/region/lom", "name": "Lombardia", "description": "is the region with the most points (690)"}]}, {"name": "cats", "title": "Lovely Cats", "statement": "Edoardo has finally built the new OIS building and he is ready to have a grand opening with a party. Being a lover of cats, Edoardo foresees that the small talk among his friends will revolve entirely on how cute these pets are. He sees an opportunity: knowing that not everyone loves cats in the same manner, he might pair friends with different opinions on the subject so that who loves them most can try to persuade the other person. This is not going to be easy. Edoardo, with a pragmatic approach, makes his friends line up along two lines: the left one with N_m male friends and the right one with N_f female friends. Then, he asks each one to express with a grade between 0 and 100 how much they love cats (M_i and F_i represent, respectively, the vote of the i-th male and of the i-th female in their lines)...", "points": 1380, "medpos": 25, "avgpos": 51.111111111111114, "average": 4.107142857142857, "highest": 100, "positive": 27, "fullscore": 100, "fullscores": 9, "highlights": [{"id": "/region/tre/tnps01000v", "name": "Galileo Galilei, Trento", "description": "is the institute with the most points (225)"}, {"id": "/region/fri", "name": "Friuli-Venezia Giulia", "description": "is the region with the most points (345)"}]}, {"name": "dates", "title": "Unreadable Dates", "statement": "A friend of Luca is particularly interested in history: he is writing his final thesis to graduate in this subject. During his researches, he is writing an appendix listing all the dates of death of the soldiers who fought in a certain battle. He has already found an old book which is perfectly suited to accomplish the task, but he has been unlucky: he is unable to read from the yellowed pages the separator (`/') between days, months and years of the dates. You know that: (1) The day is a number between 1 and 31 (except for shorter months), optionally preceded by a zero when it is a single digit (i.e., 05 and 5 are both possible). (2) The month is a number between 1 and 12, optionally preceded by a zero when it is a single digit. All months have 31 days except April, June, September and November which have 30 days and February which has 28 days...", "points": 5940, "medpos": 40, "avgpos": 57.66990291262136, "average": 17.678571428571427, "highest": 100, "positive": 103, "fullscore": 100, "fullscores": 27, "highlights": [{"id": "/region/tre/tnps01000v", "name": "Galileo Galilei, Trento", "description": "is the institute with the most points (425)"}, {"id": "/region/lom", "name": "Lombardia", "description": "is the region with the most points (1230)"}]}, {"name": "editor", "title": "Text Editor", "statement": "Giorgio was asked to write the minutes of the last round of the Olimpiadi di Informatica a Squadre. After writing thousands of words in his beloved MS Notepad, he now wants to format them properly and send the result via e-mail to the organizers. Nothing easier right? Except his e-mail client supports only formatting with bold and italic! At least you can mix them as much as you want, for example this sentence is a mix of both the formatters. In Giorgio's editor, in order to toggle the bold-ness or italic-ness of some text you can simply select a continuous range of characters with your mouse and then press the button toggle bold or the button toggle italic. By doing so all the not-bold characters will become bold and vice-versa, and respectively for the italic ones. Giorgio has already chosen which parts should be italic and which bold (and which both): your tasks is to tell him how many times he has to press the toggle buttons at minimum. ", "points": 12150, "medpos": 100, "avgpos": 88.04347826086956, "average": 36.160714285714285, "highest": 100, "positive": 138, "fullscore": 100, "fullscores": 114, "highlights": [{"id": "/region/tre/tnps01000v", "name": "Galileo Galilei, Trento", "description": "is the institute with the most points (800)"}, {"id": "/region/emi", "name": "Emilia-Romagna", "description": "is the region with the most points (2080)"}]}, {"name": "gallery", "title": "Art Gallery Selection", "statement": "Luca decided to enter the art business, and is opening a new modern art gallery in Milan. As soon as he opened a call for young emerging artists, his e-mail was flooded by pictures of paintings! In fact, too much to be selected by hand: he needs an algorithm to extract the most promising among them. Following blindly his profound artistic sense, developed in years studying engineering, Luca believes that the most beautiful paintings are those featuring subjects arranged symmetrically with respect to a vertical axis. Given a description of a painting, picturing N main subjects, each of them on a specific coordinate (X_i, Y_i), help Luca determine whether there exists a vertical axis of symmetry for the given points.", "points": 5675, "medpos": 65, "avgpos": 64.48863636363636, "average": 16.889880952380953, "highest": 100, "positive": 88, "fullscore": 100, "fullscores": 23, "highlights": [{"id": "/region/tre/tnps01000v", "name": "Galileo Galilei, Trento", "description": "is the institute with the most points (345)"}, {"id": "/region/lom", "name": "Lombardia", "description": "is the region with the most points (1240)"}]}, {"name": "kabbalah2", "title": "The Kabbalah Returns", "statement": "Luca heard from George about the powers of the Kabbalah and now he wants to try for himself. He promptly enrolled in the same course as George, where students routinely spend days and nights studing the wisdoms hidden in the Bible. Luca learned that in order to become the master of all masters it is crucial to list all the numbers contained in all pages of the Bible, and put those numbers in a N × M grid. Doing so will make the numbers entagle together and release the hidden power! After preparing the matrix, Luca needs to find a clue: the year of the edition of the master book, a particular Bible which is thought to be the most powerful one. The year is defined as the 4-digit number (without leading zeros) that appears most frequently in the grid. When looking for these occurrences, all sequences of 4 adjacent positions in the 8 cardinal directions are considered (see examples).", "points": 2195, "medpos": 55, "avgpos": 56.282051282051285, "average": 6.532738095238095, "highest": 100, "positive": 39, "fullscore": 100, "fullscores": 18, "highlights": [{"id": "/region/lom/mnis01100e", "name": "I.S. Fermi MN, Mantova", "description": "is the institute with the most points (255)"}, {"id": "/region/lom", "name": "Lombardia", "description": "is the region with the most points (580)"}]}, {"name": "mehmooni", "title": "Persian Party", "statement": "William is a regular participant at Iranian parties. In Persian, a party is called mehmooni and is quite different from normal parties: it is usually thrown in a private house, where the host (the owner of the house) will invite N guests and try to stuff them with tahdig and kabab. It's no wonder some people say that \"a mehmooni is the fastest way to end up in a hospital or gain 10kg\". What makes a mehmooni different than other parties, though, is a custom that is typical of the (overly polite?) Iranian culture: every time some new guest arrives at the party, he or she will go to shake hands and say salam (\"hello\") to the host and to every other guest who is present at that time, one by one. The same goes for when a guest leaves the party: they will again go shake hands and say khodahafez (\"goodbye\") to the host and to every guest present at that time. Note that the guests who are present at those two different moments could be different...", "points": 9860, "medpos": 80, "avgpos": 87.2566371681416, "average": 29.345238095238095, "highest": 100, "positive": 113, "fullscore": 100, "fullscores": 41, "highlights": [{"id": "/region/tre/tnps01000v", "name": "Galileo Galilei, Trento", "description": "is the institute with the most points (620)"}, {"id": "/region/emi", "name": "Emilia-Romagna", "description": "is the region with the most points (1640)"}]}, {"name": "shopping", "title": "Compulsive Shopping", "statement": "William's girlfriend is a compulsive shopper. Every time she notices a nice item while on a walk with her significant other, she desperately wants to have it! It goes without saying that William should pay for it, as a true gentleman… and this habit is wreaking havoc on his precarious finances, now limited to merely E euros total. In order to avoid bankruptcy, William went for a patrol before the next walk, and listed N items of price P_i that his girlfriend will want to have (in appearance order). William knows very well that he can refuse to buy an item desired by his beloved in two cases only: (1) if he cannot afford it, as it costs more than his current total finances; (2) if he bought the last item encountered. Refusing to buy an item in any other case would result in an prompt breakup, that is not an option...", "points": 650, "medpos": 10, "avgpos": 38.23529411764706, "average": 1.9345238095238095, "highest": 100, "positive": 17, "fullscore": 100, "fullscores": 1, "highlights": [{"id": "/region/tre/tnps01000v", "name": "Galileo Galilei, Trento", "description": "is the institute with the most points (195)"}, {"id": "/region/tre", "name": "Trentino", "description": "is the region with the most points (205)"}]}], "points": 40700, "fullscore": 800, "positive": 185, "highest": 800, "average": 121.13095238095238, "avgpos": 220.0, "medpos": 180, "teams": 336, "id": "4", "ed_num": 10, "highlights": [{"id": "/edition/10/round/4/shopping", "name": "Compulsive Shopping", "description": "is the most difficult task of this contest"}, {"id": "/region/tre/tnps01000v", "name": "Galileo Galilei, Trento", "description": "is the institute with the most points (3080)"}, {"id": "/region/lom", "name": "Lombardia", "description": "is the region with the most points (7555)"}], "rank_tot": 184, "rank_reg": 28, "scores": [0, 0, 0, 0, 0, 0, 0, 0], "total": 0}], "id": "emi52", "name": "ITIS.PR.IT", "institute": "Leonardo da Vinci, Parma", "inst_id": "prtf010006", "region": "emi", "fullregion": "Emilia-Romagna", "coach": "Ramon Ugolotti", "members": "", "finalist": false, "medals": [0, 0, 0, 1], "rank_reg": 39, "rank_tot": 234, "rank_excl": 213, "bestrank": 96, "avgrank": 27.860696517412933, "points": 160, "ed_num": 10, "edition": "10th Edition", "year": "2018/19", "highlights": [{"id": "/edition/10/round/2/chips", "name": "Chips", "description": "is the hardest task solved by the team"}, {"id": "/edition/10/round/2", "name": "Round 2", "description": "is the round with the highest rank (96), total points (100), full scores (1), maximum score (100) and regional rank (18)"}]}