{"contests": [{"name": "round1", "title": "Round 1", "edition": "8th Edition", "tasks": [{"name": "kabbalah", "title": "A Matter of Size", "statement": "George has recently enrolled in a Kabbalah seminar, where a few cultured savants debate on the concealed wisdom of the Bible. In particular, their favorite hobby is searching the Bible for long sequences of equal letters. Firstly, the seminar master selects an N × M rectangle of characters C_i,j from the holy scriptures. Afterwards, the adepts search in all directions (horizontal, vertical and diagonal) for contiguous sequences of equal letters and the longer the sequence found, the greater the glory for the finder. Help George prove his wisdom by finding the longest sequence of equal letters!", "points": 4740, "medpos": 5, "avgpos": 30.580645161290324, "average": 13.314606741573034, "highest": 100, "positive": 155, "fullscore": 100, "fullscores": 16, "highlights": [{"id": "/region/ven/vetf04000t", "name": "Carlo Zuccante, Venezia", "description": "is the institute with the most points (550)"}, {"id": "/region/ven", "name": "Veneto", "description": "is the region with the most points (985)"}]}, {"name": "lava", "title": "The Floor is Lava", "statement": "Whenever William steps on a floor made with tiles, he plays the \"Hot Lava\" game. In this game the floor is lava, that is, some of the tiles are to be absolutely avoided. This particular floor is a H × W grid made of tiles. Some of those tiles are red, the remaining ones are white. William wants to get from tile (0, 0) to tile (H-1, W-1) using only white tiles, as quickly as possible. He can move diagonally from one tile to an adjacent one (by vertex). Moreover, he can move vertically or horizontally from one tile to one that is adjacent by edge, or to the next tile in the same direction, by doing a long jump. Help William compute the quickest route, as the number of jumps (short or long jumps) needed.", "points": 1630, "medpos": 5, "avgpos": 11.560283687943262, "average": 4.578651685393258, "highest": 100, "positive": 141, "fullscore": 100, "fullscores": 2, "highlights": [{"id": "/region/ven/vrtf03000v", "name": "Guglielmo Marconi, Verona", "description": "is the institute with the most points (105)"}, {"id": "/region/lom", "name": "Lombardia", "description": "is the region with the most points (315)"}]}, {"name": "plugs", "title": "Server Farm", "statement": "William wants to exploit his new independent house for setting up a brand-new server farm, and start earning money immediately! Since his budget is pretty limited, he started this ambitious project by collecting obsolete PCs from the recycling bin for electronic waste. He gathered this way N fully functional computers with diverse capabilities. In particular, the i-th computer has computing power of F_i nanoFLOPS and is powered via a plug of type T_i, which can be either: (1) T_i = `L10', if the plug conforms to the Type L/10amp standard; (2) T_i = `L16', if the plug conforms to the Type L/16amp standard. He also found a very long power strip consisting of M sockets, where the i-th of them can be of three different types S_i: (1) S_i = `L10', if the socket is designed for Type L/10amp plugs; (2) S_i = `L16', if the socket is designed for Type L/16amp plugs; (3) S_i = `bipasso' if the socket is designed to accommodate both (otherwise incompatible) types...", "points": 2250, "medpos": 5, "avgpos": 18.0, "average": 6.320224719101123, "highest": 100, "positive": 125, "fullscore": 100, "fullscores": 11, "highlights": [{"id": "/region/ven/vetf04000t", "name": "Carlo Zuccante, Venezia", "description": "is the institute with the most points (150)"}, {"id": "/region/lom", "name": "Lombardia", "description": "is the region with the most points (490)"}]}, {"name": "prefab", "title": "Independent House", "statement": "William is exhausted of its annoying roommates and their never-ending parties. But after some months of money saving, he has finally accomplished to move into an independent house! Since his budget is quite limited, he opted for a prefabricated building consisting of two blocks: (1) a ground block, with the entrance and a living space, of size A × B centimeters; (2) a roof block with a bedroom, to be put on top of the other. The roof block is usually supposed to have the same size of the ground block. However, William has been cheated by an unprofessional ebay vendor which shipped a roof block of size X × Y centimeters to him. Now William has no choice but to make the best out of a bad situation, and use the provided blocks in some way. In particular, due to their peculiar joints the blocks need to be arranged so that...", "points": 2490, "medpos": 5, "avgpos": 18.175182481751825, "average": 6.99438202247191, "highest": 100, "positive": 137, "fullscore": 100, "fullscores": 5, "highlights": [{"id": "/region/emi/bois01400r", "name": "I.I.S. F. Alberghetti, Imola", "description": "is the institute with the most points (150)"}, {"id": "/region/emi", "name": "Emilia-Romagna", "description": "is the region with the most points (590)"}]}, {"name": "seats", "title": "Reserved Seats", "statement": "When commuting by train, Italian people tend to just sit in the first empty seat they find instead of spending time looking for their reserved seat. Specifically: when an Italian person boards a train, he/she will start looking for an empty seat (from the very first seat in the train) and they will stop only: (1) When an empty seat is encountered: in this case, that person will occupy the seat. Or… (2) When the actual seat, reserved to that person, is encountered: in this case, if the seat is occupied, the person will kindly ask the offending traveler to move. The offending traveler will apologize, get up, and go to their reserved seat (not just some empty seat, this time). Note that, in the second case presented, a chain reaction of movings could fire up (A asks B to move, then B asks C to move, and so on). Train seats are numbered from 0 to N-1...", "points": 945, "medpos": 5, "avgpos": 7.875, "average": 2.654494382022472, "highest": 70, "positive": 120, "fullscore": 100, "fullscores": 0, "highlights": [{"id": "/region/laz/frps010009", "name": "Liceo Scientifico Severi, Frosinone", "description": "is the institute with the most points (140)"}, {"id": "/region/laz", "name": "Lazio", "description": "is the region with the most points (170)"}]}, {"name": "streetlights", "title": "Antique Street Lights", "statement": "George is very passionate about the good old times, so much that he switched the illumination in his street to old-fashioned oil lanterns. The street is now nicely illuminated by a sequence of N equally spaced lanterns, providing joy and delight to the whole neighbourhood. However, he got the permission for doing so only by accepting to personally maintain the lanterns lit up: in fact, he has to ensure that given any subsequence of consecutive M lanterns, at least K of them are lit up at any given time. Tonight an heavy storm is coming down on George's neighbourhood, and some particularly strong wind gusts just extinguished part of the lanterns. George can see for each lantern i whether it is lit (L_i = 1) or not (L_i = 0). Since he doesn't want to risk his concession to be revoked, it is time to get out in the storm and turn on some lights! Help George not to freeze in the storm...", "points": 2700, "medpos": 5, "avgpos": 18.75, "average": 7.584269662921348, "highest": 100, "positive": 144, "fullscore": 100, "fullscores": 2, "highlights": [{"id": "/region/tre/tnps01000v", "name": "Galileo Galilei, Trento", "description": "is the institute with the most points (225)"}, {"id": "/region/lom", "name": "Lombardia", "description": "is the region with the most points (480)"}]}, {"name": "wheel", "title": "Wheel of Fortune", "statement": "William is playing the Wheel of Fortune, a famous game show. The wheel is a \"sliced\" circle, with numbers on each slice. It can be seen as a circular array of 2N elements. The rules are as follows. William can \"turn\" the wheel by rotating the array, i.e. moving each of its elements ahead by some positions (possibly making several complete turns). For example, if the array is 2 1 5 3, a rotation of 1 would yield the following array: 3 2 1 5. Rotating again by 2 would yield 1 5 3 2. Rotating again by 1 would yield the original array. In order to win the game, William needs some information about the wheel everytime he turns it. Specifically: he needs to know the min among the first N elements and the max among the last N elements. Initially, in the previous example, the min and max values are 1 and 5. After the first rotation they become 2 and 5, then they become 1 and 3, and finally they become 1 and 5 again when the original ordering is restored...", "points": 3315, "medpos": 30, "avgpos": 31.27358490566038, "average": 9.311797752808989, "highest": 70, "positive": 106, "fullscore": 100, "fullscores": 0, "highlights": [{"id": "/region/ven/vetf04000t", "name": "Carlo Zuccante, Venezia", "description": "is the institute with the most points (275)"}, {"id": "/region/ven", "name": "Veneto", "description": "is the region with the most points (595)"}]}], "points": 18070, "fullscore": 700, "positive": 206, "highest": 450, "average": 50.758426966292134, "avgpos": 87.71844660194175, "medpos": 60, "teams": 356, "id": "1", "ed_num": 8, "highlights": [{"id": "/edition/8/round/1/seats", "name": "Reserved Seats", "description": "is the most difficult task of this contest"}, {"id": "/region/ven/vetf04000t", "name": "Carlo Zuccante, Venezia", "description": "is the institute with the most points (1215)"}, {"id": "/region/lom", "name": "Lombardia", "description": "is the region with the most points (3215)"}], "rank_tot": 192, "rank_reg": 6, "scores": [0, 0, 0, 0, 0, 0, 0], "total": 0}, {"name": "round2", "title": "Round 2", "edition": "8th Edition", "tasks": [{"name": "fengshui", "title": "Feng Shui House", "statement": "Giorgio recently became very passionate about Feng Shui, the art of harmonizing everyone with the surrounding environment, and decided to rebuild his home from scratch in order to optimize his harmony with the universe. First, he searched his yard for geomagnetic nodes, producing a list of N points with coordinates (X_i, Y_i). Now, he needs to select four of those points such that together they will form a perfect square whose sides are aligned with the cardinal axes. These points will determine the perimeter of his new home. However, it is not easy to examine such a long list and as of now Giorgio has only found few very small valid squares, not really fit to contain a whole house. Help Giorgio find the largest square that obeys the Feng Shui principles!", "points": 2280, "medpos": 5, "avgpos": 13.902439024390244, "average": 6.404494382022472, "highest": 100, "positive": 164, "fullscore": 100, "fullscores": 4, "highlights": [{"id": "/region/tre/tnps01000v", "name": "Galileo Galilei, Trento", "description": "is the institute with the most points (155)"}, {"id": "/region/emi", "name": "Emilia-Romagna", "description": "is the region with the most points (480)"}]}, {"name": "gamble", "title": "Gambling Assistant", "statement": "Giorgio has been recently introduced to a gambling club, where he is accurately losing all of his money. Tired of losing so much, he chooses one of the simplest games played there and tries his best to become good at it. This game consists in a series of N rounds, in which every player draws a card from a deck (represented by a number from 1 to 13). The hand size is limited to K cards, so that whenever a player exceeds this limit he has to immediately discard one card from his hand. During the game several bets take place, that are won by the player with the highest grand total (sum of the values -- from 1 to 13 -- of each card) in his hand. To improve his performance in the game, Giorgio is reviewing some videos of famous plays of this game. In this videos he is able to see which card C_i is drawn at each round, but he is not able to easily keep track of the grand total as it varies during the game...", "points": 7575, "medpos": 70, "avgpos": 54.107142857142854, "average": 21.278089887640448, "highest": 100, "positive": 140, "fullscore": 100, "fullscores": 10, "highlights": [{"id": "/region/ven/tvtf04000t", "name": "ITI Planck, Villorba", "description": "is the institute with the most points (465)"}, {"id": "/region/lom", "name": "Lombardia", "description": "is the region with the most points (1420)"}]}, {"name": "seti", "title": "Interstellar Transmissions", "statement": "After reading about the ambitious SETI program, William decided to join the project and build an array of N radios for interstellar transmissions in his garage. However, the array has not received any extraterrestrial message yet, fact that William blamed to the phenomenon of interference. In particular, William noticed that whenever the i-th radio is turned on, V_i of the radios on its left (that is, radios j = i-V_i … i-1) receive disturbed signals and are not usable. Fortunately, no interfering signals are received by radios on the right (that is, with j > i). In order to plan his next experiment avoiding interferences, William now needs to select a subset of his radios avoiding interferences, that is, such that if radio i is turned on then all radios between i-V_i and i-1 are turned off. Help William plan his next experiment, by counting the number of subsets of radios avoiding interferences modulo in C/C++ and mod in Pascal. 1000000007.", "points": 1050, "medpos": 5, "avgpos": 6.774193548387097, "average": 2.949438202247191, "highest": 100, "positive": 155, "fullscore": 100, "fullscores": 1, "highlights": [{"id": "/region/sic/patf030009", "name": "ITI Vittorio Emanuele III, Palermo", "description": "is the institute with the most points (105)"}, {"id": "/region/lom", "name": "Lombardia", "description": "is the region with the most points (190)"}]}, {"name": "teleport", "title": "Public Transport", "statement": "After solving the black hole equations, Giorgio has patented a brand-new project for a teleport machine. This handy device would approximately resemble a photo booth, and allow customers to be instantly dematerialized and then fully reassembled into a perfectly functional human being, in another teleport machine of their choice. Since there are no known side effects as of now, Giorgio is enthusiastic about his new project and cannot wait to realize it. However, building a teleport machine is pretty expensive (and definitely out of his budget): so it is time to get a sponsor! Giorgio laid out a map of the city of Torino, consisting of streets, buildings and the proposed teleport machines. This map is a grid of H × W characters C_ij, which can be either: (1) `.' to represent a street, square or any other open space in the city; (2) `#' to represent a building, river or any other obstacles; (3) `@' to represent a teleport machine; (4) `C' to represent the city hall...", "points": 1295, "medpos": 5, "avgpos": 8.80952380952381, "average": 3.6376404494382024, "highest": 100, "positive": 147, "fullscore": 100, "fullscores": 4, "highlights": [{"id": "/region/tre/tnps01000v", "name": "Galileo Galilei, Trento", "description": "is the institute with the most points (115)"}, {"id": "/region/ven", "name": "Veneto", "description": "is the region with the most points (245)"}]}, {"name": "usernames", "title": "Confusing Usernames", "statement": "William spends most of his time administering the Italian portal for the IOI training. During his last sleepless night debugging the system, he figured out that several of the usernames used in the website are very similar. This causes a lot of confusion, especially when inspecting users' rankings. He is then considering to add a new rule to the website: you are not allowed to select a username whose set of letters is a subset of the set of letters of another username. For example, you cannot register the username bob00 if n0ob is already present. In order to evaluate the impact of such a design choice, he now wants to measure how much this rule is violated by the current list of usernames. More precisely, given a list of N usernames U_i consisting of characters `a' -- `z' and `0' -- `9', he wants to count the number of username pairs (i,j) such that letters(U_i) ⊆ letters(U_j).", "points": 2675, "medpos": 5, "avgpos": 17.258064516129032, "average": 7.514044943820225, "highest": 90, "positive": 155, "fullscore": 100, "fullscores": 0, "highlights": [{"id": "/region/lom/mnis01100e", "name": "I.S. Fermi MN, Mantova", "description": "is the institute with the most points (195)"}, {"id": "/region/lom", "name": "Lombardia", "description": "is the region with the most points (610)"}]}, {"name": "walkway", "title": "Scenic Walkway", "statement": "The managers of Gardaland Theme Park are building a new attraction, consisting of a sequence of N chambers of horrors, each located at a different height of H_i meters. Together with the attraction, they also plan to build a scenic walkway following most of the chambers from the outside. In order to maximise the visibility of the new attraction, they need to carefully plan the altitude at which to build the walkway. For this reason they hired Giorgio and William, who calculated that it would be best if at least K chambers were clearly visible from the walkway. Given a set of chambers, define its spread as the difference between the highest and the lowest chamber in the set. Find the smallest possible spread for a set of K chambers!", "points": 8695, "medpos": 70, "avgpos": 52.696969696969695, "average": 24.424157303370787, "highest": 100, "positive": 165, "fullscore": 100, "fullscores": 55, "highlights": [{"id": "/region/ven/vetf04000t", "name": "Carlo Zuccante, Venezia", "description": "is the institute with the most points (565)"}, {"id": "/region/lom", "name": "Lombardia", "description": "is the region with the most points (2005)"}]}, {"name": "water", "title": "Water Calculator", "statement": "William has recently built a Water Calculator^, which mimics the operation of a computer through water pipes, sinks and siphons. Due to the rudimentary nature of its circuits, the Water Calculator^ is able to store a single number up to a billion and perform only a handful of atomic operations: (1) add or subtract 1; (2) multiply by 2; (3) divide by a power of 3 (which divides exactly the stored number). These few operations are anyway more than sufficient for William's basic mathematical needs. In this moment, the Water Calculator^ is holding number N. Since William needs to leave his home for a while, it is crucial to empty the calculator in order to avoid malicious rusting! Calculate the minimum number of atomic operations necessary for William to completely empty the calculator.", "points": 4280, "medpos": 40, "avgpos": 24.180790960451976, "average": 12.02247191011236, "highest": 70, "positive": 177, "fullscore": 100, "fullscores": 0, "highlights": [{"id": "/region/lom/bgps02000g", "name": "Filippo Lussana, Bergamo", "description": "is the institute with the most points (240)"}, {"id": "/region/lom", "name": "Lombardia", "description": "is the region with the most points (725)"}]}], "points": 27850, "fullscore": 700, "positive": 207, "highest": 540, "average": 78.23033707865169, "avgpos": 134.54106280193236, "medpos": 110, "teams": 356, "id": "2", "ed_num": 8, "highlights": [{"id": "/edition/8/round/2/seti", "name": "Interstellar Transmissions", "description": "is the most difficult task of this contest"}, {"id": "/region/ven/vetf04000t", "name": "Carlo Zuccante, Venezia", "description": "is the institute with the most points (1515)"}, {"id": "/region/lom", "name": "Lombardia", "description": "is the region with the most points (5525)"}], "rank_tot": 195, "rank_reg": 4, "scores": [0, 0, 0, 0, 0, 0, 0], "total": 0}, {"name": "round3", "title": "Round 3", "edition": "8th Edition", "tasks": [{"name": "chat", "title": "Chat System", "statement": "In his never-ending quest for improvements of the Italian training website, William decided to rewrite the chat system from scratch. This system allows students to communicate with one another in real time. A key component in any chat system is the \"recent chat list\". This list shows all the names of people who have been contacted at least once, sorted by last contact time, that is: in the top there will be the user that has been most recently contacted (no other user has been contacted yet), in the bottom there is the user that has been least recently contacted (no other user was last contacted before). Of course, this final list cannot have duplicates by construction. Help William write the \"recent chat list\" component. You will be given the list of people contacted, from the first person contacted to the last. There can be multiple entries in this list (when a person is contacted multiple times). Print the order in which those people will appear in the final list.", "points": 8240, "medpos": 70, "avgpos": 59.710144927536234, "average": 23.146067415730336, "highest": 100, "positive": 138, "fullscore": 100, "fullscores": 19, "highlights": [{"id": "/region/ven/vetf04000t", "name": "Carlo Zuccante, Venezia", "description": "is the institute with the most points (425)"}, {"id": "/region/lom", "name": "Lombardia", "description": "is the region with the most points (1640)"}]}, {"name": "connectx", "title": "Connect X", "statement": "Giorgio and William are spending some time together brainstorming to come up with impossible tasks for the forthcoming round of the IOI-team. While pondering about the subtleties of their algorithmic puzzles, they enjoy releasing tension by playing Connect X, a generalization of the well-known Connect Four game (where 4 is replaced by a possibly different number X). More precisely: (1) Giorgio and William play in an H × W grid, held vertically on a table; (2) The game proceeds in alternating turns by inserting tokens into non-full columns; (3) When a token is inserted into a column it falls through empty cells, eventually stopping on the lowest empty cell in that column; (4) The game ends as soon as a straight (vertical, horizontal or diagonal) line of X tokens belonging to the same player is completed, awarding victory to that player; (5) If no line of X tokens of a same player is completed before completely filling the grid, the game is declared a draw...", "points": 1250, "medpos": 5, "avgpos": 16.233766233766232, "average": 3.5112359550561796, "highest": 100, "positive": 77, "fullscore": 100, "fullscores": 2, "highlights": [{"id": "/region/tre/tnps01000v", "name": "Galileo Galilei, Trento", "description": "is the institute with the most points (110)"}, {"id": "/region/lom", "name": "Lombardia", "description": "is the region with the most points (250)"}]}, {"name": "crossover", "title": "Perfect Crossover", "statement": "This month William got interested in genetic algorithms, that he is now using for solving even the simplest everyday tasks. However, he is unsatisfied with the performance of the crossover phase. In this phase, two strings s and t formed by features of selected individuals are combined together into a new string s & t, in order to mix them up exactly a bit. After days of excruciating research, William finally came up with few requirements that (in his opinion) would characterize a perfect crossover (where s, t stand for strings and a, b, c stand for single characters): (1) s & \"\" = \"\" & s = s, i.e., a crossover with an empty string does not change the other string; (2) (cs) & (tc) = t & s, i.e., a crossover among strings such that the first character of the first string equals the last character of the last string results in that equal characters being removed and the remaining strings swapped; (3) (as) & (tb) = b (s & t) a, i.e...", "points": 1605, "medpos": 5, "avgpos": 18.238636363636363, "average": 4.508426966292135, "highest": 100, "positive": 88, "fullscore": 100, "fullscores": 4, "highlights": [{"id": "/region/lom/mnis01100e", "name": "I.S. Fermi MN, Mantova", "description": "is the institute with the most points (170)"}, {"id": "/region/lom", "name": "Lombardia", "description": "is the region with the most points (460)"}]}, {"name": "faster", "title": "But It Keeps Getting Faster", "statement": "Everybody knows that William is constantly looking for the rarest and dankest memes on the magical place that is the Internet. Today he found a new one: the \"but it keeps getting faster\" meme. This meme consists of a video which is initially played at normal speed, but then just keeps getting faster. In most cases, the speedup is triggered by a specific event. For example, everytime someone says a particular word (typically a word that is used a lot throughout the video) like in the following cases: After watching all these memes, William decided to create one himself. However, to make a meme as dank as possible, he needs to know in advance how long it will be. He will start with an existing video which is N seconds long. We can assume that all the words in the video are spoken at a constant speed of 1 word per second. William has the entire transcript of the video, composed of N words...", "points": 7555, "medpos": 45, "avgpos": 55.5514705882353, "average": 21.221910112359552, "highest": 100, "positive": 136, "fullscore": 100, "fullscores": 61, "highlights": [{"id": "/region/lom/bgtf010003", "name": "Pietro Paleocapa, Bergamo", "description": "is the institute with the most points (500)"}, {"id": "/region/lom", "name": "Lombardia", "description": "is the region with the most points (1700)"}]}, {"name": "glados", "title": "Enrichment Center", "statement": "After playing Portal, Giorgio decided to open his own Enrichment Center and be like GLaDOS in real life. In this kind of research facility, test subjects are locked into chambers and faced with several dangerous puzzles, which need to be solved to gain access to the exit (and to another even riskier chamber). Obviously, there are annoying laws about human rights that would interfere with a faithful implementation of this concept; but Giorgio already planned to get around that by building a very small (and cheap!) Enrichment Center designed for lab rats. Of course, lab rats are not exceptionally smart so the puzzles need to be fairly straightforward. In the first test chamber, Giorgio is planning to arrange into a grid H × W some blocks of the following types: (1) plain floor, represented by `.'; (2) walls, represented by `#'; (3) exits, represented by `O'; (4) transparent glue, represented by `@'...", "points": 2545, "medpos": 50, "avgpos": 54.148936170212764, "average": 7.148876404494382, "highest": 100, "positive": 47, "fullscore": 100, "fullscores": 22, "highlights": [{"id": "/region/tre/tnps01000v", "name": "Galileo Galilei, Trento", "description": "is the institute with the most points (300)"}, {"id": "/region/lom", "name": "Lombardia", "description": "is the region with the most points (605)"}]}, {"name": "mosaic", "title": "Mosaic Composition", "statement": "Giorgio has recently started to build mosaics out of mosaics. A \"mosaic of mosaics\" is a mosaic that, instead of using small pieces of stone or glass, uses actual mosaics as \"tiles\". For simplicity, Giorgio will only use black-and-white square mosaics as tiles for his mosaic. In other words, each tile is a A × A binary matrix. Giorgio has N of such tiles available, and he doesn't need to use all of them. He just needs to arrange some of those pieces in some way as to form a B × B matrix of tiles (that is: a matrix of matrices). Two tiles can be adjacent in the final mosaic only if the colors of the edges match (pixel by pixel). Remember: tiles cannot be rotated nor reflected! Help Giorgio find an arrangement of mosaics that correctly forms a mosaic of mosaics.", "points": 410, "medpos": 5, "avgpos": 5.942028985507246, "average": 1.151685393258427, "highest": 70, "positive": 69, "fullscore": 100, "fullscores": 0, "highlights": [{"id": "/region/val/aops02000l", "name": "I.S.I.L.T.P., Verrès", "description": "is the institute with the most points (70)"}, {"id": "/region/ven", "name": "Veneto", "description": "is the region with the most points (70)"}]}, {"name": "server", "title": "Server Provisioning", "statement": "William is in charge of server provisioning for the Italian Team Olympiads, which essentially means that he has to make sure there are enough resources to sustain the load of users that connect during a contest. Today there is a contest (starting at second 0 and ending at second T) and it's important to spend as little as possible, so William wants to increase the server's power only when needed. We will assume for simplicity that: (1) When a user connects to the server, they will stay connected until the end of the contest. (2) If we pay k euro cent per second, then the server can sustain a load of at most k users per second. (3) At any integer second we can decide to increase the power (and the payment will increase from k euro cent per second to some other amount, greater than k). Since William will also have to supervise the contest, he will ask Giorgio to upgrade the server everytime an upgrade is needed. Upgrading the server is a very difficult and tiring operation...", "points": 1695, "medpos": 25, "avgpos": 17.842105263157894, "average": 4.76123595505618, "highest": 70, "positive": 95, "fullscore": 100, "fullscores": 0, "highlights": [{"id": "/region/laz/lttf09000x", "name": "ITI A. Pacinotti, Fondi", "description": "is the institute with the most points (120)"}, {"id": "/region/lom", "name": "Lombardia", "description": "is the region with the most points (245)"}]}], "points": 23300, "fullscore": 700, "positive": 168, "highest": 535, "average": 65.4494382022472, "avgpos": 138.6904761904762, "medpos": 100, "teams": 356, "id": "3", "ed_num": 8, "highlights": [{"id": "/edition/8/round/3/mosaic", "name": "Mosaic Composition", "description": "is the most difficult task of this contest"}, {"id": "/region/ven/vetf04000t", "name": "Carlo Zuccante, Venezia", "description": "is the institute with the most points (1325)"}, {"id": "/region/lom", "name": "Lombardia", "description": "is the region with the most points (4965)"}], "rank_tot": 161, "rank_reg": 6, "scores": [0, 0, 0, 0, 0, 0, 0], "total": 0}, {"name": "round4", "title": "Round 4", "edition": "8th Edition", "tasks": [{"name": "arena", "title": "Arena Freaks", "statement": "William is a long-time fanatic of OpenArena, an open source FPS (First-Person Shooter) game. For this reason he decided to start a brand-new web portal gathering OpenArena addicts from all over the world: arenafreaks.net. This website addresses multiple different needs of a professional OA player through forums, dedicated social networks, tutorials, rankings, and much more. The feature which William is most proud of, however, is the game database: a huge collection of the most spectacular games ever played in OpenArena, transcribed in arenaic notation (an alfanumeric notation subtly inspired by the algebraic notation of chess games). In this notation, a game between N players (numbered from 0 to N-1) each starting with L lives is transcribed as a series of E events which can be (among many others) of the following types...", "points": 8940, "medpos": 60, "avgpos": 64.78260869565217, "average": 25.1123595505618, "highest": 100, "positive": 138, "fullscore": 100, "fullscores": 54, "highlights": [{"id": "/region/ven/vetf04000t", "name": "Carlo Zuccante, Venezia", "description": "is the institute with the most points (440)"}, {"id": "/region/emi", "name": "Emilia-Romagna", "description": "is the region with the most points (1470)"}]}, {"name": "coats", "title": "Find My Coat", "statement": "During the winter William brings his coat at school, as everybody does. The only problem is that sometimes there are too many people in the classroom, and there's no space to put everybody's coat. The classroom has a coat hanger with N hooks, each of them able to hold 1 or 2 coat (one coat on top of the other). Any more than 2 coats on a single hook would cause it to break under the excessive weight. When students arrive, they usually try to find some empty hook to put their coat on and, if they don't find any, they will put their coat on top of another coat. If every hook has already 2 coats on it, then the student will just keep his coat (and will sweat a lot during the lecture). Today William managed to put his coat on the rack, however, after the end of the lecture, he didn't remember on which hook he had left it. Note that: (1) The coat might be under another coat (so it might be necessary to lift the other coat in order to see it)...", "points": 6785, "medpos": 60, "avgpos": 56.074380165289256, "average": 19.058988764044944, "highest": 100, "positive": 121, "fullscore": 100, "fullscores": 57, "highlights": [{"id": "/region/tre/tnps01000v", "name": "Galileo Galilei, Trento", "description": "is the institute with the most points (500)"}, {"id": "/region/lom", "name": "Lombardia", "description": "is the region with the most points (1600)"}]}, {"name": "finals", "title": "Upsetting Finals", "statement": "William is getting ready for finals, at his university. This semester he has N exams available, each of them with a scheduled time T_i and an \"upsetting coefficient\" U_i. The upsetting value is greater for the most hated exams (some exams are so traumatic that you start to question if you really want to graduate university!). William will try to take as many exams as he can, but he will follow this rule: if he takes an exam at time T_i with an upsetting coefficient of U_i, then he won't be able to endure the stress of taking any other exam in the time interval [T_i - U_i, T_i + U_i]. Help William compute how many exams he can take at most.", "points": 1555, "medpos": 5, "avgpos": 13.521739130434783, "average": 4.367977528089888, "highest": 100, "positive": 115, "fullscore": 100, "fullscores": 6, "highlights": [{"id": "/region/tre/tnps01000v", "name": "Galileo Galilei, Trento", "description": "is the institute with the most points (255)"}, {"id": "/region/emi", "name": "Emilia-Romagna", "description": "is the region with the most points (515)"}]}, {"name": "noblesse", "title": "Notary Club", "statement": "Giorgio has been trying very hard to enter in the exclusive Notary Club during the last few years. Finally, the club administration decided to consider his application, and set a date for his admission test. Following a long-standing tradition of the Notary Club, the would-be novice now has to book (and pay for) a dinner for the whole admission committee (consisting of K grandmasters). This is quite a problem for Giorgio, due to his very limited budget. In fact, the only place he is able to afford is \"Wu Fung's -- Typical Chinese Pizza Kebab\", an informal take-away place which also offers N comfortable stools, the i-th of them located X_i centimeters from the start of the counter. Giorgio knows very well Wu Fung's, and is worried that the rowdy customers of the place might jeopardize his chances of success. There is only one slight chance left: to carefully book K places (not necessarily consecutive) so as to maximise the distance between the grandmasters and the rowdy customers...", "points": 730, "medpos": 5, "avgpos": 7.087378640776699, "average": 2.050561797752809, "highest": 40, "positive": 103, "fullscore": 100, "fullscores": 0, "highlights": [{"id": "/region/emi/bois01400r", "name": "I.I.S. F. Alberghetti, Imola", "description": "is the institute with the most points (60)"}, {"id": "/region/lom", "name": "Lombardia", "description": "is the region with the most points (130)"}]}, {"name": "partition", "title": "Array Partition", "statement": "Giorgio is working on a research paper which involves the partition step of the Quicksort algorithm. The partition step works like this: we choose some element of the array (it doesn't matter which one), which will then be called pivot element. Then we move all the array elements in such a way that, in the end: (1) all the elements on the left of the pivot are smaller than it; (2) all the elements on the right of the pivot are greater than it. For example, let's take this array: 2, 6, 1, 5, 7, 8, 9, 4, 3. Let's say we choose the second element as pivot (the one with value 6). On the left, there is only one element with value 2, which is smaller than 6, so the \"left partitioning\" is already satisfied. On the right, however, there are some elements which are not grater than 6, so we should move them in order to obtain a correct partition. So, a valid partition (among many) of the array is this: 2, 3, 4, 1, 5, 6, 9, 7, 8...", "points": 10265, "medpos": 90, "avgpos": 77.76515151515152, "average": 28.834269662921347, "highest": 90, "positive": 132, "fullscore": 100, "fullscores": 0, "highlights": [{"id": "/region/laz/rmis084008", "name": "Federico Caffe, Roma", "description": "is the institute with the most points (540)"}, {"id": "/region/ven", "name": "Veneto", "description": "is the region with the most points (1725)"}]}, {"name": "socks", "title": "Washing Socks", "statement": "Since William started attending university, he had to learn how to live on his own. He quickly mastered the art of cooking (that was an easy one, since Italian people only eat pasta) and, most importantly, how to do the laundry. William found out that he really hates washing socks because they come in pairs (as opposed to t-shirts and other types of clothes) so they get mixed up too easily. To avoid mixing up his socks, William found a clever solution: he will use a robot to move the socks in the \"correct\" place. In the washing machine there are N socks, each of those being of a specific color specified by an integer number between 0 and C-1, where C is the total number of colors. William takes each sock out of the washing machine and puts it on the clothesline. The robot will then start repeatedly swapping the sock with the adjacent one, until they match colors...", "points": 3560, "medpos": 5, "avgpos": 29.915966386554622, "average": 10.0, "highest": 100, "positive": 119, "fullscore": 100, "fullscores": 13, "highlights": [{"id": "/region/ven/vetf04000t", "name": "Carlo Zuccante, Venezia", "description": "is the institute with the most points (310)"}, {"id": "/region/ven", "name": "Veneto", "description": "is the region with the most points (705)"}]}, {"name": "taxes", "title": "Tax Return", "statement": "This year Giorgio has been working on a lot of projects, each with very different characteristics. Now it is time to fill in the tax return, and it is going to be a serious mess! In particular, Giorgio has collected the following incomes: (1) X euros as Partita IVA (independent contractor); (2) Y euros as Lavoro Occasionale (casual work); (3) Z euros as Lavoro Dipendente (dependent employment). Furthermore, he has also kept a single bill of W euros due to a medical expense. The fiscal system in Italy is quite intricate, but for our purposes can be simplified to the following: (1) Partita IVA income is taxed separately at 40%; (2) Lavoro Occasionale income is tax-free up to 5000 euros, and any additional amount is taxed together with lavoro dipendente incomes; (3) Lavoro Dipendente income is taxed at 20% up to 10000 euros, and at 60% for the additional amount...", "points": 3980, "medpos": 5, "avgpos": 31.338582677165356, "average": 11.179775280898877, "highest": 100, "positive": 127, "fullscore": 100, "fullscores": 26, "highlights": [{"id": "/region/lom/mnis01100e", "name": "I.S. Fermi MN, Mantova", "description": "is the institute with the most points (245)"}, {"id": "/region/emi", "name": "Emilia-Romagna", "description": "is the region with the most points (1050)"}]}], "points": 35815, "fullscore": 700, "positive": 161, "highest": 630, "average": 100.60393258426966, "avgpos": 222.45341614906832, "medpos": 175, "teams": 356, "id": "4", "ed_num": 8, "highlights": [{"id": "/edition/8/round/4/noblesse", "name": "Notary Club", "description": "is the most difficult task of this contest"}, {"id": "/region/tre/tnps01000v", "name": "Galileo Galilei, Trento", "description": "is the institute with the most points (2090)"}, {"id": "/region/emi", "name": "Emilia-Romagna", "description": "is the region with the most points (6665)"}], "rank_tot": 160, "rank_reg": 4, "scores": [0, 0, 0, 0, 0, 0, 0], "total": 0}], "id": "team317", "name": "Volo Team", "institute": "Istituto Tecnico Franchetti - Salviani, Città Di Castello", "inst_id": "pgtf19000v", "region": "umb", "fullregion": "Umbria", "coach": "Giovanni Rossi", "members": "", "finalist": false, "medals": [0, 0, 0, 0], "rank_reg": 7, "rank_tot": 251, "rank_excl": 232, "bestrank": 160, "avgrank": 33.89671361502347, "points": 0, "ed_num": 8, "edition": "8th Edition", "year": "2016/17", "highlights": [{"id": "/edition/8/round/3/mosaic", "name": "Mosaic Composition", "description": "is the hardest task solved by the team"}, {"id": "/edition/8/round/4", "name": "Round 4", "description": "is the round with the highest rank (160)"}]}