{"contests": [{"name": "round1", "title": "Round 1", "edition": "11th Edition", "tasks": [{"name": 23, "title": "Bases Conversion", "statement": "Your professor has just introduced you to the different bases in which a number can be written and wants to test your understanding. His favourite number is 23 (this should not surprise you too much… it is a prime number!) and for this reason his favourite bases are 2 and 3. A number is called special if and only if the sum of the digits of its base two representation is the same as the sum of the digits of its base three representation. Consider the number 6_(10) (the subscript denotes the basis) = 110_(2) = 20_(3). The sum of the digits in base two is 1 + 1 + 0 = 2, which is exactly the sum of the digits in base three: 2 + 0 = 2. Thus, number 6_(10) is special. On the contrary, the number 9_(10) = 1001_(2) = 100_(3) is not special (the sums of digits are 2 and 1, respectively). In order to keep the class busy without much work on his side, your professor has come up with a boring homework assignment...", "points": 7215, "medpos": 30, "avgpos": 44.81366459627329, "average": 14.287128712871286, "highest": 100, "positive": 161, "fullscore": 100, "fullscores": 3, "highlights": [{"id": "/region/ven/tvtf04000t", "name": "ITI Planck, Villorba", "description": "is the institute with the most points (335)"}, {"id": "/region/lom", "name": "Lombardia", "description": "is the region with the most points (1265)"}]}, {"name": "blindpunch", "title": "Kill Those Bugs!", "statement": "In the middle of the night Luca has been attacked by bugs, which are very well organised and form a line in front of his bed. In order to protect himself, Luca has K slippers to be thrown at the bugs one at a time (but optionally he can throw multiple slippers at the same bug). The bugs, being very creative, are playing dead to fool him: the room is dark and he can only barely see the bugs, without knowing which ones are squashed and which are alive. Fortunately, Luca knows that the i-th bug in the line of N bugs has a probability P_i to be squashed when he throws a slipper at it. That probability does not change, meaning that subsequent slippers also have a probability P_i to kill it, if it is not already killed. Luca is very tired and hates bugs crawling around in his room in the middle of the night. Help him use the slippers in the wisest way possible, in order to maximize the expected number of killed bugs.", "points": 1550, "medpos": 100, "avgpos": 91.17647058823529, "average": 3.0693069306930694, "highest": 100, "positive": 17, "fullscore": 100, "fullscores": 12, "highlights": [{"id": "/region/lom/mips240005", "name": "Banfi, Vimercate", "description": "is the institute with the most points (200)"}, {"id": "/region/lom", "name": "Lombardia", "description": "is the region with the most points (540)"}]}, {"name": "butoaie", "title": "Save The Barrels", "statement": "A swarm of bugs from Bugland invaded William's wine cellar trough a magic portal. The wine cellar consists of N rooms, each full of barrels of wine, with the i-th room being infested by V_i bugs. William has at his disposal N insecticide diffusers of two types: K AntiBug which remove P bugs a day, and N-K ZeroBugs, which remove Q bugs a day. Every day, at most one diffuser can be used in every room without compromising the quality of the wine. What is the minimum number of days needed to save the barrels of wine by eliminating all the bugs?", "points": 2890, "medpos": 30, "avgpos": 30.74468085106383, "average": 5.7227722772277225, "highest": 50, "positive": 94, "fullscore": 100, "fullscores": 0, "highlights": [{"id": "/region/tre/tnps01000v", "name": "Galileo Galilei, Trento", "description": "is the institute with the most points (160)"}, {"id": "/region/emi", "name": "Emilia-Romagna", "description": "is the region with the most points (480)"}]}, {"name": "fibonaccibug", "title": "Fibonacci Colonies", "statement": "Bug colonies have been the center of attention of scientists for a long time. Through some technological advancements, we are now able to describe a bug colony using a number known as the degree of the colony. A colony of degree 0 or 1 represents a colony with one bug. A colony of degree i > 1 is obtained by merging a colony of degree i - 1 together with a colony of degree i - 2. As such, a colony of degree 2 has two bugs, a colony of degree 3 has three bugs, a colony of degree 4 has five bugs and so on. Marco owns the biggest bug farm in the world, having at his disposal a virtually infinite amount of colonies of any degree. Every day he receives N offers, each described by two numbers A_i and B_i, meaning that he can sell as many colonies of degree A_i as he wants and get B_i money for each colony of that degree...", "points": 980, "medpos": 10, "avgpos": 37.69230769230769, "average": 1.9405940594059405, "highest": 100, "positive": 26, "fullscore": 100, "fullscores": 5, "highlights": [{"id": "/region/fri/pntf01000a", "name": "ITST Kennedy, Pordenone", "description": "is the institute with the most points (190)"}, {"id": "/region/fri", "name": "Friuli-Venezia Giulia", "description": "is the region with the most points (300)"}]}, {"name": "funnygraph", "title": "Funny Circuits", "statement": "Marco is studying electronics at Politecnico di Milano and his teacher assigned him an experimental project to do at the lab. The project is pretty simple: he has a circuit board with N connection points, and he should connect M components to those points, in the given order from component 0 to M-1. Each component i has a characteristic integral potential difference z_i and two terminals, which have to be connected to two given connection points a_i and b_i. Once a circuit is built, each of the connection points j=0 … N-1 naturally acquires a potential P_j. Furthermore, the i-th component can work correctly only provided that the difference of the potentials of its terminals is exactly z_i: in formulas, if P_a_i - P_b_i = z_i (or equivalently P_b_i - P_a_i = -z_i: the orientation of components matters). The laws of electromagnetism ensure that whenever an assignment of potentials satisfying the potential differences of components exists, such an assignment will naturally arise...", "points": 395, "medpos": 15, "avgpos": 35.90909090909091, "average": 0.7821782178217822, "highest": 100, "positive": 11, "fullscore": 100, "fullscores": 3, "highlights": [{"id": "/region/umb/trps03000x", "name": "R. Donatelli, Terni", "description": "is the institute with the most points (100)"}, {"id": "/region/fri", "name": "Friuli-Venezia Giulia", "description": "is the region with the most points (115)"}]}, {"name": "grades", "title": "Improving Grades", "statement": "In Italy, every parent of a high-school student can check how their child is doing in terms of grades. In fact, at any given moment the parent can access the \"electronic register\" where the professors regularly upload the grades obtained by their students in the various tests throughout the year. Edoardo is in high-school, and he's definitely not the best of his class: he regularly gets lots of insufficient grades! Grades in Italian high-schools go from 2 to 10, and a grade is said to be \"sufficient\" when it is higher than or equal to 6. Luckily, Edoardo's parents are not very tech-savvy: they know how to use a tablet, but they can't access the \"electronic register\" website on their own. Edoardo thinks this is a good thing, since all of his friends are constantly kept in check by their parents. The end of the year is getting close so, today, Edoardo's parents asked him to show them his grades. He thought about cheating (faking the website content) but he would feel bad about it...", "points": 25700, "medpos": 100, "avgpos": 96.61654135338345, "average": 50.89108910891089, "highest": 100, "positive": 266, "fullscore": 100, "fullscores": 253, "highlights": [{"id": "/region/lom/bsis037004", "name": "I.S. Castelli, Brescia", "description": "is the institute with the most points (900)"}, {"id": "/region/lom", "name": "Lombardia", "description": "is the region with the most points (4300)"}]}, {"name": "smartphone", "title": "Compulsive Smartphone Shopping", "statement": "Edoardo is very passionate about technology, especially about smartphones. Unfortunately, he just dropped his phone and the screen shattered, so he needs to buy another one as soon as possible! Edoardo is going to visit N shops in order. Every time he enters a new shop, he looks for the phone with the highest price and, if it is strictly more valuable than all of the smartphones he currently has, he buys it. Edoardo doesn't skip any shop, even if he has already purchased a smartphone elsewhere (he wants only the very best!). You know that the most valuable smartphone in the i-th shop costs P_i. You also know that the initial smartphone has no value, since it is broken. How much will Edoardo spend in total?", "points": 34390, "medpos": 100, "avgpos": 89.55729166666667, "average": 68.0990099009901, "highest": 100, "positive": 384, "fullscore": 100, "fullscores": 327, "highlights": [{"id": "/region/abr/peis00600b", "name": "A. Volta, Pescara", "description": "is the institute with the most points (1100)"}, {"id": "/region/emi", "name": "Emilia-Romagna", "description": "is the region with the most points (4890)"}]}, {"name": "sprei", "title": "Ant Supercolonies", "statement": "Giorgio's house has a huge bugs problem: N colonies of ants are infesting the place, and he must kill them once and for all! Since he is a very abstract person, Giorgio lives in a M-dimensional cube of side B, so that the position of every ant colony can be represented as an array of coordinates (A_1, A_2, …, A_M) with integer values ranging from 0 to B-1. Since ants are social entities, they always try to unify the colonies. Thereby, if two colonies are adjacent in the house (the position of one is obtained by adding or subtracting 1 from a single coordinate of the position of the other), they build a tunnel among them, creating a supercolony unifying the two smaller colonies and exacerbating the infestation power by orders of magnitude. Giorgio knows the positions of the N colonies, and can use pest control for destroying any one of them...", "points": 170, "medpos": 10, "avgpos": 18.88888888888889, "average": 0.33663366336633666, "highest": 60, "positive": 9, "fullscore": 100, "fullscores": 0, "highlights": [{"id": "/region/fri/pntf01000a", "name": "ITST Kennedy, Pordenone", "description": "is the institute with the most points (60)"}, {"id": "/region/fri", "name": "Friuli-Venezia Giulia", "description": "is the region with the most points (70)"}]}, {"name": "teleport2", "title": "Secret Meeting", "statement": "Everyone knows that in Bugland rooms are an infinite plane surface in which each point is described by two coordinates (x, y): in particular, two bugs A and B are now waiting at coordinates (X_a, Y_a) and (X_b, Y_b). It is well known that in Bugland beds are perfect circles, described by the coordinates of their center and their radius: in particular, in the mentioned room there is a single bed with center C = (X_c, Y_c) and radius R. A and B want to have a secret meeting to plan the invasion of the room: thus, they need to move as silent as possible, according to any trajectory, and gather this way to a common meeting point (X_m, Y_m) (not necessarily of integer coordinates). Walking on the floor one unit makes 1 NU (Noise Unit): for example, walking from (1, 1) to (3, 1) makes 2 NU, and walking from (1, 1) to (3, 2) makes √5 NU. On the other hand, walking on the bed is completely silent. Help the two bugs A and B meet, using a path allowing the sum of their NUs to be minimal.", "points": 4480, "medpos": 35, "avgpos": 55.30864197530864, "average": 8.871287128712872, "highest": 100, "positive": 81, "fullscore": 100, "fullscores": 39, "highlights": [{"id": "/region/fri/udps05000p", "name": "Liceo Scientifico N. Copernico, Udine", "description": "is the institute with the most points (200)"}, {"id": "/region/lom", "name": "Lombardia", "description": "is the region with the most points (850)"}]}], "points": 77770, "fullscore": 900, "positive": 396, "highest": 810, "average": 154.0, "avgpos": 196.38888888888889, "medpos": 200, "teams": 505, "id": "1", "ed_num": 11, "highlights": [{"id": "/edition/11/round/1/sprei", "name": "Ant Supercolonies", "description": "is the most difficult task of this contest"}, {"id": "/region/ven/tvtf04000t", "name": "ITI Planck, Villorba", "description": "is the institute with the most points (2395)"}, {"id": "/region/lom", "name": "Lombardia", "description": "is the region with the most points (12095)"}], "rank_tot": 354, "rank_reg": 21, "scores": [0, 0, 0, 0, 0, 0, 30, 0, 0], "total": 30}, {"name": "round2", "title": "Round 2", "edition": "11th Edition", "tasks": [{"name": "antennas", "title": "Dangerous Flowers", "statement": "After yet another fight with his girlfriend, William knows very well that there is only one way to be forgiven: bring her a bouquet of fresh edelweiss flowers, her favourites. These flowers can be easily found in the mountains where William lives, however, you are not allowed to pick them unless you have a special permit. But there's no time for bureaucracy after such a fight, so he gotta take the risk and pick them without it! Unfortunately, after picking up the very first flower, he triggered an unexpected alarm! By quickly hacking the alarm control unit, William realised that the warning is going to be transmitted to the forestry police by a line of N directional antennas in the mountains. Each antenna has a receiver with a threshold level of L_i decibel, and is able to transmit to following antennas with a power of P_i decibels. The signal decreases in strength by D decibel while travelling the distance between any two consecutive antennas...", "points": 605, "medpos": 35, "avgpos": 35.588235294117645, "average": 1.198019801980198, "highest": 100, "positive": 17, "fullscore": 100, "fullscores": 1, "highlights": [{"id": "/region/fri/pntf01000a", "name": "ITST Kennedy, Pordenone", "description": "is the institute with the most points (110)"}, {"id": "/region/lom", "name": "Lombardia", "description": "is the region with the most points (140)"}]}, {"name": "bonus", "title": "Worst Exam Ever!", "statement": "After long weeks of waiting, Edoardo has finally got back the results of the last exam he took. The exam was made of N exercises, the i-th exercise had a maximum score of P_i points and he scored S_i points. Edoardo is not happy of the grade he received, and is considering to take it again. However, the professor doesn't want yet another exam to grade… and thus he decided to give him a generous bonus! More precisely, Edoardo can choose exactly one of the N exercises and that exercise will be discarded and will not take part in the grading of the exam. Note that the grade of the exam is defined as the ratio between the sum of points scored and the sum of maximum scores (excluding in both sums the exercise discarded, thanks to the generous bonus). Help Edoardo find which exercise to discard in order to get the best grade possible!", "points": 16975, "medpos": 35, "avgpos": 56.583333333333336, "average": 33.613861386138616, "highest": 100, "positive": 300, "fullscore": 100, "fullscores": 107, "highlights": [{"id": "/region/tre/tnps01000v", "name": "Galileo Galilei, Trento", "description": "is the institute with the most points (610)"}, {"id": "/region/lom", "name": "Lombardia", "description": "is the region with the most points (2775)"}]}, {"name": "evacuation", "title": "Orderly Evacuation", "statement": "The OIS control room, where the staff prepares tasks for the contests, consists of N workstations (numbered from 0 to N-1) each assigned to a staff member (so that workstation i is assigned to staff member i). Whenever the room alarm signals that lunch is ready, the whole staff rushes for the exit of the room, which is located by workstation 0, while orderly following the evacuation plan. The evacuation plan of the room has a tree shape, so that anyone in workstation i has only one option for going towards the exit, which is workstation E_i (we say that E_0 = -1 to represent that workstation 0 is connected to the exit). However, multiple workstations i, j may compete for the same E_i = E_j, forcing the staff members to use their arrogance to move forward. More precisely, every staff member i has an arrogance score A_i, and the evacuation proceeds as follows: (1) The staff member in workstation 0 exits the room...", "points": 1815, "medpos": 80, "avgpos": 64.82142857142857, "average": 3.594059405940594, "highest": 100, "positive": 28, "fullscore": 100, "fullscores": 14, "highlights": [{"id": "/region/lom/mnis01100e", "name": "I.S. Fermi MN, Mantova", "description": "is the institute with the most points (200)"}, {"id": "/region/lom", "name": "Lombardia", "description": "is the region with the most points (500)"}]}, {"name": "events", "title": "Cultural Events", "statement": "Luca recently moved to Lugano, Switzerland, to complete his graduate studies. He is eager to discover the cultural scene of the city and he is constantly looking for cool events to participate in! His main concern is about the prices of the tickets for those events, which are often not very cheap (like almost everything in Switzerland!). The university comes to the rescue, as it offers some vouchers to attend events for free. You can buy the ticket for a certain event if you use a voucher whose value is high enough (at least equal to or greater than the price of the event). Once you use a voucher to buy a ticket, it cannot be used anymore. Luca made a list of N interesting events with their prices and, so far, has collected V vouchers of different values from his university. He has no particular preference regarding the kind of event; he just wants to participate in as many as possible and asks you to help him.", "points": 10610, "medpos": 100, "avgpos": 72.17687074829932, "average": 21.00990099009901, "highest": 100, "positive": 147, "fullscore": 100, "fullscores": 90, "highlights": [{"id": "/region/tre/tnps01000v", "name": "Galileo Galilei, Trento", "description": "is the institute with the most points (530)"}, {"id": "/region/emi", "name": "Emilia-Romagna", "description": "is the region with the most points (1695)"}]}, {"name": "examroom", "title": "Exam Room", "statement": "Giorgio, famous university teacher, tomorrow is going to do the surveillance during his exam of Competitive Programming. In fact, even though the students are usually very honest, there is always someone that tries to cheat. To prevent it, Giorgio is studying a disposition for the students in the room that maximizes the distance between each student. The exam room is composed by R × C seats arranged in a rectangle of R rows and C columns. Giorgio wants his students to be arranged in rows and columns as well, but skipping some rows and some columns to space them out. Given a distance factor K, each student must be at least K seats away (K-1 seats in between) from the ones in his row and column. Help him find the maximum number of students that fit inside the classroom.", "points": 26600, "medpos": 100, "avgpos": 82.3529411764706, "average": 52.67326732673267, "highest": 100, "positive": 323, "fullscore": 100, "fullscores": 243, "highlights": [{"id": "/region/ven/tvtf04000t", "name": "ITI Planck, Villorba", "description": "is the institute with the most points (1020)"}, {"id": "/region/emi", "name": "Emilia-Romagna", "description": "is the region with the most points (4015)"}]}, {"name": "ip", "title": "IP Address", "statement": "Marco is trying to hack the network in his university. In order to do so, he needs to send a malicious packet to each computer that might be connected to the same network. Just to be sure, Marco decided to send the packet to a range of IP addresses. An IP address is a set of four “octets” separated by dots (each “octet” is an integer in the 0 to 255 inclusive range). For example, 127.0.0.1, 192.168.2.3 and 255.255.255.255 are valid IP addresses, while something like 10.20.300.4000 is not. Given an IP address, we can increment it and go to the next address in this way: if the last octet is less than 255 then we increment it by 1, otherwise we set it to 0 and increment the second-last octet (repeating this in a similar way to the left if necessary). This is similar to what happens when we increment a number by 1: if the last digit is 9 then we need to set it to 0 and increment the second-last digit (which could be 9 as well and so on)...", "points": 24120, "medpos": 100, "avgpos": 85.53191489361703, "average": 47.76237623762376, "highest": 100, "positive": 282, "fullscore": 100, "fullscores": 201, "highlights": [{"id": "/region/ven/tvtf04000t", "name": "ITI Planck, Villorba", "description": "is the institute with the most points (1020)"}, {"id": "/region/ven", "name": "Veneto", "description": "is the region with the most points (3850)"}]}, {"name": "machine", "title": "Maintenance Planning", "statement": "At Amedoro-7-9, the manufacturing company owned by the problemist Luca, a lot of machines are used for producing all sorts of things. The end of the year is approaching and his accounting department started analyzing the profits and the expenses of the year. The results? Terrible! Luca has become angrier than ever, threatening to fire his employees if they don't find a solution immediately! Night after night, the employees finally found out the cause of the loss: bad management of The Machine. The Machine is the main component of the factory, it costs C euros to be bought new, and every year you'll have to pay M[a] euros for the maintenance (a>0 is the age in years of The Machine). Of course you can sell an old The Machine, recovering part of its costs: after a>0 years The Machine can be sold for P[a] euros. After D years The Machine is too old to be used and has to be sold. For example if The Machine costs C and has a lifespan of D years, after the first year you have to pay C+M[1]...", "points": 1500, "medpos": 45, "avgpos": 55.55555555555556, "average": 2.9702970297029703, "highest": 100, "positive": 27, "fullscore": 100, "fullscores": 3, "highlights": [{"id": "/region/tre/tnpc02000a", "name": "Antonio Rosmini, Rovereto", "description": "is the institute with the most points (180)"}, {"id": "/region/tre", "name": "Trentino", "description": "is the region with the most points (280)"}]}, {"name": "ransomware", "title": "Encrypted Contacts", "statement": "Marco's phone has been attacked by hackers with a ransomware: they have remotely encrypted the phone book with all his contacts and now he has been asked to pay a ransom in bitcoins to recover his data. He has decided to have some fun trying to perform a full reverse engineering of the malware to recover data without having to pay money. Fortunately for him, the encryption scheme is not too sophisticated. The malware encrypts each digit in isolation and substitutes it with a code. For every digit from 0 to 9, Marco has been able to determine which was the corresponding code. For instance, suppose that digit 0 hash been replaced with the code 12345 and that the digit 1 has been replaced with the code 1235; in this scenario an hypothetical number 010 would have been encrypted with the sequence of digits 12345123512345. After all this grueling work, Marco asks you a small help: recover the original unencrypted numbers for his N contacts in the phone book.", "points": 8470, "medpos": 100, "avgpos": 89.15789473684211, "average": 16.77227722772277, "highest": 100, "positive": 95, "fullscore": 100, "fullscores": 74, "highlights": [{"id": "/region/lom/bgtf010003", "name": "Pietro Paleocapa, Bergamo", "description": "is the institute with the most points (400)"}, {"id": "/region/lom", "name": "Lombardia", "description": "is the region with the most points (1530)"}]}], "points": 90695, "fullscore": 800, "positive": 361, "highest": 800, "average": 179.59405940594058, "avgpos": 251.23268698060943, "medpos": 220, "teams": 505, "id": "2", "ed_num": 11, "highlights": [{"id": "/edition/11/round/2/antennas", "name": "Dangerous Flowers", "description": "is the most difficult task of this contest"}, {"id": "/region/ven/tvtf04000t", "name": "ITI Planck, Villorba", "description": "is the institute with the most points (2940)"}, {"id": "/region/lom", "name": "Lombardia", "description": "is the region with the most points (13910)"}], "rank_tot": 358, "rank_reg": 24, "scores": [0, 0, 0, 0, 0, 0, 0, 0], "total": 0}], "id": "pie22", "name": "inafuT onaidnI", "institute": "G.B. Pininfarina, Moncalieri", "inst_id": "totf04000d", "region": "pie", "fullregion": "Piemonte", "coach": "Rocco Catalano", "members": "", "finalist": null, "medals": [0, 0, 0, 0], "rank_reg": 27, "rank_tot": 401, "rank_excl": 379, "bestrank": 354, "avgrank": 29.563492063492063, "points": 30, "ed_num": 11, "edition": "11th Edition", "year": "2019/20", "highlights": [{"id": "/edition/11/round/1/smartphone", "name": "Compulsive Smartphone Shopping", "description": "is the hardest task solved by the team"}, {"id": "/edition/11/round/1", "name": "Round 1", "description": "is the round with the highest rank (354), total points (30), partial scores (1), maximum score (30) and regional rank (21)"}]}