{"contests": [{"name": "round1", "title": "Round 1", "edition": "7th Edition", "tasks": [{"name": "bicollatz", "title": "Congettura di Bicollatz", "statement": "Dopo lunghi e accurati studi sulla congettura di Lollatz, Giorgio ha deciso che è giunto finalmente il momento di creare una nuova congettura egli stesso. Propone quindi la nuova congettura di Bicollatz, descritta dal seguente procedimento. Dati due numeri interi positivi A e B, si ripete il seguente passaggio: (1) se A e B sono entrambi pari, si dividono entrambi per due; (2) se A e B sono entrambi dispari, ciascuno dei due si moltiplica per tre e si aggiunge uno; (3) altrimenti, si aggiunge 3 a quello dei due che è dispari. La congettura dice che ripetendo questo passaggio, si arriva sempre prima o poi a ottenere che A,B = (1,1). Aiuta Giorgio a verificare la sua congettura!", "points": 9190, "medpos": 50, "avgpos": 65.64285714285714, "average": 43.76190476190476, "highest": 100, "positive": 140, "fullscore": 100, "fullscores": 43, "highlights": [{"id": "/region/ven/viis02300x", "name": "IIS Tron - Zanella, Schio", "description": "is the institute with the most points (520)"}, {"id": "/region/emi", "name": "Emilia-Romagna", "description": "is the region with the most points (2470)"}]}, {"name": "insegna", "title": "Las Vegas", "statement": "Giorgio e William si devono incontrare segretamente in un locale di Las Vegas per definire i problemi delle gare a squadre di quest'anno. Purtroppo, a Las Vegas tutti i locali hanno insegne circolari rotanti, quindi è molto difficile trovare il luogo sul quale si sono accordati. Dopo un po' di tempo passato a cercare William, Giorgio legge una stringa G su un'insegna e decide di contattarlo. Quest'ultimo nel frattempo si è perso per le strade di Las Vegas, ma per fortuna riesce anche lui a vedere un'insegna con su scritta una stringa W. Dal momento che i tempi per le olimpiadi si stanno facendo stringenti, i due vogliono capire se almeno si trovano nella stessa parte della città, così da riuscire ad incontrarsi e decidere una volta per tutte i problemi. Le due stringhe G e W si riferiscono allo stesso luogo quando sono la stessa stringa a meno di una permutazione ciclica (o rotazione). Indichiamo con |G| la lunghezza di G...", "points": 5500, "medpos": 100, "avgpos": 65.47619047619048, "average": 26.19047619047619, "highest": 100, "positive": 84, "fullscore": 100, "fullscores": 44, "highlights": [{"id": "/region/abr/peis00600b", "name": "A. Volta, Pescara", "description": "is the institute with the most points (320)"}, {"id": "/region/emi", "name": "Emilia-Romagna", "description": "is the region with the most points (1190)"}]}, {"name": "energia", "title": "Spreco di energia", "statement": "William è molto attento agli sprechi in casa: ogni volta che una spia o un display rimangono accesi, lui corre a spegnerli per risparmiare sulla bolletta. In certi casi è arrivato anche a scollegare i fili dei display meno essenziali (quello del videoregistratore, ad esempio) pur di evitare di lasciarli perennemente accesi. Purtroppo però, il suo contatore elettrico è stato installato dal fornitore nazionale di energia, e sarebbe illegale manometterlo al fine di spegnergli il display! Il povero William quindi non può far altro che accettare di pagare una bolletta esorbitante a causa di questo display costantemente acceso. Il contatore installato a casa di William presenta un display a sette segmenti, lo stesso che si trova in molti tipi di radiosveglia. Questo tipo di display dispone di 7 led per ciascuna cifra. Nello schema di seguito si può vedere il numero di led richiesti per illuminare le varie cifre...", "points": 3500, "medpos": 70, "avgpos": 44.30379746835443, "average": 16.666666666666668, "highest": 80, "positive": 79, "fullscore": 100, "fullscores": 0, "highlights": [{"id": "/region/emi/fois01100l", "name": "Pascal - Comandini, Cesena", "description": "is the institute with the most points (310)"}, {"id": "/region/ven", "name": "Veneto", "description": "is the region with the most points (940)"}]}, {"name": "permutazione", "title": "Permutazione genetica", "statement": "Da quando ha cominciato a lavorare come ricercatore, Giorgio si diverte a fare esperimenti su cavie animali. In particolare si è deciso ad ottenere due topi superintelligenti, proprio come nel suo cartone preferito: per raggiungere questo obiettivo però, Giorgio deve incrementare esponenzialmente il potenziale genetico dei due topi da laboratorio a sua disposizione. Il nostro protagonista ritiene infatti che una semplice mutazione genetica non sia sufficiente a raggiungere l'obiettivo, e per questo motivo decide di produrre una permutazione genetica. Per gli scopi di Giorgio, definiamo una permutazione genetica come una stringa lunga 26 caratteri che vanno dalla lettera A alla Z. In particolare, affinché la mutazione abbia effetto, è necessario che la sua funzione espotenziale valga esattamente K...", "points": 1060, "medpos": 10, "avgpos": 35.333333333333336, "average": 5.0476190476190474, "highest": 100, "positive": 30, "fullscore": 100, "fullscores": 7, "highlights": [{"id": "/region/emi/reis01600q", "name": "Blaise Pascal, Reggio Nell'Emilia", "description": "is the institute with the most points (200)"}, {"id": "/region/emi", "name": "Emilia-Romagna", "description": "is the region with the most points (530)"}]}, {"name": "estintori", "title": "Controllo degli estintori", "statement": "William e Giorgio sono appena stati promossi a ispettori di sicurezza alla Scuola Internazionale di Alta Formazione (SIAF), la struttura che si trova a Volterra e che viene utilizzata per svolgere molti degli stage di allenamento dei Probabili Olimpici. Affinché la struttura possa essere adatta ad ospitare tanti giovani ragazzi e ragazze, è necessario che le norme di sicurezza vengano rispettate alla lettera. Il direttore della SIAF ha quindi chiesto ai nuovi ispettori di aiutarlo ad analizzare la piantina della struttura in modo da trovare eventuali anomalie. La richiesta del direttore è la seguente: viene data una mappa della SIAF in formato testuale, in cui le stanze (carattere .) sono delimitate dai muri (carattere #) e possono contenere 0 o più estintori (carattere @), ed è necessario capire in quali stanze non c'è un estintore...", "points": 2110, "medpos": 10, "avgpos": 31.96969696969697, "average": 10.047619047619047, "highest": 100, "positive": 66, "fullscore": 100, "fullscores": 14, "highlights": [{"id": "/region/lom/bgtf010003", "name": "Pietro Paleocapa, Bergamo", "description": "is the institute with the most points (170)"}, {"id": "/region/emi", "name": "Emilia-Romagna", "description": "is the region with the most points (510)"}]}, {"name": "ricostruzioni", "title": "Maxi-server", "statement": "Ora che le gare a squadre di informatica stanno coinvolgendo sempre più la nazione, il quartier generale delle Olimpiadi ha bisogno di costruire un nuovo maxi-server in modo da gestire efficientemente la competizione. Questo maxi-server dovrà essere lungo K metri, e dovrà essere collocato in un punto segreto in cui però la corrente elettrica sia facilmente disponibile. Per questo motivo William ha selezionato, tra tutte le linee elettriche italiane, la linea A/C51 che attraversa le alpi da una parte all'altra garantendo la giusta dose di riservatezza. Ora rimane solo da individuare il punto esatto in cui costruire il maxi-server! A complicare la scelta, tuttavia, rimane il fatto che la linea A/C51 attraversa zone con altitudini molto diverse, e che per giunta cambiano molto rapidamente, mentre il maxi-server andrà costruito necessariamente in piano. William sa che nel metro i della linea (lunga complessivamente N metri) l'altitudine sul livello del mare è di A_i metri...", "points": 2470, "medpos": 15, "avgpos": 35.285714285714285, "average": 11.761904761904763, "highest": 100, "positive": 70, "fullscore": 100, "fullscores": 3, "highlights": [{"id": "/region/ven/veis02700x", "name": "Levi - Ponti, Mirano", "description": "is the institute with the most points (130)"}, {"id": "/region/emi", "name": "Emilia-Romagna", "description": "is the region with the most points (640)"}]}, {"name": "olimpo", "title": "Genealogia antica", "statement": "La passione di Giorgio per i giochi di ruolo lo ha portato di recente a interessarsi alla mitologia classica. Sta quindi cercando di ricostruire la lunga genealogia dei discendenti di Zeus, nella speranza di dimostrare che la sua stirpe discende proprio dalla somma divinità. Purtroppo però le informazioni che riesce a carpire dagli antichi manoscritti sono molto carenti, e non è facile ricostruire l'albero dei discendenti di Zeus! In questo albero, Zeus (indicato con il numero 0) costituisce la radice, i suoi figli costituiscono i suoi immediati successori, e così via fino a elencare tutta la genealogia. Di ognuno degli N-1 discendenti di Zeus si conosce o il padre (P), oppure il nonno (N) oppure il bisnonno (B); ma sempre solo uno dei tre. Dopo una lunga ricerca, Giorgio non è riuscito a trovare prove del suo collegamento con Zeus...", "points": 1990, "medpos": 10, "avgpos": 28.428571428571427, "average": 9.476190476190476, "highest": 100, "positive": 70, "fullscore": 100, "fullscores": 7, "highlights": [{"id": "/region/ven/vetf04000t", "name": "Carlo Zuccante, Venezia", "description": "is the institute with the most points (190)"}, {"id": "/region/emi", "name": "Emilia-Romagna", "description": "is the region with the most points (560)"}]}], "points": 25820, "fullscore": 700, "positive": 151, "highest": 680, "average": 122.95238095238095, "avgpos": 170.9933774834437, "medpos": 120, "teams": 210, "id": "1", "ed_num": 7, "highlights": [{"id": "/edition/7/round/1/permutazione", "name": "Permutazione genetica", "description": "is the most difficult task of this contest"}, {"id": "/region/emi/fois01100l", "name": "Pascal - Comandini, Cesena", "description": "is the institute with the most points (1390)"}, {"id": "/region/emi", "name": "Emilia-Romagna", "description": "is the region with the most points (6820)"}], "rank_tot": 44, "rank_reg": 11, "scores": [100, 10, 70, 10, 10, 10, 10], "total": 220}, {"name": "round2", "title": "Round 2", "edition": "7th Edition", "tasks": [{"name": "ricarica", "title": "Un problema di ricarica", "statement": "Il cellulare di Giorgio ha la sua età e ormai si scarica molto velocemente. Per ogni minuto di utilizzo perde un punto di carica, proprio come per ogni minuto in cui è collegato alla corrente ne acquista uno. Se poi raggiunge zero punti di carica, va in crash e diventa necessario portarlo all'assistenza tecnica. Giorgio deve ora uscire di casa per una serie di commissioni di una durata complessiva di M minuti, numerati da 1 a M. Per evitare di rimanere con il cellulare scarico, ha quindi stilato un elenco di tutti gli N intervalli di minuti (A_i, B_i) in cui sa che potrà collegarlo alla corrente e recuperare punti di carica. In tutti gli altri minuti, il cellulare perderà punti di carica. Con quanti punti di carica Giorgio deve uscire di casa al minimo, per essere certo di non rimanere mai con il cellulare scarico in nessuno degli M minuti?", "points": 3110, "medpos": 10, "avgpos": 40.38961038961039, "average": 14.80952380952381, "highest": 100, "positive": 77, "fullscore": 100, "fullscores": 10, "highlights": [{"id": "/region/emi/fois01100l", "name": "Pascal - Comandini, Cesena", "description": "is the institute with the most points (250)"}, {"id": "/region/emi", "name": "Emilia-Romagna", "description": "is the region with the most points (960)"}]}, {"name": "combinazione", "title": "Impila la pila", "statement": "William si è di recente appassionato a Impila la pila, un nuovo gioco per il suo telefonino. In questo gioco ci sono N interruttori in sequenza, numerati da 0 a N-1 da sinistra verso destra, e un personaggio che all'inizio è situato nell'angolo sinistro dello schermo (in corrispondenza dell'interruttore 0). Durante il gioco è possibile ordinare al personaggio di muoversi verso destra o verso sinistra (e queste operazioni richiedono un secondo) oppure di premere l'interruttore davanti al quale è situato (e questa operazione è istantanea). A rendere il gioco interessante, sopra a ogni interruttore è posizionato un disco con una certa dimensione di base B_i. Ogni volta che viene premuto un interruttore, il disco corrispondente viene aggiunto a una pila che cresce quindi progressivamente. Lo scopo del gioco è di attivare tutti gli interruttori nell'ordine corretto, di modo che la pila che si viene a formare sia costituita da dischi con basi sempre strettamente decrescenti...", "points": 5230, "medpos": 70, "avgpos": 53.91752577319588, "average": 24.904761904761905, "highest": 100, "positive": 97, "fullscore": 100, "fullscores": 8, "highlights": [{"id": "/region/emi/fois01100l", "name": "Pascal - Comandini, Cesena", "description": "is the institute with the most points (340)"}, {"id": "/region/emi", "name": "Emilia-Romagna", "description": "is the region with the most points (1510)"}]}, {"name": "truffa", "title": "Truffa contabile", "statement": "La SteamPower S.P.A., azienda leader mondiale nel campo delle macchine a vapore portatili, è ancora una volta in crisi nonostante le oculate manovre messe in atto nell'anno passato. Ora è il momento di stilare il bilancio di fine anno, che è di nuovo in passivo. Per non turbare gli azionisti, il CEO ha ricontattato il massimo esperto mondiale in campo di finanza creativa (il cui nome non possiamo rivelare). Questa volta l'esperto ha elaborato un nuovo stratagemma: con un'audace manovra detta \"la sfangata\" una voce in uscita può diventare una voce in entrata. Questa manovra può essere ripetuta fino a che il bilancio non diventi in attivo, ma per minimizzare i rischi conviene effettuarla il minor numero di volte. Quante volte al minimo è necessario effettuare una sfangata affinché il bilancio diventi in attivo?", "points": 6890, "medpos": 70, "avgpos": 68.21782178217822, "average": 32.80952380952381, "highest": 100, "positive": 101, "fullscore": 100, "fullscores": 32, "highlights": [{"id": "/region/lom/bgtf010003", "name": "Pietro Paleocapa, Bergamo", "description": "is the institute with the most points (470)"}, {"id": "/region/emi", "name": "Emilia-Romagna", "description": "is the region with the most points (1890)"}]}, {"name": "zeri", "title": "Zeri di coda", "statement": "Giorgio sta tenendo una lezione di Teoria dei grafi ai bambini della scuola elementare di Pinerolo, però non si è reso conto che a quell'età generalmente è difficile concentrarsi e prestare attenzione, soprattutto con un argomento complicato. Quando alcuni dei bambini cominciano a chiacchierare, Giorgio si inquieta e gli assegna un difficile calcolo da svolgere per punizione. Il calcolo da svolgere è scritto su una lunga striscia di carta, sui cui c'è scritta una stringa che rappresenta una moltiplicazione. Ad esempio: L'obiettivo è quello di calcolare il numero di zeri in coda al risultato della moltiplicazione. In questo caso, dato che la moltiplicazione ha come risultato 22050000, il numero di zeri in coda sarà pari a 4.", "points": 2810, "medpos": 40, "avgpos": 43.90625, "average": 13.380952380952381, "highest": 100, "positive": 64, "fullscore": 100, "fullscores": 13, "highlights": [{"id": "/region/tos/litf030009", "name": "G. Galilei, Livorno", "description": "is the institute with the most points (210)"}, {"id": "/region/emi", "name": "Emilia-Romagna", "description": "is the region with the most points (830)"}]}, {"name": "scrigni", "title": "Super Marco", "statement": "William sta giocando al suo gioco preferito: Super Marco 64. Per superare un particolare livello all'interno del gioco, è necessario aprire una serie di scrigni nell'ordine corretto. Il livello è fatto così: ci sono n scrigni numerati da 1 a n, ma William non sa quale scrigno corrisponde a quale numero. Se si cerca di aprire uno scrigno nell'ordine sbagliato, Super Marco riceve una scarica elettrica (e lo scrigno non si apre). Gli scrigni aperti fino a quel momento rimangono aperti. Per esempio, supponiamo che ci siano 3 scrigni numerati così: 3, 1, 2. William, non conoscendo l'ordine, decide di aprire uno scrigno a caso. Per esempio, supponiamo che provi ad aprire quello più a sinistra. Lo scrigno scelto non è il numero 1, quindi non si aprirà e Super Marco prenderà la scossa. Ora William apre lo scrigno di mezzo, che è quello giusto...", "points": 4710, "medpos": 90, "avgpos": 57.4390243902439, "average": 22.428571428571427, "highest": 100, "positive": 82, "fullscore": 100, "fullscores": 19, "highlights": [{"id": "/region/emi/fois01100l", "name": "Pascal - Comandini, Cesena", "description": "is the institute with the most points (390)"}, {"id": "/region/emi", "name": "Emilia-Romagna", "description": "is the region with the most points (1810)"}]}, {"name": "negozi", "title": "Shopping stress", "statement": "William odia fare shopping. C'è da dire però che non è il solo ad avere questo problema: una recente ricerca di mercato ha rilevato infatti che il 28% della popolazione cercherebbe qualsiasi scusa pur di non andare al centro commerciale! Una startup italiana, venuta a sapere di questa ricerca, ha deciso di cogliere la palla al balzo: svilupperà un'app per rendere più sopportabile lo shopping alle persone pigre come William. Purtroppo però, nessuno dei programmatori iOS/Android che lavorano alla startup è riuscito a trovare un algoritmo efficiente per risolvere questo problema. Sapresti aiutarli? Un centro commerciale è formato da una serie di N negozi in fila, numerati da 0 a N-1. Ogni negozio è di una certa tipologia, identificata da un numero intero non negativo. L'app funziona così: William si trova in uno dei negozi (ad esempio, il negozio 7), si rende conto che deve comprare una felpa per l'inverno (supponiamo che le felpe si vendano nei negozi di tipo 13)...", "points": 2730, "medpos": 80, "avgpos": 53.529411764705884, "average": 13.0, "highest": 100, "positive": 51, "fullscore": 100, "fullscores": 3, "highlights": [{"id": "/region/lom/bgtf010003", "name": "Pietro Paleocapa, Bergamo", "description": "is the institute with the most points (240)"}, {"id": "/region/lom", "name": "Lombardia", "description": "is the region with the most points (680)"}]}, {"name": "robot", "title": "Robot camminatore", "statement": "William ha finito di costruire un robot camminatore, che si muove su una griglia N × M leggendo i caratteri scritti su di essa e interpretandoli come comandi. In particolare, reagisce in questo modo: (1) X: sta fermo; (2) +: effettua un passo (e cioè si muove di una casella) nella direzione in cui è orientato; (3) O: effettua un salto lungo due passi nella direzione in cui è orientato; (4) L: ruota di 90° a sinistra e poi effettua un passo nella direzione in cui ora è orientato; (5) R: ruota di 90° a destra e poi effettua un passo nella direzione in cui ora è orientato. Nella griglia non sono presenti altri caratteri, né il robot reagisce ad altri comandi oltre a questi. Inoltre, la griglia su cui si muove è toroidale: vale a dire, ogni qualvolta il robot uscirebbe dal lato destro rientra da quello sinistro (e viceversa), e ogni qualvolta il robot uscirebbe dal lato superiore rientra da quello inferiore (e viceversa)...", "points": 1050, "medpos": 10, "avgpos": 17.796610169491526, "average": 5.0, "highest": 100, "positive": 59, "fullscore": 100, "fullscores": 4, "highlights": [{"id": "/region/emi/fois01100l", "name": "Pascal - Comandini, Cesena", "description": "is the institute with the most points (120)"}, {"id": "/region/emi", "name": "Emilia-Romagna", "description": "is the region with the most points (330)"}]}], "points": 26530, "fullscore": 700, "positive": 132, "highest": 700, "average": 126.33333333333333, "avgpos": 200.9848484848485, "medpos": 170, "teams": 210, "id": "2", "ed_num": 7, "highlights": [{"id": "/edition/7/round/2/robot", "name": "Robot camminatore", "description": "is the most difficult task of this contest"}, {"id": "/region/emi/fois01100l", "name": "Pascal - Comandini, Cesena", "description": "is the institute with the most points (1850)"}, {"id": "/region/emi", "name": "Emilia-Romagna", "description": "is the region with the most points (7840)"}], "rank_tot": 73, "rank_reg": 13, "scores": [0, 0, 70, 40, 10, 10, 20], "total": 150}, {"name": "round3", "title": "Round 3", "edition": "7th Edition", "tasks": [{"name": "carrucole", "title": "Parco avventura", "statement": "Giorgio e William vorrebbero andare a visitare il più grande parco avventura del mondo, composto da ben N alberi collegati tra loro da M tiri di carrucole (ogni tiro di carrucola collega una coppia di alberi). Purtroppo, un violento Tsunami si è abbattuto sul parco, abbattendo alcuni degli alberi. Naturalmente, per ogni albero abbattuto si sono persi tutti i tiri di carrucola che partivano da quell'albero. Giorgio e William si chiedono quindi se valga ancora la pena di pagare l'esoso biglietto di ingresso del parco, visto lo stato in cui si trova al momento. Aiutali calcolando quanti tiri di carrucole sono ancora rimasti in piedi!", "points": 7880, "medpos": 100, "avgpos": 75.76923076923077, "average": 37.523809523809526, "highest": 100, "positive": 104, "fullscore": 100, "fullscores": 64, "highlights": [{"id": "/region/emi/fois01100l", "name": "Pascal - Comandini, Cesena", "description": "is the institute with the most points (400)"}, {"id": "/region/emi", "name": "Emilia-Romagna", "description": "is the region with the most points (2370)"}]}, {"name": "yoda", "title": "Hashtag Yoda", "statement": "Giorgio è andato a vedere l'ultimo episodio di Star Wars uscito da poco nelle sale cinematografiche. Essendo un grande appassionato della saga, ha intenzione di commemorare in grande stile l'uscita di tale episodio. Per farlo, ha intenzione di: (1) Sostituire la propria immagine di profilo su Facebook con una foto del maestro Yoda. (2) Scrivere qualsiasi cosa \"in stile Yoda\", compresi: stati, messaggi, chat, e così via. Il primo punto è facile, ma il secondo decisamente no. Giorgio deve infatti modificare ogni singola frase prima di premere Invio, e questo può alla lunga risultare stressante. Aiutalo scrivendo un programma che trasformi una frase nella relativa frase \"Yodizzata\". Ad esempio, se la frase fosse: \"sia grande la forza in te\", il programma dovrebbe trasformarla in: \"te in forza la grande sia\".", "points": 5080, "medpos": 70, "avgpos": 74.70588235294117, "average": 24.19047619047619, "highest": 100, "positive": 68, "fullscore": 100, "fullscores": 32, "highlights": [{"id": "/region/emi/fois01100l", "name": "Pascal - Comandini, Cesena", "description": "is the institute with the most points (370)"}, {"id": "/region/emi", "name": "Emilia-Romagna", "description": "is the region with the most points (1420)"}]}, {"name": "cabala", "title": "Numero della cabala", "statement": "Giorgio vuole entrare nella setta Oli-3, in cui si studiano numeri occulti e misteriosi con cui dominare il mondo. Per essere ammesso, gli viene richiesto di provare il suo valore individuando il numero della cabala C. Dopo lunghe e difficoltose ricerche, Giorgio è riuscito a scoprire che questo numero: (1) ha al più N cifre; (2) tutte le sue cifre sono multiple di 3 (ma nessuna è zero); (3) non vi sono due cifre adiacenti uguali; (4) il resto di C modulo un certo numero M è più grande possibile. Aiuta Giorgio a trovare il numero della Cabala ed entrare quindi nella agognata setta!", "points": 940, "medpos": 10, "avgpos": 14.242424242424242, "average": 4.476190476190476, "highest": 100, "positive": 66, "fullscore": 100, "fullscores": 2, "highlights": [{"id": "/region/emi/fois01100l", "name": "Pascal - Comandini, Cesena", "description": "is the institute with the most points (150)"}, {"id": "/region/emi", "name": "Emilia-Romagna", "description": "is the region with the most points (360)"}]}, {"name": "rollercoaster", "title": "Rollercoaster Typhoon", "statement": "William is a huge fan of the Rollercoaster Typhoon videogame, and spends a great deal of his time designing rollercoaster tracks. However, William's wild imagination often clashes with the laws of physics that such a track has to comply with. A rollercoaster track is defined by a sequence H_i of N integer values, representing the height of the pillars upon which the track is laid, in the order in which they are connected by the tracks. If a contiguous subsequence of at least three of these values is in arithmetic progression (that is, the difference between consecutive values is positive and constant), the corresponding section of the track is automatically motorized. Whenever William tests his design, a test car drives through it from i=0 on, following these rules: (1) Whenever the car reaches the start of a motorized section, it is hooked by the lifter which drops it at the last pillar of the section, from which the car starts a free fall as in rule 2...", "points": 1560, "medpos": 10, "avgpos": 19.25925925925926, "average": 7.428571428571429, "highest": 100, "positive": 81, "fullscore": 100, "fullscores": 4, "highlights": [{"id": "/region/emi/fois01100l", "name": "Pascal - Comandini, Cesena", "description": "is the institute with the most points (130)"}, {"id": "/region/emi", "name": "Emilia-Romagna", "description": "is the region with the most points (440)"}]}, {"name": "monete", "title": "Super Marco 2", "statement": "William sta di nuovo giocando a Super Marco 64, e stavolta per superare il livello deve raccogliere il maggior numero possibile di monete. Il livello è composto da una serie di piattaforme collegate tra loro. Su ciascuna piattaforma possono esserci delle monete e, appena Super Marco raggiunge una certa piattaforma, raccoglie istantaneamente tutte le monete che essa contiene. Data la mappa del livello, e sapendo che Super Marco si trova nella piattaforma 0, determina quante monete al massimo è possibile raccogliere.", "points": 2960, "medpos": 10, "avgpos": 32.17391304347826, "average": 14.095238095238095, "highest": 100, "positive": 92, "fullscore": 100, "fullscores": 20, "highlights": [{"id": "/region/emi/fois01100l", "name": "Pascal - Comandini, Cesena", "description": "is the institute with the most points (220)"}, {"id": "/region/emi", "name": "Emilia-Romagna", "description": "is the region with the most points (1020)"}]}, {"name": "primo", "title": "Primo permissivo", "statement": "William e Giorgio stanno facendo un gioco con i cosiddetti numeri primi permissivi. Un numero primo permissivo è un numero in cui alcune delle cifre possono essere degli asterischi. Un esempio di numero primo permissivo è 3* il quale, in base al valore che sostituiremo all'asterisco, potrebbe valere 31 oppure 37, che sono entrambi dei numeri primi. Nessun numero primo permissivo comincia per asterisco. Aiuta i protagonisti a contare, dato un certo numero primo permissivo, a quanti numeri primi esso può corrispondere.", "points": 1800, "medpos": 10, "avgpos": 27.272727272727273, "average": 8.571428571428571, "highest": 100, "positive": 66, "fullscore": 100, "fullscores": 3, "highlights": [{"id": "/region/ven/vetf04000t", "name": "Carlo Zuccante, Venezia", "description": "is the institute with the most points (200)"}, {"id": "/region/emi", "name": "Emilia-Romagna", "description": "is the region with the most points (500)"}]}, {"name": "acronimi", "title": "Acronimi forzati", "statement": "William sta lavorando alla tesi di laurea. Durante lo sviluppo del suo progetto, ha fatto uso di una banca dati dei pagamenti degli enti pubblici italiani. Questa banca dati viene preparata e pubblicata dal SIOPE (Sistema informativo sulle operazioni degli enti pubblici). Non appena ha letto l'acronimo SIOPE, William ha istintivamente cercato di associarlo alle parole che compongono la frase \"Sistema informativo sulle operazioni degli enti pubblici\" ma, con grande delusione, ha notato che qualsiasi associazione risultava piuttosto forzata. Un modo per mappare l'acronimo alla frase è questo: Sistema Informativo sulle OPErazioni degli enti pubblici. Tuttavia, ci sono altri modi: (1) Sistema InformativO sulle oPerazioni degli Enti pubblici. (2) siStema InformativO sulle oPerazioni degli Enti pubblici. (3) siStema informatIvO sulle oPerazioni degli Enti pubblici...", "points": 1190, "medpos": 10, "avgpos": 18.59375, "average": 5.666666666666667, "highest": 75, "positive": 64, "fullscore": 100, "fullscores": 0, "highlights": [{"id": "/region/emi/fois01100l", "name": "Pascal - Comandini, Cesena", "description": "is the institute with the most points (115)"}, {"id": "/region/emi", "name": "Emilia-Romagna", "description": "is the region with the most points (370)"}]}], "points": 21410, "fullscore": 700, "positive": 123, "highest": 665, "average": 101.95238095238095, "avgpos": 174.0650406504065, "medpos": 150, "teams": 210, "id": "3", "ed_num": 7, "highlights": [{"id": "/edition/7/round/3/cabala", "name": "Numero della cabala", "description": "is the most difficult task of this contest"}, {"id": "/region/emi/fois01100l", "name": "Pascal - Comandini, Cesena", "description": "is the institute with the most points (1515)"}, {"id": "/region/emi", "name": "Emilia-Romagna", "description": "is the region with the most points (6480)"}], "rank_tot": 115, "rank_reg": 19, "scores": [0, 0, 0, 0, 0, 0, 0], "total": 0}, {"name": "round4", "title": "Round 4", "edition": "7th Edition", "tasks": [{"name": "ruspa", "title": "SmartRuspa", "statement": "William è stato incaricato di abbattere una serie di N muri disposti lungo una linea per fare posto a una nuova strada. Non avendo la patente, per farlo si è procurato un nuovissimo esemplare di SmartRuspa in grado di svolgere tutto il lavoro da sola! In particolare, la SmartRuspa è stata posizionata dagli addetti in una certa coordinata X con un certo orientamento, verso destra (coordinate crescenti) o verso sinistra (coordinate decrescenti). Da lì la ruspa parte e procede fino a quando non incontra un muro da abbattere. Dopo aver abbattuto un muro, inverte automaticamente la marcia e prosegue nel suo algoritmo. Informatosi sui blog competenti, William è conscio del difetto di queste ruspe di partire ad un certo punto in una direzione verso l'infinito (o peggio, verso la casa del vicino). Per prevenire onerose richieste di danni, vuole quindi trovarsi pronto a saltare sulla ruspa per spegnerla non appena vede che sta per uscire dai confini prestabiliti...", "points": 4450, "medpos": 70, "avgpos": 59.333333333333336, "average": 21.19047619047619, "highest": 100, "positive": 75, "fullscore": 100, "fullscores": 18, "highlights": [{"id": "/region/ven/vetf04000t", "name": "Carlo Zuccante, Venezia", "description": "is the institute with the most points (290)"}, {"id": "/region/emi", "name": "Emilia-Romagna", "description": "is the region with the most points (1160)"}]}, {"name": "caffe", "title": "Pausa caffè", "statement": "Durante i lunghi ed estenuanti stage di preparazione dei PO (probabili olimpici), gli N tutor ogni tanto recuperano le energie andando a prendersi un caffè. Per ottimizzare la loro presenza in aula, ogni tutor fa pausa in un momento diverso del giorno: in particolare, il tutor i-esimo fa pausa nell'intervallo di tempo [A_i, B_i] dove i valori A_i e B_i sono tutti distinti tra loro. I tutor tra di loro sono sempre molto cordiali: ogni volta che uno di loro raggiunge la macchinetta del caffè, offre sempre un giro di caffè a tutti i presenti. Questo elevato consumo di caffè sta facendo rapidamente finire le scorte a disposizione della macchinetta. Aiuta Monica a programmare i rifornimenti calcolando quanti caffè vengono bevuti ogni giorno!", "points": 5590, "medpos": 70, "avgpos": 57.04081632653061, "average": 26.61904761904762, "highest": 100, "positive": 98, "fullscore": 100, "fullscores": 5, "highlights": [{"id": "/region/emi/fois01100l", "name": "Pascal - Comandini, Cesena", "description": "is the institute with the most points (310)"}, {"id": "/region/emi", "name": "Emilia-Romagna", "description": "is the region with the most points (1440)"}]}, {"name": "regali", "title": "Regali gemelli", "statement": "William deve andare a comprare un regalo di compleanno per i suoi due giovani cuginetti. Essendo fratelli gemelli, sa che se gli facesse due regali troppo diversi sicuramente inizierebbero a litigare. Pertanto si è procurato un listino di un negozio contenente la descrizione di N giocattoli, ciascuno individuato da Q qualità (rappresentate con dei numeri da 1 a 1000). Dato che le qualità dei giocattoli sono elencate in ordine di importanza e il significato di una qualità dipende dalle precedenti, la simiglianza di due giocattoli è definita come il più lungo prefisso comune tra le loro due descrizioni. Trova i giocattoli più simili tra loro!", "points": 4590, "medpos": 50, "avgpos": 54.642857142857146, "average": 21.857142857142858, "highest": 100, "positive": 84, "fullscore": 100, "fullscores": 35, "highlights": [{"id": "/region/lom/bgps02000g", "name": "Filippo Lussana, Bergamo", "description": "is the institute with the most points (420)"}, {"id": "/region/emi", "name": "Emilia-Romagna", "description": "is the region with the most points (1090)"}]}, {"name": "ciclismo", "title": "Giro in bici", "statement": "Giorgio è appassionato di ciclismo, tanto che ogni giorno prende un treno per raggiungere una nuova località e da lì farsi un bel giro in bici. La mappa della località in cui si è recato oggi consiste di N incroci collegati da M strade bidirezionali (non esistono sensi unici per le biciclette). Ognuno degli incroci, inoltre, si trova a una diversa altitudine H_i. Nel suo giro, Giorgio partirà dalla stazione (corrispondente all'incrocio numero 0) e procederà ogni volta dirigendosi verso l'incrocio con altitudine più bassa tra quelli collegati all'incrocio corrente (Giorgio non ama le salite!), eccettuato quello da cui al momento arriva (in altre parole, non fa mai inversione a U). Il giro in bici prosegue quindi fintanto che si troverebbe costretto a effettuare un'inversione a U oppure quando ritorna in un incrocio da cui è già passato. In quale incrocio finirà il giro in bici?", "points": 2280, "medpos": 10, "avgpos": 29.23076923076923, "average": 10.857142857142858, "highest": 100, "positive": 78, "fullscore": 100, "fullscores": 16, "highlights": [{"id": "/region/tre/tnps01000v", "name": "Galileo Galilei, Trento", "description": "is the institute with the most points (300)"}, {"id": "/region/emi", "name": "Emilia-Romagna", "description": "is the region with the most points (690)"}]}, {"name": "html", "title": "Parser HTML", "statement": "William sta cercando di scrivere un parser HTML facendo uso di espressioni regolari (regexp), così da evocare Zalgo. Per fortuna questo parser non deve davvero essere in grado di consumare HTML, bensì è sufficiente che sia in grado di effettuare il cosidetto \"unescape\": l'operazione inversa dell'escape. L'escape è una tecnica che viene utilizzata per rappresentare caratteri che altrimenti avrebbero un significato specifico nel linguaggio utilizzato. Per questa particolare applicazione, William ha bisogno di effettuare l'unescape soltanto del carattere & che, quando viene normalmente sottoposto all'escape in HTML, diventa &amp; passando quindi da 1 carattere a 5 caratteri. William ha notato però una cosa: una volta completato l'unescape di un intero file HTML, potrebbe essere possibile eseguire di nuovo l'unescape sullo stesso file, dato che nel frattempo il codice HTML è cambiato e potrebbero essere comparse altre entità &amp; da convertire...", "points": 2750, "medpos": 70, "avgpos": 78.57142857142857, "average": 13.095238095238095, "highest": 100, "positive": 35, "fullscore": 100, "fullscores": 16, "highlights": [{"id": "/region/tre/tnps01000v", "name": "Galileo Galilei, Trento", "description": "is the institute with the most points (270)"}, {"id": "/region/emi", "name": "Emilia-Romagna", "description": "is the region with the most points (660)"}]}, {"name": "programma", "title": "Robot programmabile", "statement": "William ha appena costruito un nuovo robot programmabile per il suo laboratorio di robotica, in grado di rispondere a ben cinque comandi di basso livello: (1) 'R' (right): gira di 90° a destra; (2) 'L' (left): gira di 90° a sinistra; (3) 'F' (forward): avanza di 1 nella direzione in cui è orientato; (4) 'B' (backward): indietreggia di 1 rispetto alla direzione in cui è orientato; (5) 'X' (explode): attiva l'autodistruzione ed esplode. William ha dunque scritto un lungo programma P composto di N comandi e lo ha memorizzato nel robot. In questo modo, il robot può essere comandato con comandi di alto livello (S:E) tali che 0 < S < E < N. Ciascuno di questi comandi verrà convertito dal robot nella sequenza di comandi di basso livello P_S, P_S+1, … P_E ed eseguito in questo modo. William ha appena inviato una sequenza di M comandi di alto livello al robot, posizionato inizialmente nel quadretto (0,0) e orientato verso est (coordinate x crescenti)...", "points": 1350, "medpos": 10, "avgpos": 23.68421052631579, "average": 6.428571428571429, "highest": 40, "positive": 57, "fullscore": 100, "fullscores": 0, "highlights": [{"id": "/region/lom/bgps02000g", "name": "Filippo Lussana, Bergamo", "description": "is the institute with the most points (100)"}, {"id": "/region/emi", "name": "Emilia-Romagna", "description": "is the region with the most points (370)"}]}, {"name": "tracce", "title": "Tracce aliene", "statement": "Giorgio ha deciso di rispondere in modo conclusivo alla domanda che ha assillato l'umanità per tanti anni: esistono oppure no gli alieni? Per questo motivo, si è messo alla ricerca di tracce aliene. Al fine di rilevare presenze extraterrestri, Giorgio ha eseguito una serie di misurazioni elettromagnetiche. Dopo giorni di misurazioni, è arrivato a determinare con precisione una stringa S che: (1) È composta da sole cifre decimali (da 0 a 9); (2) È terminata da una cifra 0 (in ultima posizione); (3) Il carattere terminatore 0 è presente solo in ultima posizione e non prima. Questa stringa potrebbe essere un messaggio degli alieni. Ovviamente però, per verificare la cosa, sarebbe necessario fare un complicatissimo conteggio per sapere quante volte questa stringa compare spontaneamente \"in natura\". Per una stima iniziale però, Giorgio farà un conteggio molto semplice...", "points": 1000, "medpos": 10, "avgpos": 13.157894736842104, "average": 4.761904761904762, "highest": 30, "positive": 76, "fullscore": 100, "fullscores": 0, "highlights": [{"id": "/region/emi/fois01100l", "name": "Pascal - Comandini, Cesena", "description": "is the institute with the most points (80)"}, {"id": "/region/emi", "name": "Emilia-Romagna", "description": "is the region with the most points (330)"}]}], "points": 22010, "fullscore": 700, "positive": 106, "highest": 550, "average": 104.80952380952381, "avgpos": 207.64150943396226, "medpos": 180, "teams": 210, "id": "4", "ed_num": 7, "highlights": [{"id": "/edition/7/round/4/tracce", "name": "Tracce aliene", "description": "is the most difficult task of this contest"}, {"id": "/region/tre/tnps01000v", "name": "Galileo Galilei, Trento", "description": "is the institute with the most points (1510)"}, {"id": "/region/emi", "name": "Emilia-Romagna", "description": "is the region with the most points (5740)"}], "rank_tot": 106, "rank_reg": 15, "scores": [0, 0, 0, 0, 0, 0, 0], "total": 0}], "id": "team44", "name": "Tron3SB", "institute": "IIS Tron - Zanella, Schio", "inst_id": "viis02300x", "region": "ven", "fullregion": "Veneto", "coach": "", "members": "", "finalist": false, "medals": [0, 0, 0, 1], "rank_reg": 15, "rank_tot": 88, "rank_excl": 75, "bestrank": 44, "avgrank": 46.7304625199362, "points": 370, "ed_num": 7, "edition": "7th Edition", "year": "2015/16", "highlights": [{"id": "/edition/7/round/1/bicollatz", "name": "Congettura di Bicollatz", "description": "is the hardest task solved by the team"}, {"id": "/edition/7/round/1", "name": "Round 1", "description": "is the round with the highest rank (44), total points (220), full scores (1), partial scores (7), minimum score (10), maximum score (100) and regional rank (11)"}]}