{"contests": [{"name": "round1", "title": "Round 1", "edition": "9th Edition", "tasks": [{"name": "caesar", "title": "Caesar Cypher", "statement": "Julius Caesar has just written the new war declaration against Sparta. To prevent the enemies from reading this precious document the Emperor has ordered to encrypt it using his cypher. Unfortunately the official who was supposed to encrypt the messages messed it up. He put the war declaration messages with other unrelated messages. Luckily for him he noticed that if he splits the messages into piles all with the same message (maybe encrypted with different keys), the taller is the one! Help him to find the size of the largest pile all with the same message.", "points": 4140, "medpos": 10, "avgpos": 33.12, "average": 9.904306220095695, "highest": 100, "positive": 125, "fullscore": 100, "fullscores": 22, "highlights": [{"id": "/region/lom/mnis01100e", "name": "I.S. Fermi MN, Mantova", "description": "is the institute with the most points (335)"}, {"id": "/region/lom", "name": "Lombardia", "description": "is the region with the most points (1050)"}]}, {"name": "copac", "title": "Wonderful Grove", "statement": "Silviu the lumberjack, who lives in \"The Wonderful Grove\", is well known for his ability and is ready to tackle another challenging task. Winter is coming and a big tree needs to be cut. Silviu is carefully studying the structure of the tree, taking precise notes about each branch and its connections. He has labelled all the points of connection between two or more branches with numbers from 1 to N. He has opted for making a single cut (after all, every cut requires physical effort…), getting rid of the branches conjuncting there and transporting the remaining smaller pieces. The company selected for transport is going to accept a part of the tree only if it is smaller (or equal) than half of the size of the original tree. The size of a (part of a) tree is merely the number of the conjunction points in it. At which points can Silviu make his cut to satisfy the requirement from the transport company?", "points": 2105, "medpos": 5, "avgpos": 32.890625, "average": 5.035885167464115, "highest": 100, "positive": 64, "fullscore": 100, "fullscores": 13, "highlights": [{"id": "/region/tre/tnps01000v", "name": "Galileo Galilei, Trento", "description": "is the institute with the most points (145)"}, {"id": "/region/emi", "name": "Emilia-Romagna", "description": "is the region with the most points (355)"}]}, {"name": "fraction", "title": "Decimal Fractions", "statement": "Archimedes has just discovered a new concept: the fraction, where an integer number (numerator) is divided by another integer number (denominator). In particular, he is now focusing on the simplest kind of fractions, called unit fraction, where the numerator is exactly 1. Until now, Archimedes managed to compute the decimal representation of all the unit fractions with denominator up to ten, and noticed that some of them contain a recurring cycle of digits. Where 0.1(6) means 0.166666…, and has a 1-digit recurring cycle. Archimedes is particularly excited by long recurring cycles, like the one of 1/7 which is 6 digits long, and would like to discover an even longer one with denominator up to N; but is getting tired of computing all those decimals. Help Archimedes in his quest, by finding the largest number d < N such that 1/d contains the longest possible recurring cycle in its decimal fraction part!", "points": 2350, "medpos": 40, "avgpos": 29.746835443037973, "average": 5.62200956937799, "highest": 80, "positive": 79, "fullscore": 100, "fullscores": 0, "highlights": [{"id": "/region/lom/bgtf010003", "name": "Pietro Paleocapa, Bergamo", "description": "is the institute with the most points (165)"}, {"id": "/region/lom", "name": "Lombardia", "description": "is the region with the most points (605)"}]}, {"name": "jumps", "title": "Word Game", "statement": "James Joyce is composing a new mind-blowing masterpiece. In his next work, two words w_1 and w_2 will be allowed to be adjacent only if they are close enough. We define w_2 to be close enough to w_1 (or that w_1 jumps to w_2) if one of the following conditions is verified: (1) w_2 is obtained from w_1 by deleting one letter. (2) w_2 is obtained from w_1 by replacing one of the letters in w_1 by some letter that appears to its right in w_1 and which is also to its right in alphabetical order. For example, we can jump from abbca to abca by deleting the second (or the third) letter. We can jump from aabca to abbca by replacing the a in the second position by the letter b that appears to the right of the a in aabca and which is also to its right in alphabetical order. On the other hand, we cannot jump from abbca to aabca since we would need to replace the b in the second position by a, but a is to the left of b in alphabetical order...", "points": 1770, "medpos": 10, "avgpos": 26.029411764705884, "average": 4.23444976076555, "highest": 100, "positive": 68, "fullscore": 100, "fullscores": 10, "highlights": [{"id": "/region/tre/tnps01000v", "name": "Galileo Galilei, Trento", "description": "is the institute with the most points (150)"}, {"id": "/region/lom", "name": "Lombardia", "description": "is the region with the most points (300)"}]}, {"name": "painting", "title": "Fractal Painting", "statement": "Ever since Marcus (a famous Dutch abstractionist) heard of fractals, he made them the main topic of his canvases. Every morning, the artist takes a piece of graph paper and starts making a model of his future canvas, by selecting a rectangular area of N × N squares and painting some of these squares black. Then, he takes a clean square piece of paper and paints the fractal using the following algorithm: (1) [1.] The paper is divided into N^2 identical squares and some of them are painted black according to the model. (2) [2.] Every square that remains white is divided into N^2 smaller squares and some of them are painted black according to the model. (3) [… ] (4) [K.] Repeat step 2. At the end of the process, a canvas consisting of N^K × N^K black and white squares is produced. Unfortunately, this tiresome work demands too much time from his painting genius. Marcus has been dreaming of making the process automatic to move to making 3D or even 4D fractals: help him!", "points": 905, "medpos": 57, "avgpos": 50.27777777777778, "average": 2.165071770334928, "highest": 90, "positive": 18, "fullscore": 100, "fullscores": 0, "highlights": [{"id": "/region/abr/teps02000n", "name": "LS M. Curie, Giulianova", "description": "is the institute with the most points (90)"}, {"id": "/region/lom", "name": "Lombardia", "description": "is the region with the most points (340)"}]}, {"name": "subset", "title": "Number Game", "statement": "Rich Uncle Pennybags is getting tired of playing Monopoly, hence developed a new exciting number game. In this game, V tokens are randomly extracted, each depicting a distinct positive integer. Each player then has to select a subset S such that every pair (S_i, S_j) of elements in this subset satisfies: S_i % S_j = 0 or S_j % S_i = 0. The player who picks up the bigger subset wins! Rich Uncle Pennybags is not used to lose a game: help him find the largest allowed subset!", "points": 3120, "medpos": 10, "avgpos": 30.29126213592233, "average": 7.464114832535885, "highest": 100, "positive": 103, "fullscore": 100, "fullscores": 17, "highlights": [{"id": "/region/tre/tnps01000v", "name": "Galileo Galilei, Trento", "description": "is the institute with the most points (260)"}, {"id": "/region/lom", "name": "Lombardia", "description": "is the region with the most points (790)"}]}, {"name": "uefa", "title": "UEFA Coefficient", "statement": "Everyone in the world knows Andrew Wiles' addiction to football. Recently, a strange number has been calculated for each country: the \"UEFA coeffecient\". This coefficient is so important because it determins how many teams for each country are allowed to compete in the world's most prestigious tournament, the UEFA Champions League. Andrew loves playing with numbers and computers, but he's a bit skeptical about how that coefficient is computed by UEFA and would prefer to calculate it himself. He gathered a list of N teams, each with its country, and a list of M results of played matches. The rules to calculate a team's coefficient are quite straightforward: (1) Every team gets one point for every match it has played; (2) Additional three points are awarded to the winner (i.e., the team with the highest number of goals scored). If the match ends with a draw, one point is awarded to both teams...", "points": 5970, "medpos": 55, "avgpos": 69.4186046511628, "average": 14.282296650717702, "highest": 100, "positive": 86, "fullscore": 100, "fullscores": 34, "highlights": [{"id": "/region/tre/tnps01000v", "name": "Galileo Galilei, Trento", "description": "is the institute with the most points (310)"}, {"id": "/region/lom", "name": "Lombardia", "description": "is the region with the most points (1245)"}]}], "points": 20360, "fullscore": 700, "positive": 204, "highest": 650, "average": 48.708133971291865, "avgpos": 99.80392156862744, "medpos": 50, "teams": 418, "id": "1", "ed_num": 9, "highlights": [{"id": "/edition/9/round/1/painting", "name": "Fractal Painting", "description": "is the most difficult task of this contest"}, {"id": "/region/tre/tnps01000v", "name": "Galileo Galilei, Trento", "description": "is the institute with the most points (1310)"}, {"id": "/region/lom", "name": "Lombardia", "description": "is the region with the most points (4670)"}], "rank_tot": 184, "rank_reg": 17, "scores": [0, 0, 0, 0, 0, 0, 0], "total": 0}, {"name": "round2", "title": "Round 2", "edition": "9th Edition", "tasks": [{"name": "cards", "title": "House of cards", "statement": "Luca, Edoardo, William and Giorgio are playing at the famous card game briscola. While Edoardo was setting up the deck, he noticed that a card was missing. In fact, that same day he made a huge house of cards and he left the last card of his deck inside it! Now, he really wants to play with his friends without destroying his castle: help him find out how much of the castle must be torn down. An house of cards is made up of triangles of cards. If you remove a card that is under another, all the castle falls in pieces. You can easily remove a triangle from the top without risking a disaster, but you want to minimize the number of triangles removed to keep the structure beautiful. The card Edoardo wants is in the C-th triangle of the R-th row from the top of the castle, which has N rows total. Note that the i-th row (from 1 to N) has i triangles of cards. How many triangles of cards do you have to remove at least, in order to have the missing card in hand?", "points": 12750, "medpos": 70, "avgpos": 67.10526315789474, "average": 30.502392344497608, "highest": 100, "positive": 190, "fullscore": 100, "fullscores": 90, "highlights": [{"id": "/region/lom/bgtf010003", "name": "Pietro Paleocapa, Bergamo", "description": "is the institute with the most points (580)"}, {"id": "/region/lom", "name": "Lombardia", "description": "is the region with the most points (2610)"}]}, {"name": "excursion", "title": "Algorithmic excursion", "statement": "Giorgio is a passionate hiker, and every weekend goes for an excursion in his beloved mountains: the Alps. Today, he is going to explore the Val Troncea, a nice rectangular valley consisting of H × W square meters of land, each with a different altitude of A[i,j] millimeters above sea level (for i = 0 … H-1, j = 0 … W-1). He will start from one of its corners, labelled (0,0), then he will wander around without following maps nor trails: he will follow an algorithm! More specifically, Giorgio follows six simple rules: (1) No jumps: step only between adjacent squares (in directions North, South, East or West). (2) No flight: never get out of the borders of the valley. (3) No return: never come back to the square from which you just arrived. (4) No cliffs: always choose the square with an altitude closer to the current one (least absolute difference of altitudes)...", "points": 3450, "medpos": 100, "avgpos": 86.25, "average": 8.253588516746412, "highest": 100, "positive": 40, "fullscore": 100, "fullscores": 28, "highlights": [{"id": "/region/tre/tnps01000v", "name": "Galileo Galilei, Trento", "description": "is the institute with the most points (300)"}, {"id": "/region/lom", "name": "Lombardia", "description": "is the region with the most points (960)"}]}, {"name": "fractal", "title": "Fractal graphs", "statement": "After Edoardo accidentally found Giorgio working on fractals (amazing mathematical shapes with recursive definitions), he decided to do something similar… but in a somewhat more computer science fashion. After days of excruciating research, he finally discovered the fractal graphs G_N! The first member of this family of graphs, is a mathematical object consisting of a set V of nodes (unlabelled points) and a set E of edges (undirected links between couple of points), so that E ⊆ V × V. G_0, is very simple: a single node without any edges. After that, the graphs quickly grow in complexity as N increases. More precisely, each fractal graph G_N for N>0 is obtained from its predecessor G_N-1 by adding: (1) A triangle T for every node v in G_N-1, so that one of the nodes of T is v and the other nodes and edges are new...", "points": 4470, "medpos": 90, "avgpos": 66.71641791044776, "average": 10.69377990430622, "highest": 100, "positive": 67, "fullscore": 100, "fullscores": 8, "highlights": [{"id": "/region/lom/mnis01100e", "name": "I.S. Fermi MN, Mantova", "description": "is the institute with the most points (270)"}, {"id": "/region/lom", "name": "Lombardia", "description": "is the region with the most points (1240)"}]}, {"name": "giftcard", "title": "Black Friday", "statement": "Black Friday is over, and Luca couldn't avoid buying a super discounted giftcard from his favourite online shop! In the rush to make the deal before the end of the special offer, Luca didn't pay much attention to the small Terms&Conditions message: the giftcard can only be spent to buy two particular types objects, in any positive amount you want. Objects of type one cost exactly C_1 euros each and objects of type two C_2 euros each. Furthermore, there is another caveat: online shops always hide restrictions! The giftcard of value N can only be used completely, which means that the total price for buying objects has to be exactly N. Help Luca by suggesting how many objects of the two types at minimum he should buy in order to be able to spend his giftcard!", "points": 16440, "medpos": 70, "avgpos": 63.47490347490348, "average": 39.33014354066986, "highest": 100, "positive": 259, "fullscore": 100, "fullscores": 119, "highlights": [{"id": "/region/lom/bgtf010003", "name": "Pietro Paleocapa, Bergamo", "description": "is the institute with the most points (770)"}, {"id": "/region/lom", "name": "Lombardia", "description": "is the region with the most points (3110)"}]}, {"name": "recovery", "title": "Department blackout", "statement": "Giorgio is teaching a university course, so he needs to grade a lot of exams each year. Specifically, last year he scheduled T multiple-choice tests, and he had a total of S students taking part in some test. The testing procedure was as follows. Each test was performed at a workstation and consisted of Q questions. When a student took part in a test, they had to respond to each question with an integer number between 1 and 32: as you can see, Giorgio really wants to make sure that \"guessing\" the right answer (probability 1/32) is nearly impossible! It's important to note that the Q questions were always presented in random order by the workstation, in order to deter cheating. Sadly, last week a blackout struck the entire department and some data was lost. Specifically, for each student result in the database, Giorgio lost the reference to which of the T tests that result refers to...", "points": 5110, "medpos": 70, "avgpos": 69.05405405405405, "average": 12.224880382775119, "highest": 100, "positive": 74, "fullscore": 100, "fullscores": 21, "highlights": [{"id": "/region/tre/tnps01000v", "name": "Galileo Galilei, Trento", "description": "is the institute with the most points (230)"}, {"id": "/region/lom", "name": "Lombardia", "description": "is the region with the most points (950)"}]}, {"name": "threshold", "title": "Oral exam", "statement": "At Luca's university, the final exam for a course usually consists of a written part and an oral one, taken exactly in this order. As the difficulty of the written part varies among different exam sessions, each time a tedious work has to be done in order to properly set the oral admission threshold. Grades for written exams are assigned in the range 0---100. A student can take the oral exam if and only if his/her grade is greater than or equal to the threshold (which can also range from 0 to 100). The professor doesn't want to spend many days to assess lots of students (if the threshold is low). On the other hand, he can't be too strict setting an exaggeratedly high threshold. Luca's professor kindly asked him to ease his work providing a list with indications on how many students would be admitted to the oral exam for every possible threshold. Compute this list for Luca!", "points": 11780, "medpos": 40, "avgpos": 63.67567567567568, "average": 28.181818181818183, "highest": 100, "positive": 185, "fullscore": 100, "fullscores": 73, "highlights": [{"id": "/region/tre/tnps01000v", "name": "Galileo Galilei, Trento", "description": "is the institute with the most points (640)"}, {"id": "/region/lom", "name": "Lombardia", "description": "is the region with the most points (2620)"}]}, {"name": "wordsearch", "title": "Word search puzzle", "statement": "In recent months, William has become passionate about word search puzzles. A word search puzzle consists of a grid of letters, in which there are one or more words to be searched in a vertical, horizontal or diagonal way. William's version of this puzzle is a bit harder. There is only one word to be searched, but you are not limited to vertical/horizontal/diagonal words. You can compose a word in any way you like, starting from some letter and moving in any direction as long as you move to an adjacent cell: that means, you can move in 8 possible directions (two vertical, two horizontal and four diagonal). Note that William's rules do not forbid you to step on the same letter more than once: you have the freedom to compose the word even by reusing letters. Compute how many times a given word appears in the word puzzle. This number can be quite large, so it's enough to print its value modulo 1000000007.", "points": 1890, "medpos": 100, "avgpos": 75.6, "average": 4.521531100478469, "highest": 100, "positive": 25, "fullscore": 100, "fullscores": 15, "highlights": [{"id": "/region/tre/tnps01000v", "name": "Galileo Galilei, Trento", "description": "is the institute with the most points (300)"}, {"id": "/region/emi", "name": "Emilia-Romagna", "description": "is the region with the most points (430)"}]}], "points": 55890, "fullscore": 700, "positive": 279, "highest": 700, "average": 133.70813397129186, "avgpos": 200.32258064516128, "medpos": 140, "teams": 418, "id": "2", "ed_num": 9, "highlights": [{"id": "/edition/9/round/2/wordsearch", "name": "Word search puzzle", "description": "is the most difficult task of this contest"}, {"id": "/region/tre/tnps01000v", "name": "Galileo Galilei, Trento", "description": "is the institute with the most points (2830)"}, {"id": "/region/lom", "name": "Lombardia", "description": "is the region with the most points (11850)"}], "rank_tot": 117, "rank_reg": 5, "scores": [100, 0, 0, 30, 0, 40, 0], "total": 170}, {"name": "round3", "title": "Round 3", "edition": "9th Edition", "tasks": [{"name": "barrels", "title": "Playing with barrels", "statement": "For Christmas William will give to Giorgio a really nice present. Giorgio has always loved playing with barrels and his favorite game consists in taking N barrels, each of which has capacity C_i, and aligning them in a row in a way that when the i-th barrel gets full the water instantly goes to the (i+1)-th barrel. After setting up the barrels Giorgio will do either: (1) Put k liters of water in the u-th barrel; (2) Measure how many liters of water are there in the q-th barrel. Remember that barrels love overflowing: when some water flows in a full barrel it is all transferred to the next barrel. The last barrel overflows to the floor… but that's not our problem! Of course, William's present will be a fancy new simulator, not the real thing: help him writing it.", "points": 5845, "medpos": 40, "avgpos": 35.0, "average": 13.983253588516746, "highest": 100, "positive": 167, "fullscore": 100, "fullscores": 3, "highlights": [{"id": "/region/tre/tnps01000v", "name": "Galileo Galilei, Trento", "description": "is the institute with the most points (275)"}, {"id": "/region/lom", "name": "Lombardia", "description": "is the region with the most points (1255)"}]}, {"name": "bloomsday", "title": "Numerological prediction", "statement": "Everybody knows that the world should end with the coming of doomsday, when all ills will be unleashed, throwing the earth in an hell of ice and fire. What is not nearly as known is that (given the right astrological conditions) a day of heavenly peace and joy should also come! Predicting this day, called bloomsday, is the ultimate quest of the most renowned numerologists, and Giorgio is no exception. After years of excruciating scientific research, he proved that bloomsday will come when the pattern of god will finally appear in the holy sequence. For this quest, Giorgio printed out the first few bazillion numbers of the \"holy sequence\", which is the infinite sequence of numbers: K * 1^E, K * 2^E, …, K * X^E, … where K and E are carefully chosen to maximise holiness. Even though the description of the \"pattern of god\" is too complex to fit into the margin of this page, Giorgio has already found it in the N-th digit of the printout! Thus...", "points": 4245, "medpos": 40, "avgpos": 36.282051282051285, "average": 10.155502392344498, "highest": 90, "positive": 117, "fullscore": 100, "fullscores": 0, "highlights": [{"id": "/region/tos/potf010003", "name": "T. Buzzi, Prato", "description": "is the institute with the most points (200)"}, {"id": "/region/lom", "name": "Lombardia", "description": "is the region with the most points (855)"}]}, {"name": "cake", "title": "Olympic cake", "statement": "The preparations for the big final competition of this year's Olympiads have already begun! A big rectangular cake will be served at the end of the meal, to celebrate the end of the 2018 edition. Many guests are expected to take part in the festivities and, obviously, everyone wants to taste at least a bit of the special cake. The baker wants to please as many people as possible, but time is running out: he can only do at most N cuts. Each cut is made either vertically or horizontally, for the whole length of the cake. How many pieces of cake can the baker obtain at most?", "points": 23310, "medpos": 100, "avgpos": 93.99193548387096, "average": 55.76555023923445, "highest": 100, "positive": 248, "fullscore": 100, "fullscores": 214, "highlights": [{"id": "/region/tos/potf010003", "name": "T. Buzzi, Prato", "description": "is the institute with the most points (870)"}, {"id": "/region/emi", "name": "Emilia-Romagna", "description": "is the region with the most points (3770)"}]}, {"name": "coordonate", "title": "Forgotten attractions", "statement": "During his algorithmic excursions in the Alps, Giorgio likes to stop from time to time and visit some attractions. An attraction can be any place: an old abandoned church, a safe house or just a remarkable place from which to watch the stunning landscape. He has marked on the map N of these attractions, each situated at a different altitude of A[i] meters above sea level. The night before the excursion, Luca wanted to pull a prank on Giorgio and erased all the altitudes from the map. Instead, he left a footnote with a list of (N * (N-1}/2 numbers where each value is the positive altitude difference between two attractions (reported only once, i.e. for each pair of different attractions (i, j) only the difference |A[i] - A[j]| is listed). Giorgio has just woken up and found the prank: knowing that among the attractions he also listed his house (located at an altitude of zero meters), help him saving his excursion by reconstructing all the altitudes of the attractions!", "points": 635, "medpos": 15, "avgpos": 16.28205128205128, "average": 1.5191387559808613, "highest": 40, "positive": 39, "fullscore": 100, "fullscores": 0, "highlights": [{"id": "/region/tre/tnps01000v", "name": "Galileo Galilei, Trento", "description": "is the institute with the most points (55)"}, {"id": "/region/lom", "name": "Lombardia", "description": "is the region with the most points (180)"}]}, {"name": "maxim", "title": "Saddest friend", "statement": "Luca is giving a Christmas gift to each of his N friends! When the presents will be opened in the Giftsgiving Ceremony, his friends will be aligned in a row, numbered from 0 to N-1, and friend i will receive a gift of well-known value V_i. Luca knows that his friends will be able to see other presents at a distance up to K positions (that is, K-1 people in between). Of course, the friends whose gifts are less valuable will be sad: more precisely, their sadness will be equal to the absolute difference between the maximum value of a present they can see and the value of their one. Help Luca prepare for the ceremony by computing how sad will be the saddest friend!", "points": 9730, "medpos": 40, "avgpos": 47.46341463414634, "average": 23.27751196172249, "highest": 100, "positive": 205, "fullscore": 100, "fullscores": 22, "highlights": [{"id": "/region/tre/tnps01000v", "name": "Galileo Galilei, Trento", "description": "is the institute with the most points (500)"}, {"id": "/region/lom", "name": "Lombardia", "description": "is the region with the most points (1890)"}]}, {"name": "pouring", "title": "Apple juice challenge", "statement": "William is a long-time expert in drinking games, and today he invented a fantastic game! He starts with two glasses of different capacities A_C and B_C containing some amount of apple juice. The only valid operations are the following: (1) Drink all the apple juice contained in one of the glasses. (2) Refill one of the glasses completely (regardless of how full it is already). (3) Pour a glass into another until either the other glass is full or the first glass is empty. William chose a \"starting configuration\" (A_S, B_S) and he is now challenging Giorgio to reach a \"goal configuration\" (A_G, B_G), by strictly following the rules of the game. Giorgio doesn't want to drink too much apple juice (or spend a lot of time pouring, for that matter): help him reach the goal configuration in the least possible number of steps!", "points": 750, "medpos": 55, "avgpos": 50.0, "average": 1.7942583732057416, "highest": 55, "positive": 15, "fullscore": 100, "fullscores": 0, "highlights": [{"id": "/region/fri/pntf01000a", "name": "ITST Kennedy, Pordenone", "description": "is the institute with the most points (110)"}, {"id": "/region/fri", "name": "Friuli-Venezia Giulia", "description": "is the region with the most points (165)"}]}, {"name": "vapoare", "title": "Gondola network", "statement": "Santa Claus is coming to town! In Venice, specifically. This city represents a challenge for Santa: in fact, it can be seen as a set of N small islands connected by K navigable canals. Each canal connects two islands and has a specific width: only a gondola which is narrower (or equally wide) than the canal is able to traverse it. Santa wants to build a network for gift dispatching by renting gondolas in some of the islands, so that every island can be reached by at least one gondola. Notice that if an island is not connected to other islands, Santa will still need to rent a gondola for that island: the presents need to be dispatched through the island by boat. As anyone that ever visited Venice knows, renting these boats can be quite expensive! You are given the description of every canal (width and islands connected), and a list of all the available gondola widths...", "points": 2235, "medpos": 45, "avgpos": 60.4054054054054, "average": 5.34688995215311, "highest": 100, "positive": 37, "fullscore": 100, "fullscores": 9, "highlights": [{"id": "/region/fri/pntf01000a", "name": "ITST Kennedy, Pordenone", "description": "is the institute with the most points (170)"}, {"id": "/region/lom", "name": "Lombardia", "description": "is the region with the most points (545)"}]}], "points": 46750, "fullscore": 700, "positive": 257, "highest": 525, "average": 111.84210526315789, "avgpos": 181.90661478599222, "medpos": 170, "teams": 418, "id": "3", "ed_num": 9, "highlights": [{"id": "/edition/9/round/3/coordonate", "name": "Forgotten attractions", "description": "is the most difficult task of this contest"}, {"id": "/region/tre/tnps01000v", "name": "Galileo Galilei, Trento", "description": "is the institute with the most points (1920)"}, {"id": "/region/lom", "name": "Lombardia", "description": "is the region with the most points (8405)"}], "rank_tot": 239, "rank_reg": 16, "scores": [0, 0, 50, 0, 0, 0, 0], "total": 50}, {"name": "round4", "title": "Round 4", "edition": "9th Edition", "tasks": [{"name": "bitcoin", "title": "Bitcoin trading", "statement": "Near the end of 2017, the cryptocurrency known as \"Bitcoin\" (BTC) reached a record value of more than 16000€. William noticed this increase and is now wondering: how much money could someone have made in the best possible scenario starting with 1 BTC? For this reason, William collected every price increase (and decrease) of the last N days, and now he wants to know: starting with 1 BTC, how much € could he get by repeatedly selling and buying? For example, let's assume the value of 1 BTC is initially 1000€ and that there will be 5 price changes: -20, +85, +10, -100, +1 In this case, the best strategy is to: (1) Sell 1 BTC immediately, earning 1000€. (2) Wait for the price to go down by 20€, and then sell the EUR for BTC. (3) Wait for the price to go up by 85€, and hold the BTC. (4) Wait for the price to go up by 10€, and sell the BTC for EUR. (5) Wait for the price to go down by 100€, and then sell the EUR for BTC. (6) Wait for the price to go up by 1€, and then sell the BTC for EUR...", "points": 11720, "medpos": 100, "avgpos": 69.76190476190476, "average": 28.038277511961724, "highest": 100, "positive": 168, "fullscore": 100, "fullscores": 104, "highlights": [{"id": "/region/tre/tnps01000v", "name": "Galileo Galilei, Trento", "description": "is the institute with the most points (520)"}, {"id": "/region/lom", "name": "Lombardia", "description": "is the region with the most points (2260)"}]}, {"name": "metro", "title": "Metro platforms", "statement": "Since he began his university studies in Milan, Edoardo started commuting by metro everyday. He usually goes to class by metro, but today he is so sleepy that he is not sure from which metro stop he started, nor which direction he took! It's worth to notice that trains in metro stations don't always open their doors from the same side: sometimes you need to get off from the left side, sometimes from the right side. There is a small map inside the train, which shows the position of the platform (left or right exit). With this information, Edoardo believes he can easily understand from which metro stop he started his commute. Edoardo paid attention during the last M stops, and for each stop he noted on which side the train opened its doors. Help Edoardo count how many possible starting metro stops are compatible with his observations...", "points": 5120, "medpos": 70, "avgpos": 67.36842105263158, "average": 12.248803827751196, "highest": 100, "positive": 76, "fullscore": 100, "fullscores": 2, "highlights": [{"id": "/region/tre/tnps01000v", "name": "Galileo Galilei, Trento", "description": "is the institute with the most points (410)"}, {"id": "/region/lom", "name": "Lombardia", "description": "is the region with the most points (960)"}]}, {"name": "monuments", "title": "Circular monuments", "statement": "William is a famous urban planner and he has been commissioned the design of a new high road to connect Pordenone to Campobasso. There is only a small problem: he has to build the road across a park where there are N very important statues. These statues are placed along a circumference at distinct integer angles A_i (from 0 to 2K-1). The road must cross the center of the circle (like a diameter) and it is wide such that, if it starts at angle p, it covers all the statues between p and p+L-1 and between p+K and p+K+L-1 (extremes included). William can design the road at any angle, but he wants to find the minimum number of ancient monuments he is forced to demolish in order to build it.", "points": 4000, "medpos": 100, "avgpos": 81.63265306122449, "average": 9.569377990430622, "highest": 100, "positive": 49, "fullscore": 100, "fullscores": 27, "highlights": [{"id": "/region/tos/potf010003", "name": "T. Buzzi, Prato", "description": "is the institute with the most points (520)"}, {"id": "/region/lom", "name": "Lombardia", "description": "is the region with the most points (1050)"}]}, {"name": "passwords", "title": "Password generator", "statement": "Edoardo has decided to improve the current password generator for the OIS, in order to obtain passwords that are even more secure and easy to remember at the same time! Of course, this is not an easy task. He decided that the best way to generate such a password (with respect to a given language consisting of N words W_i for i=0 … N-1) is to find a string P of length L such that: (1) consistency: every substring of P of length K appears in some word of the given language; (2) novelty: every substring of P of length K+1 does not appear in any word of the given language. Help Edoardo find such a word!", "points": 310, "medpos": 60, "avgpos": 62.0, "average": 0.7416267942583732, "highest": 100, "positive": 5, "fullscore": 100, "fullscores": 1, "highlights": [{"id": "/region/lom/cotf01000t", "name": "Magistri Cumacini, Como", "description": "is the institute with the most points (100)"}, {"id": "/region/lom", "name": "Lombardia", "description": "is the region with the most points (180)"}]}, {"name": "pin", "title": "Keylogger", "statement": "Luca loves IT security, but he is a bit worried about the increasing number of attacks targeting smartphones. Recently, a number of smartphone companies have been discovered putting a sort of \"keylogger\" which secretly writes everything that is typed to a hidden file. Without much surprise, Luca found that even his smartphone does this thing and wants to understand the security implication of this absurd behaviour. He has gathered the log file from the phone in order to see whether he is able to recover the PIN (this would be a huge security issue!). Luca has stripped away all non-digit characters from the file, leaving a sequence of N digits. Under the assumption that the PIN consists of K digits and that the PIN is frequently typed, what is the sequence of four digits that is more likely to be Luca's PIN?", "points": 5930, "medpos": 70, "avgpos": 57.57281553398058, "average": 14.186602870813397, "highest": 100, "positive": 103, "fullscore": 100, "fullscores": 26, "highlights": [{"id": "/region/tos/potf010003", "name": "T. Buzzi, Prato", "description": "is the institute with the most points (520)"}, {"id": "/region/lom", "name": "Lombardia", "description": "is the region with the most points (1165)"}]}, {"name": "review", "title": "Unfair review", "statement": "Giorgio has just submitted his results on the advent of bloomsday to the renowned Journal of Scientific Hoaxes. However, his paper has been rejected by an anonymous reviewer who claimed that Giorgio used the wrong coefficients K and E for the holy sequence! Needless to say that Giorgio didn't take it too well, and started to stalk the journal's editors until he finally managed to get a picture of the supposedly \"correct\" holy sequence from the distance. From the reviewer's report, Giorgio knows that the correct holy sequence is of the form: K, 2K, 3K, 4K … Unfortunately, the pictures he managed to took are not precise enough: he was able to decipher only N numbers out of the first M of the sequence; and even of those numbers, he only deciphered their last D digits. Giorgio is sure about the relative appearance order of the digits he observed, even though he cannot tell their exact position in the sequence...", "points": 1145, "medpos": 50, "avgpos": 49.78260869565217, "average": 2.7392344497607657, "highest": 75, "positive": 23, "fullscore": 100, "fullscores": 0, "highlights": [{"id": "/region/emi/bois01400r", "name": "I.I.S. F. Alberghetti, Imola", "description": "is the institute with the most points (125)"}, {"id": "/region/lom", "name": "Lombardia", "description": "is the region with the most points (295)"}]}, {"name": "spectre", "title": "Speculative execution", "statement": "Given how much Luca loves IT security, you should not be surprised to know that he wants to understand the recent flaw discovered in CPUs: Spectre!. The full paper describing the vulnerability is quite intricated and so he wants to proceed a step at a time. Every respectable programmer knows that a CPU fundamentally executes instructions, one after another. But that is only one part of the story: modern CPUs aim at maximizing performace by executing multiple instructions at once, whenever possible. You are given a list of N instructions, each in the form target_variable = operand1_variable OP operand2_variable where OP is a mathematical operator among +, -, *, /. An instruction j can be executed immediately if it does not have to \"wait\" that one of its operand has to be computed (more precisely, a variable needs to be computed when it is the target of another instruction i with i<j)...", "points": 7360, "medpos": 50, "avgpos": 59.354838709677416, "average": 17.607655502392344, "highest": 100, "positive": 124, "fullscore": 100, "fullscores": 45, "highlights": [{"id": "/region/ven/vetf04000t", "name": "Carlo Zuccante, Venezia", "description": "is the institute with the most points (400)"}, {"id": "/region/lom", "name": "Lombardia", "description": "is the region with the most points (1470)"}]}], "points": 35585, "fullscore": 700, "positive": 188, "highest": 675, "average": 85.13157894736842, "avgpos": 189.28191489361703, "medpos": 140, "teams": 418, "id": "4", "ed_num": 9, "highlights": [{"id": "/edition/9/round/4/passwords", "name": "Password generator", "description": "is the most difficult task of this contest"}, {"id": "/region/tos/potf010003", "name": "T. Buzzi, Prato", "description": "is the institute with the most points (2090)"}, {"id": "/region/lom", "name": "Lombardia", "description": "is the region with the most points (7380)"}], "rank_tot": 189, "rank_reg": 14, "scores": [0, 0, 0, 0, 0, 0, 0], "total": 0}], "id": "abr21", "name": "Cppozapp", "institute": "A. Volta, Pescara", "inst_id": "peis00600b", "region": "abr", "fullregion": "Abruzzo", "coach": "Rossana D'Ignazio", "members": "", "finalist": false, "medals": [0, 0, 0, 1], "rank_reg": 13, "rank_tot": 198, "rank_excl": 179, "bestrank": 117, "avgrank": 42.04636290967227, "points": 220, "ed_num": 9, "edition": "9th Edition", "year": "2017/18", "highlights": [{"id": "/edition/9/round/2/cards", "name": "House of cards", "description": "is the hardest task solved by the team"}, {"id": "/edition/9/round/2", "name": "Round 2", "description": "is the round with the highest rank (117), total points (170), full scores (1), partial scores (3), maximum score (100) and regional rank (5)"}]}