{"contests": [{"name": "round1", "title": "Round 1", "edition": "11th Edition", "tasks": [{"name": 23, "title": "Bases Conversion", "statement": "Your professor has just introduced you to the different bases in which a number can be written and wants to test your understanding. His favourite number is 23 (this should not surprise you too much… it is a prime number!) and for this reason his favourite bases are 2 and 3. A number is called special if and only if the sum of the digits of its base two representation is the same as the sum of the digits of its base three representation. Consider the number 6_(10) (the subscript denotes the basis) = 110_(2) = 20_(3). The sum of the digits in base two is 1 + 1 + 0 = 2, which is exactly the sum of the digits in base three: 2 + 0 = 2. Thus, number 6_(10) is special. On the contrary, the number 9_(10) = 1001_(2) = 100_(3) is not special (the sums of digits are 2 and 1, respectively). In order to keep the class busy without much work on his side, your professor has come up with a boring homework assignment...", "points": 7215, "medpos": 30, "avgpos": 44.81366459627329, "average": 14.25889328063241, "highest": 100, "positive": 161, "fullscore": 100, "fullscores": 3, "highlights": [{"id": "/region/ven/tvtf04000t", "name": "ITI Planck, Villorba", "description": "is the institute with the most points (335)"}, {"id": "/region/lom", "name": "Lombardia", "description": "is the region with the most points (1265)"}]}, {"name": "blindpunch", "title": "Kill Those Bugs!", "statement": "In the middle of the night Luca has been attacked by bugs, which are very well organised and form a line in front of his bed. In order to protect himself, Luca has K slippers to be thrown at the bugs one at a time (but optionally he can throw multiple slippers at the same bug). The bugs, being very creative, are playing dead to fool him: the room is dark and he can only barely see the bugs, without knowing which ones are squashed and which are alive. Fortunately, Luca knows that the i-th bug in the line of N bugs has a probability P_i to be squashed when he throws a slipper at it. That probability does not change, meaning that subsequent slippers also have a probability P_i to kill it, if it is not already killed. Luca is very tired and hates bugs crawling around in his room in the middle of the night. Help him use the slippers in the wisest way possible, in order to maximize the expected number of killed bugs.", "points": 1550, "medpos": 100, "avgpos": 91.17647058823529, "average": 3.0632411067193677, "highest": 100, "positive": 17, "fullscore": 100, "fullscores": 12, "highlights": [{"id": "/region/lom/mips240005", "name": "Banfi, Vimercate", "description": "is the institute with the most points (200)"}, {"id": "/region/lom", "name": "Lombardia", "description": "is the region with the most points (540)"}]}, {"name": "butoaie", "title": "Save The Barrels", "statement": "A swarm of bugs from Bugland invaded William's wine cellar trough a magic portal. The wine cellar consists of N rooms, each full of barrels of wine, with the i-th room being infested by V_i bugs. William has at his disposal N insecticide diffusers of two types: K AntiBug which remove P bugs a day, and N-K ZeroBugs, which remove Q bugs a day. Every day, at most one diffuser can be used in every room without compromising the quality of the wine. What is the minimum number of days needed to save the barrels of wine by eliminating all the bugs?", "points": 2890, "medpos": 30, "avgpos": 30.74468085106383, "average": 5.711462450592886, "highest": 50, "positive": 94, "fullscore": 100, "fullscores": 0, "highlights": [{"id": "/region/tre/tnps01000v", "name": "Galileo Galilei, Trento", "description": "is the institute with the most points (160)"}, {"id": "/region/emi", "name": "Emilia-Romagna", "description": "is the region with the most points (480)"}]}, {"name": "fibonaccibug", "title": "Fibonacci Colonies", "statement": "Bug colonies have been the center of attention of scientists for a long time. Through some technological advancements, we are now able to describe a bug colony using a number known as the degree of the colony. A colony of degree 0 or 1 represents a colony with one bug. A colony of degree i > 1 is obtained by merging a colony of degree i - 1 together with a colony of degree i - 2. As such, a colony of degree 2 has two bugs, a colony of degree 3 has three bugs, a colony of degree 4 has five bugs and so on. Marco owns the biggest bug farm in the world, having at his disposal a virtually infinite amount of colonies of any degree. Every day he receives N offers, each described by two numbers A_i and B_i, meaning that he can sell as many colonies of degree A_i as he wants and get B_i money for each colony of that degree...", "points": 980, "medpos": 10, "avgpos": 37.69230769230769, "average": 1.9367588932806323, "highest": 100, "positive": 26, "fullscore": 100, "fullscores": 5, "highlights": [{"id": "/region/fri/pntf01000a", "name": "ITST Kennedy, Pordenone", "description": "is the institute with the most points (190)"}, {"id": "/region/fri", "name": "Friuli-Venezia Giulia", "description": "is the region with the most points (300)"}]}, {"name": "funnygraph", "title": "Funny Circuits", "statement": "Marco is studying electronics at Politecnico di Milano and his teacher assigned him an experimental project to do at the lab. The project is pretty simple: he has a circuit board with N connection points, and he should connect M components to those points, in the given order from component 0 to M-1. Each component i has a characteristic integral potential difference z_i and two terminals, which have to be connected to two given connection points a_i and b_i. Once a circuit is built, each of the connection points j=0 … N-1 naturally acquires a potential P_j. Furthermore, the i-th component can work correctly only provided that the difference of the potentials of its terminals is exactly z_i: in formulas, if P_a_i - P_b_i = z_i (or equivalently P_b_i - P_a_i = -z_i: the orientation of components matters). The laws of electromagnetism ensure that whenever an assignment of potentials satisfying the potential differences of components exists, such an assignment will naturally arise...", "points": 395, "medpos": 15, "avgpos": 35.90909090909091, "average": 0.7806324110671937, "highest": 100, "positive": 11, "fullscore": 100, "fullscores": 3, "highlights": [{"id": "/region/umb/trps03000x", "name": "R. Donatelli, Terni", "description": "is the institute with the most points (100)"}, {"id": "/region/fri", "name": "Friuli-Venezia Giulia", "description": "is the region with the most points (115)"}]}, {"name": "grades", "title": "Improving Grades", "statement": "In Italy, every parent of a high-school student can check how their child is doing in terms of grades. In fact, at any given moment the parent can access the \"electronic register\" where the professors regularly upload the grades obtained by their students in the various tests throughout the year. Edoardo is in high-school, and he's definitely not the best of his class: he regularly gets lots of insufficient grades! Grades in Italian high-schools go from 2 to 10, and a grade is said to be \"sufficient\" when it is higher than or equal to 6. Luckily, Edoardo's parents are not very tech-savvy: they know how to use a tablet, but they can't access the \"electronic register\" website on their own. Edoardo thinks this is a good thing, since all of his friends are constantly kept in check by their parents. The end of the year is getting close so, today, Edoardo's parents asked him to show them his grades. He thought about cheating (faking the website content) but he would feel bad about it...", "points": 25700, "medpos": 100, "avgpos": 96.61654135338345, "average": 50.790513833992094, "highest": 100, "positive": 266, "fullscore": 100, "fullscores": 253, "highlights": [{"id": "/region/lom/bsis037004", "name": "I.S. Castelli, Brescia", "description": "is the institute with the most points (900)"}, {"id": "/region/lom", "name": "Lombardia", "description": "is the region with the most points (4300)"}]}, {"name": "smartphone", "title": "Compulsive Smartphone Shopping", "statement": "Edoardo is very passionate about technology, especially about smartphones. Unfortunately, he just dropped his phone and the screen shattered, so he needs to buy another one as soon as possible! Edoardo is going to visit N shops in order. Every time he enters a new shop, he looks for the phone with the highest price and, if it is strictly more valuable than all of the smartphones he currently has, he buys it. Edoardo doesn't skip any shop, even if he has already purchased a smartphone elsewhere (he wants only the very best!). You know that the most valuable smartphone in the i-th shop costs P_i. You also know that the initial smartphone has no value, since it is broken. How much will Edoardo spend in total?", "points": 34390, "medpos": 100, "avgpos": 89.55729166666667, "average": 67.96442687747036, "highest": 100, "positive": 384, "fullscore": 100, "fullscores": 327, "highlights": [{"id": "/region/abr/peis00600b", "name": "A. Volta, Pescara", "description": "is the institute with the most points (1100)"}, {"id": "/region/emi", "name": "Emilia-Romagna", "description": "is the region with the most points (4890)"}]}, {"name": "sprei", "title": "Ant Supercolonies", "statement": "Giorgio's house has a huge bugs problem: N colonies of ants are infesting the place, and he must kill them once and for all! Since he is a very abstract person, Giorgio lives in a M-dimensional cube of side B, so that the position of every ant colony can be represented as an array of coordinates (A_1, A_2, …, A_M) with integer values ranging from 0 to B-1. Since ants are social entities, they always try to unify the colonies. Thereby, if two colonies are adjacent in the house (the position of one is obtained by adding or subtracting 1 from a single coordinate of the position of the other), they build a tunnel among them, creating a supercolony unifying the two smaller colonies and exacerbating the infestation power by orders of magnitude. Giorgio knows the positions of the N colonies, and can use pest control for destroying any one of them...", "points": 170, "medpos": 10, "avgpos": 18.88888888888889, "average": 0.3359683794466403, "highest": 60, "positive": 9, "fullscore": 100, "fullscores": 0, "highlights": [{"id": "/region/fri/pntf01000a", "name": "ITST Kennedy, Pordenone", "description": "is the institute with the most points (60)"}, {"id": "/region/fri", "name": "Friuli-Venezia Giulia", "description": "is the region with the most points (70)"}]}, {"name": "teleport2", "title": "Secret Meeting", "statement": "Everyone knows that in Bugland rooms are an infinite plane surface in which each point is described by two coordinates (x, y): in particular, two bugs A and B are now waiting at coordinates (X_a, Y_a) and (X_b, Y_b). It is well known that in Bugland beds are perfect circles, described by the coordinates of their center and their radius: in particular, in the mentioned room there is a single bed with center C = (X_c, Y_c) and radius R. A and B want to have a secret meeting to plan the invasion of the room: thus, they need to move as silent as possible, according to any trajectory, and gather this way to a common meeting point (X_m, Y_m) (not necessarily of integer coordinates). Walking on the floor one unit makes 1 NU (Noise Unit): for example, walking from (1, 1) to (3, 1) makes 2 NU, and walking from (1, 1) to (3, 2) makes √5 NU. On the other hand, walking on the bed is completely silent. Help the two bugs A and B meet, using a path allowing the sum of their NUs to be minimal.", "points": 4480, "medpos": 35, "avgpos": 55.30864197530864, "average": 8.853754940711463, "highest": 100, "positive": 81, "fullscore": 100, "fullscores": 39, "highlights": [{"id": "/region/fri/udps05000p", "name": "Liceo Scientifico N. Copernico, Udine", "description": "is the institute with the most points (200)"}, {"id": "/region/lom", "name": "Lombardia", "description": "is the region with the most points (850)"}]}], "points": 77770, "fullscore": 900, "positive": 396, "highest": 810, "average": 153.69565217391303, "avgpos": 196.38888888888889, "medpos": 200, "teams": 506, "id": "1", "ed_num": 11, "highlights": [{"id": "/edition/11/round/1/sprei", "name": "Ant Supercolonies", "description": "is the most difficult task of this contest"}, {"id": "/region/ven/tvtf04000t", "name": "ITI Planck, Villorba", "description": "is the institute with the most points (2395)"}, {"id": "/region/lom", "name": "Lombardia", "description": "is the region with the most points (12095)"}], "rank_tot": 393, "rank_reg": 10, "scores": [0, 0, 0, 0, 0, 0, 0, 0, 0], "total": 0}], "id": "mol16", "name": "Mattei_3C_F", "institute": "ISIS Fermi/Mattei, Isernia", "inst_id": "isis01300l", "region": "mol", "fullregion": "Molise", "coach": "Antonino Palomba", "members": "", "finalist": null, "medals": [0, 0, 0, 0], "rank_reg": 10, "rank_tot": 397, "rank_excl": 375, "bestrank": 393, "avgrank": 22.37623762376238, "points": 0, "ed_num": 11, "edition": "11th Edition", "year": "2019/20", "highlights": [{"id": "/edition/11/round/1/sprei", "name": "Ant Supercolonies", "description": "is the hardest task solved by the team"}, {"id": "/edition/11/round/1", "name": "Round 1", "description": "is the round with the highest rank (393), total points (0), full scores (0), partial scores (0), minimum score (0), maximum score (0) and regional rank (10)"}]}