{"contests": [{"name": "round1", "title": "Round 1", "edition": "6th Edition", "tasks": [{"name": "capslock", "title": "cAPS lOCK", "statement": "Gabriele ha scritto un messaggio per Giorgio, ma arrivato alla fine si è accorto con orrore che tutto il testo ha le minuscole e le maiuscole invertite per colpa del caps lock attivo. Piuttosto che riscrivere tutto daccapo, Gabriele decide di chiederti di creare un programma che, preso il testo del messaggio, converta le maiuscole in minuscole e viceversa. Aiuta Gabriele ad aggiustare il messaggio!", "points": 6700, "medpos": 100, "avgpos": 95.71428571428571, "average": 69.79166666666667, "highest": 100, "positive": 70, "fullscore": 100, "fullscores": 66, "highlights": [{"id": "/region/laz/rmis112007", "name": "Guglielmo Marconi, Civitavecchia", "description": "is the institute with the most points (510)"}, {"id": "/region/emi", "name": "Emilia-Romagna", "description": "is the region with the most points (2110)"}]}, {"name": "biglietti", "title": "Biglietti a Milano", "statement": "Giorgio, che studia a Torino, ha deciso di far visita a Gabriele, che studia a Milano. Giorgio sa che durante il periodo che passerà con Gabriele avrà bisogno di fare N viaggi sui mezzi pubblici, e per questo sta indagando sui prezzi dei biglietti. Ha scoperto che a Milano è possibile comprare un biglietto valido per una singola corsa per A centesimi, oppure un carnet da M viaggi, al costo di B centesimi. Conoscendo N, M, A e B, quanti centesimi al minimo deve spendere Giorgio per poter fare N corse sui mezzi?", "points": 4430, "medpos": 100, "avgpos": 73.83333333333333, "average": 46.145833333333336, "highest": 100, "positive": 60, "fullscore": 100, "fullscores": 36, "highlights": [{"id": "/region/ven/vrtf03000v", "name": "Guglielmo Marconi, Verona", "description": "is the institute with the most points (400)"}, {"id": "/region/emi", "name": "Emilia-Romagna", "description": "is the region with the most points (1630)"}]}, {"name": "grattacieli", "title": "Fila di grattacieli", "statement": "Giorgio è in visita a Toronto, città famosa per il suo skyline di N grattacieli di varia altezza tutti disposti lungo un'unica fila. Giorgio è appassionato di grattacieli, e quindi intende salire su uno di essi e approfittare dell'altezza per ammirare il panorama (e cioè, gli altri grattacieli). Giorgio sa che dalla cima di un grattacielo ammirerà appieno tutti i grattacieli (compreso quello su cui si trova) che non sono coperti da un altro grattacielo. Un grattacielo viene coperto da un altro (più vicino di questo al grattacielo su cui Giorgio si trova) se questo altro grattacielo è sia alto almeno quanto il grattacielo che copre e sia alto almeno quanto il grattacielo su cui Giorgio si trova. Ad esempio, consideriamo questo skyline: In questo scenario, se Giorgio salisse sul grattacielo 3, di altezza 5, sarebbe in grado di osservare solo i grattacieli da 1 a 6 compresi...", "points": 2330, "medpos": 70, "avgpos": 58.25, "average": 24.270833333333332, "highest": 100, "positive": 40, "fullscore": 100, "fullscores": 11, "highlights": [{"id": "/region/tre/tnps01000v", "name": "Galileo Galilei, Trento", "description": "is the institute with the most points (240)"}, {"id": "/region/emi", "name": "Emilia-Romagna", "description": "is the region with the most points (880)"}]}, {"name": "distributori", "title": "Rifornimenti ai distributori", "statement": "Gabriele ha appena preso la patente, e decide di invitare tutti i suoi amici a fare una gita. Dato che il viaggio è lungo ben K chilometri, sa che forse dovrà fermarsi a fare il pieno di benzina: a tal proposito Gabriele ha segnato a che distanza dalla partenza ci sono gli N distributori che si trovano lungo il tragitto. Sapendo che la sua macchina fa al massimo M chilometri con un pieno, e che alla partenza ha già il serbatoio pieno, aiuta Gabriele a pianificare i rifornimenti di modo da fare benzina il minor numero possibile di volte.", "points": 1850, "medpos": 50, "avgpos": 52.857142857142854, "average": 19.270833333333332, "highest": 100, "positive": 35, "fullscore": 100, "fullscores": 13, "highlights": [{"id": "/region/tre/tnps01000v", "name": "Galileo Galilei, Trento", "description": "is the institute with the most points (300)"}, {"id": "/region/emi", "name": "Emilia-Romagna", "description": "is the region with the most points (810)"}]}, {"name": "interrogazioni", "title": "Interrogazioni equilibrate", "statement": "Giulia, la professoressa di storia dell'arte di Gabriele, ha deciso di interrogare K persone oggi. Rivolgerà ad ogni interrogato una domanda, presa da una lista (segreta!) di N quesiti di varia difficoltà. La professoressa sa bene che le domande rivolte agli studenti dovranno essere tutte di difficoltà comparabile, per evitare il malcontento della classe. La scontentezza della classe infatti è pari alla differenza tra la difficoltà della domanda più difficile e quella più facile tra quelle chieste. Se Giulia sceglie K domande dalla lista nel modo ottimo, qual è la minima scontentezza possibile della classe?", "points": 2920, "medpos": 100, "avgpos": 76.84210526315789, "average": 30.416666666666668, "highest": 100, "positive": 38, "fullscore": 100, "fullscores": 24, "highlights": [{"id": "/region/tre/tnps01000v", "name": "Galileo Galilei, Trento", "description": "is the institute with the most points (300)"}, {"id": "/region/emi", "name": "Emilia-Romagna", "description": "is the region with the most points (1150)"}]}, {"name": "licenziamenti", "title": "Tagli al personale", "statement": "La SteamPower S.P.A., azienda leader mondiale nel campo delle macchine a vapore portatili, sta attraversando un brutto periodo di crisi e per tenerla in piedi nell'attesa che l'economia riparta la dirigenza ha stabilito un regime di forti tagli al personale. Per stabilire chi deve essere licenziato, il reparto personale ha distribuito un test con cui ha stabilito accuratamente di ognuno degli N dipendenti il suo personale valore di bravura B_i. Inoltre si baserà anche sullo studio dell'organigramma (cioè il grafico ad albero in cui tutti i dipendenti dell'azienda sono organizzati secondo le relazioni di dipendenza), e conosce quindi il capo diretto C_i di ogni dipendente i. Per convenzione, il presidente dell'azienda è segnato al numero 0 e ha C_i = -1 per indicare l'assenza di un capo diretto...", "points": 1690, "medpos": 20, "avgpos": 52.8125, "average": 17.604166666666668, "highest": 100, "positive": 32, "fullscore": 100, "fullscores": 15, "highlights": [{"id": "/region/ven/vetf04000t", "name": "Carlo Zuccante, Venezia", "description": "is the institute with the most points (200)"}, {"id": "/region/emi", "name": "Emilia-Romagna", "description": "is the region with the most points (740)"}]}, {"name": "figonacci", "title": "Numeri di Figonacci", "statement": "Dopo l'ultimo seminario di teoria dei numeri, Giorgio è rimasto affascinato dallo studio della sequenza dei numeri di Fibonacci. Pertanto, per non essere da meno, introduce una nuova sequenza di numeri secondo lui ancora più interessante: i numeri di Figonacci. Come per i loro quasi-omonimi, l'(n+1)-esimo numero di Figonacci G_n+1 si calcola a partire dai precedenti (eccezion fatta per i primi due numeri di Figonacci, che sono valori fissati a G_0 = -1 e G_1 = 0). La regola che stabilisce il valore di G_n+1, tuttavia, è diversa da quella dei numeri di Fibonacci: G_n+1 è pari alla somma di tutte le possibili differenze tra il numero di Figonacci immediatamente precedente e quelli ancora prima. In formule: I primi numeri che si ottengono da questa sequenza sono quindi -1, 0, 1, 3, 9, … ed è facile vedere che crescono molto rapidamente...", "points": 1210, "medpos": 30, "avgpos": 34.57142857142857, "average": 12.604166666666666, "highest": 100, "positive": 35, "fullscore": 100, "fullscores": 3, "highlights": [{"id": "/region/tre/tnps01000v", "name": "Galileo Galilei, Trento", "description": "is the institute with the most points (200)"}, {"id": "/region/emi", "name": "Emilia-Romagna", "description": "is the region with the most points (390)"}]}], "points": 21130, "fullscore": 700, "positive": 75, "highest": 700, "average": 220.10416666666666, "avgpos": 281.73333333333335, "medpos": 200, "teams": 96, "id": "1", "ed_num": 6, "highlights": [{"id": "/edition/6/round/1/figonacci", "name": "Numeri di Figonacci", "description": "is the most difficult task of this contest"}, {"id": "/region/tre/tnps01000v", "name": "Galileo Galilei, Trento", "description": "is the institute with the most points (1680)"}, {"id": "/region/emi", "name": "Emilia-Romagna", "description": "is the region with the most points (7710)"}], "rank_tot": 17, "rank_reg": 8, "scores": [100, 80, 70, 0, 70, 100, 30], "total": 450}, {"name": "round2", "title": "Round 2", "edition": "6th Edition", "tasks": [{"name": "crittografia", "title": "Crittografia riflessa", "statement": "Giorgio si è appassionato alla crittografia, e dopo aver studiato con attenzione tutti i più importanti algoritmi di crittografia simmetrica, ha pensato bene di introdurre un nuovo tipo di crittografia: la crittografia riflessa. Più precisamente, per codificare i suoi messaggi Giorgio intende utilizzare una funzione che dato un numero N, ne calcola il numero speculare (con tutte le cifre invertite dall'ultima alla prima) e lo somma al numero di partenza. Aiuta Giorgio a scrivere la funzione di codifica!", "points": 6590, "medpos": 100, "avgpos": 91.52777777777777, "average": 68.64583333333333, "highest": 100, "positive": 72, "fullscore": 100, "fullscores": 64, "highlights": [{"id": "/region/ven/vrtf03000v", "name": "Guglielmo Marconi, Verona", "description": "is the institute with the most points (400)"}, {"id": "/region/emi", "name": "Emilia-Romagna", "description": "is the region with the most points (2130)"}]}, {"name": "potenze", "title": "Allocazione di memoria", "statement": "Gabriele si è recentemente appassionato al linguaggio C-- (in particolare, C--11), in cui le uniche variabili ammesse sono array D-dimensionali con tutte le dimensioni uguali tra loro M (una variabile siffatta conterrà quindi M^D celle di memoria). Una delle novità introdotte dal C--11 rispetto al C--99, è che d'ora in poi sarà ammesso dichiarare un'unica variabile, che inoltre deve avere dimensione D almeno pari a 2. Gabriele sta aggiornando il suo vecchio codice ai nuovi standard, e sta riscontrando qualche difficoltà con la gestione della memoria in alcuni dei suoi programmi più complessi. Sapendo che il suo computer ha una capacità di N celle di memoria, quante ne potrà al massimo sfruttare con un programma di C--11 (e quindi con un'unica variabile di dimensione una potenza M^D con esponente almeno 2)?", "points": 4050, "medpos": 100, "avgpos": 76.41509433962264, "average": 42.1875, "highest": 100, "positive": 53, "fullscore": 100, "fullscores": 30, "highlights": [{"id": "/region/ven/tvtf04000t", "name": "ITI Planck, Villorba", "description": "is the institute with the most points (310)"}, {"id": "/region/emi", "name": "Emilia-Romagna", "description": "is the region with the most points (1320)"}]}, {"name": "duplicato", "title": "Duplicato mancante", "statement": "Gabriele stava fotocopiando un fascicolo di N pagine, quando arrivato a dover fotocopiare l'ultima pagina una folata di vento ha sollevato tutti i fogli, mescolandoli. Ora sul pavimento della camera di Gabriele sono sparpagliati 2N - 1 fogli, e Gabriele non sa quale era la pagina che mancava ancora da fotocopiare. Data la lista dei numeri di pagina dei fogli sparpagliati sul pavimento, aiuta Gabriele a capire qual è l'unico numero di pagina che è presente solo una volta.", "points": 4480, "medpos": 70, "avgpos": 73.44262295081967, "average": 46.666666666666664, "highest": 100, "positive": 61, "fullscore": 100, "fullscores": 23, "highlights": [{"id": "/region/ven/tvtf04000t", "name": "ITI Planck, Villorba", "description": "is the institute with the most points (310)"}, {"id": "/region/emi", "name": "Emilia-Romagna", "description": "is the region with the most points (1360)"}]}, {"name": "bilancio", "title": "Finanza creativa", "statement": "La SteamPower S.P.A., azienda leader mondiale nel campo delle macchine a vapore portatili, non accenna ad uscire dal periodo di crisi nonostante i forti e ben ponderati tagli al personale di recente effettuati. Per fortuna il CEO ha avuto una nuova geniale idea: affidarsi al massimo esperto mondiale in campo di finanza creativa. L'esperto ha già ricevuto il bilancio dal reparto contabilità, e la situazione è disastrosa: arrivati a questo punto l'unico modo che conosce per rassicurare gli azionisti e prendere tempo è quello di effettuare qualche piccolo ritocco ai libri contabili. Più precisamente, vuole ricorrere al suo fedele bianchetto per correggere il totale U delle uscite. Inoltre, grazie agli insegnamenti di lunghi anni di esperienza, sa che per contenere i rischi dell'operazione non deve assolutamente eccedere le K cifre cancellate (sulle N complessive del totale U). Aiuta l'esperto di finanza creativa a trovare il minimo intero ottenibile cancellando K cifre dall'intero U!", "points": 920, "medpos": 10, "avgpos": 31.724137931034484, "average": 9.583333333333334, "highest": 80, "positive": 29, "fullscore": 100, "fullscores": 0, "highlights": [{"id": "/region/ven/tvtf04000t", "name": "ITI Planck, Villorba", "description": "is the institute with the most points (160)"}, {"id": "/region/emi", "name": "Emilia-Romagna", "description": "is the region with the most points (330)"}]}, {"name": "pesci", "title": "Pesci Mangioni", "statement": "Al corso di Ittiologia Computazionale Gabriele sta studiando le dinamiche algoritmiche del mondo dei pesci. Un argomento particolarmente interessante è quello dell'alimentazione dei Pesci Mangioni. Questi voracissimi pesci, di dimensioni molto variegate, sono molto aggressivi e ogni volta che si sentono osservati da un'altro pesce reagiscono mangiandoselo (se possono), senza mai sentire il senso di sazietà. Per compito Gabriele ha stilato un modello semplificato del loro comportamento, che dovrebbe essere valido almeno nel caso in cui i pesci si trovino in un tubo da sperimentazione. Secondo il modello: (1) ogni pesce può nuotare da sinistra verso destra o da destra verso sinistra, e stando nel tubo questa direzione non cambierà mai, (2) ogni pesce ha una grandezza ben definita, e tutte le grandezze sono distinte, (3) un incrocio di pesci è una coppia di pesci adiacenti, per cui il più a sinistra nuota verso destra, e il più a destra nuota verso sinistra...", "points": 1330, "medpos": 10, "avgpos": 32.4390243902439, "average": 13.854166666666666, "highest": 100, "positive": 41, "fullscore": 100, "fullscores": 6, "highlights": [{"id": "/region/ven/vetf04000t", "name": "Carlo Zuccante, Venezia", "description": "is the institute with the most points (200)"}, {"id": "/region/emi", "name": "Emilia-Romagna", "description": "is the region with the most points (530)"}]}, {"name": "ponti", "title": "Ponti e isole", "statement": "A seguito di un violento maremoto alcuni dei ponti che collegano le N isole dell'arcipelago Nowhere sono stati distrutti e il governo deve correre ai ripari per non lasciare che alcune isolette rimangano isolate e irraggiungibili. Il governo dell'arcipelago Nowhere ha quindi assunto Giorgio per determinare quale è il minimo numero di ponti che è necessario costruire in aggiunta agli M rimasti affinchè l'arcipelago sia di nuovo connesso, ovvero sia possibile da ogni isola raggiungere tutte le altre isole. Aiuta Giorgio a svolgere il suo compito!", "points": 1490, "medpos": 10, "avgpos": 32.391304347826086, "average": 15.520833333333334, "highest": 100, "positive": 46, "fullscore": 100, "fullscores": 10, "highlights": [{"id": "/region/laz/rmis05300l", "name": "Sandro Pertini, Genzano Di Roma", "description": "is the institute with the most points (200)"}, {"id": "/region/emi", "name": "Emilia-Romagna", "description": "is the region with the most points (590)"}]}, {"name": "medaglie", "title": "Oro, argento e bronzo", "statement": "In uno spiacevole incidente, Giorgio e Gabriele hanno mescolato tutte le loro innumerevoli medaglie vinte in varie competizioni, e non riescono più a ricostruire quali erano le loro in partenza. Decidono quindi di spartirsele secondo un gioco, detto oro, argento e bronzo. Impilano quindi tutte le N medaglie, ciascuna delle quali può essere d'oro, d'argento o di bronzo. Giorgio, per maggiore anzianità, inizia il gioco e prende una, due o tre medaglie (a sua scelta) dall'inizio della pila. A seguire, Gabriele fa lo stesso e i turni si susseguono alternati finché tutte le medaglie sono state prese da uno dei due. Giorgio, di recente in difficoltà economiche, ha il segreto piano di rivendere tutte le medaglie che riesce a raccogliere; e sa che potrà ottenere 500 euro per ogni medaglia d'oro, 300 euro per ogni medaglia d'argento e 100 euro per ogni medaglia di bronzo...", "points": 270, "medpos": 10, "avgpos": 10.0, "average": 2.8125, "highest": 10, "positive": 27, "fullscore": 100, "fullscores": 0, "highlights": [{"id": "/region/umb/trps03000x", "name": "R. Donatelli, Terni", "description": "is the institute with the most points (30)"}, {"id": "/region/emi", "name": "Emilia-Romagna", "description": "is the region with the most points (130)"}]}], "points": 19130, "fullscore": 700, "positive": 75, "highest": 590, "average": 199.27083333333334, "avgpos": 255.06666666666666, "medpos": 270, "teams": 96, "id": "2", "ed_num": 6, "highlights": [{"id": "/edition/6/round/2/medaglie", "name": "Oro, argento e bronzo", "description": "is the most difficult task of this contest"}, {"id": "/region/ven/tvtf04000t", "name": "ITI Planck, Villorba", "description": "is the institute with the most points (1340)"}, {"id": "/region/emi", "name": "Emilia-Romagna", "description": "is the region with the most points (6390)"}], "rank_tot": 43, "rank_reg": 15, "scores": [100, 30, 70, 0, 0, 0, 0], "total": 200}, {"name": "round3", "title": "Round 3", "edition": "6th Edition", "tasks": [{"name": "lollatz", "title": "Congettura di Lollatz", "statement": "Da qualche tempo, Giorgio si è interessato alla congettura di Lollatz. Questa congettura afferma che, dato un quadrato perfetto N, ripetendo i seguenti due passaggi: (1) moltiplichi il numero per la sua (cifra delle unità - 1) (2) dividi per due, arrotondando per difetto prima o poi si arriva a un multiplo di 10. Giorgio, tuttavia, non riesce ad interpretare i passaggi della dimostrazione del dottor Lollatz, che sembra essere composta unicamente da abbreviazioni poco leggibili, e quindi si fida poco di questo risultato. Aiutalo a dirimere i suoi dubbi scrivendo un programma che verifichi questa congettura!", "points": 6510, "medpos": 100, "avgpos": 98.63636363636364, "average": 67.8125, "highest": 100, "positive": 66, "fullscore": 100, "fullscores": 65, "highlights": [{"id": "/region/laz/frps010009", "name": "Liceo Scientifico Severi, Frosinone", "description": "is the institute with the most points (500)"}, {"id": "/region/emi", "name": "Emilia-Romagna", "description": "is the region with the most points (1900)"}]}, {"name": "magneti", "title": "Magnetic alignment", "statement": "Despite his age, Gabriele loves playing with magnets. One of his favourite constructions is the so-called \"snake of magnets\", which is a long line of magnets. Obviously, magnets can stay one next to the other only when the positive terminal of one magnet matches with the negative terminal of the next magnet, and vice versa. For instance, the following sequences of magnets are valid snakes of magnets: (+-)(+-)(+-)(+-)(+-)and(-+)(-+)(-+), while the following ones are not: (+-)(-+)(-+)(-+)and(-+)(+-)(-+). Given a generic (not necessarily stable) sequence of magnets, Gabriele wonders which is the minimum number of magnets that must be rotated in order to get a snake of magnets.", "points": 5400, "medpos": 100, "avgpos": 81.81818181818181, "average": 56.25, "highest": 100, "positive": 66, "fullscore": 100, "fullscores": 51, "highlights": [{"id": "/region/laz/frps010009", "name": "Liceo Scientifico Severi, Frosinone", "description": "is the institute with the most points (500)"}, {"id": "/region/emi", "name": "Emilia-Romagna", "description": "is the region with the most points (1810)"}]}, {"name": "taxi", "title": "Viaggio in taxi", "statement": "Gabriele deve andare a trovare Giorgio per mettere a punto la finale delle OIS. La strada da Brescia a Pinerolo è lunga, e attraversa N+1 città (numerate da 0 a N) tutte alla stessa distanza di 1 tantometro. Dato che Gabriele ha recentemente racimolato un po' di liquidità, sta valutando se viaggiare comodo spostandosi di città in città in taxi. In ogni città c'è una stazione di taxi, ma la situazione è resa complicata dal fatto che i prezzi dei taxi variano notevolmente di città in città. Prendere un taxi nella città i ha un prezzo base di C_i euro per il primo tantometro percorso, e poi questo prezzo aumenta di uno per ogni ulteriore tantometro percorso (i tassisti sono reticenti ad allontanarsi dalla loro città natìa!). Per esempio, nella seguente situazione: Gabriele inizia prendendo il taxi a Brescia, la città numero 0, con un prezzo base di 10 euro al tantometro. Quindi lo utilizza per andare fino alla città numero 3, pagando 10+11+12 = 33 euro...", "points": 5000, "medpos": 100, "avgpos": 84.7457627118644, "average": 52.083333333333336, "highest": 100, "positive": 59, "fullscore": 100, "fullscores": 47, "highlights": [{"id": "/region/emi/fetf01201c", "name": "ITI N. Copernico - A. Carpeggiani, Ferrara", "description": "is the institute with the most points (400)"}, {"id": "/region/emi", "name": "Emilia-Romagna", "description": "is the region with the most points (1520)"}]}, {"name": "parentesi", "title": "Espressione di parentesi", "statement": "Giorgio ha scritto un programma contenente una serie di espressioni molto elaborate, formate ciascuna da un gran numero di parentesi di tutti i tipi, e cioè: (1) angolate: '<' e '>' (2) tonde: '(' e ')' (3) quadrate: '[' e ']' (4) graffe: '{' e '}' Purtroppo, quando ha provato ad eseguirlo, il compilatore gli ha detto che c'è un errore senza nemmeno dirgli in quale espressione si trova! Aiutalo controllando quali espressioni sono ben formate e quali no.", "points": 3270, "medpos": 100, "avgpos": 66.73469387755102, "average": 34.0625, "highest": 100, "positive": 49, "fullscore": 100, "fullscores": 29, "highlights": [{"id": "/region/ven/vrtf03000v", "name": "Guglielmo Marconi, Verona", "description": "is the institute with the most points (300)"}, {"id": "/region/emi", "name": "Emilia-Romagna", "description": "is the region with the most points (1230)"}]}, {"name": "tris", "title": "Gioco del tris", "statement": "Quasi tutti conoscono il gioco del tris, ma per completezza riportiamo qui sotto le regole: (1) Il gioco si svolge su una griglia 3× 3, inizialmente vuota. (2) A turno, i giocatori scelgono una cella vuota e vi disegnano il proprio simbolo (una X o una O). (3) Vince il giocatore che riesce a disporre tre dei propri simboli in linea retta orizzontale, verticale o diagonale. Se la griglia viene riempita senza che nessuno dei giocatori sia riuscito a completare una linea retta di tre simboli, il gioco finisce in parità e nessuno dei giocatori vince. Gabriele è stanco di perdere in continuazione contro Giorgio, abilissimo giocatore di tris, perciò decide di scrivere un programma in grado di predire, conoscendo lo stato corrente della griglia, se Gabriele riuscirà a vincere indipendentemente dalle mosse di Giorgio. Gabriele gioca sempre per primo col simbolo X, mentre giorgio gioca sempre per secondo con il simbolo O...", "points": 650, "medpos": 20, "avgpos": 25.0, "average": 6.770833333333333, "highest": 60, "positive": 26, "fullscore": 100, "fullscores": 0, "highlights": [{"id": "/region/tre/tnps01000v", "name": "Galileo Galilei, Trento", "description": "is the institute with the most points (100)"}, {"id": "/region/emi", "name": "Emilia-Romagna", "description": "is the region with the most points (290)"}]}, {"name": "festa", "title": "Inviti alla festa", "statement": "Gabriele e Giorgio hanno deciso di organizzare una festa. Per questo hanno raccolto una lista di tutti i loro amici, e ora vogliono invitarli. Affinché gli amici di Gabriele e Giorgio non si annoino alla festa, è necessario che ogni invitato conosca almeno altri due degli amici invitati. Conoscendo il grafo delle conoscenze reciproche tra gli amici di Giorgio e Gabriele, stabilisci qual è il massimo numero di persone che Gabriele e Giorgio possono invitare alla festa.", "points": 1360, "medpos": 10, "avgpos": 34.0, "average": 14.166666666666666, "highest": 100, "positive": 40, "fullscore": 100, "fullscores": 5, "highlights": [{"id": "/region/lom/bgtf010003", "name": "Pietro Paleocapa, Bergamo", "description": "is the institute with the most points (150)"}, {"id": "/region/emi", "name": "Emilia-Romagna", "description": "is the region with the most points (470)"}]}, {"name": "pianostudi", "title": "Piano degli studi", "statement": "Gabriele vuole laurearsi il prima possibile! Ogni anno deve compilare il cosiddetto \"piano degli studi\", dove indica i corsi che intende frequentare per quell'anno accademico. Ogni corso, oltre alla data di inizio e fine lezioni, ha associato anche un numero (intero) di crediti. Per potersi laureare, Gabriele sa che deve accumulare un certo numero di crediti, ottenuti superando gli esami dei corsi che sceglie di frequentare. Per non essere troppo stressato, Gabriele stabilisce che tra i corsi che sceglierà non dovranno esserci sovrapposizioni, ovvero non dovrà succedere che i periodi di erogazione dei corsi abbiano intersezione, neanche eventualmente per un solo giorno. Data la lista dei corsi, aiuta Gabriele a scegliere il sottoinsieme di corsi che garantisce il massimo numero di crediti.", "points": 790, "medpos": 10, "avgpos": 17.954545454545453, "average": 8.229166666666666, "highest": 100, "positive": 44, "fullscore": 100, "fullscores": 2, "highlights": [{"id": "/region/ven/vetf04000t", "name": "Carlo Zuccante, Venezia", "description": "is the institute with the most points (110)"}, {"id": "/region/emi", "name": "Emilia-Romagna", "description": "is the region with the most points (300)"}]}], "points": 22980, "fullscore": 700, "positive": 67, "highest": 610, "average": 239.375, "avgpos": 342.9850746268657, "medpos": 340, "teams": 96, "id": "3", "ed_num": 6, "highlights": [{"id": "/edition/6/round/3/tris", "name": "Gioco del tris", "description": "is the most difficult task of this contest"}, {"id": "/region/emi/fetf01201c", "name": "ITI N. Copernico - A. Carpeggiani, Ferrara", "description": "is the institute with the most points (1680)"}, {"id": "/region/emi", "name": "Emilia-Romagna", "description": "is the region with the most points (7520)"}], "rank_tot": 25, "rank_reg": 9, "scores": [100, 100, 100, 100, 0, 0, 0], "total": 400}, {"name": "round4", "title": "Round 4", "edition": "6th Edition", "tasks": [{"name": "calcolatrice", "title": "Calcolatrice d'epoca", "statement": "La calcolatrice che Giorgio conserva gelosamente da quando faceva le elementari si è rotta, e ora il suo schermo LCD vecchio stile penzola appeso ai tasti dal solo filo di alimentazione. Nonostante questo, funziona ancora perfettamente come un tempo e quindi Giorgio non ha intenzione di smettere di utilizzarla. Con la sua affezionata calcolatrice, Giorgio ha appena fatto dei lunghi e complessi calcoli i cui risultati potrebbero portare alla soluzione di numerose congetture in innumerevoli campi della matematica, e ne ha trascritto i risultati su un foglio. Tuttavia solo dopo si è accorto che, per via del danno descritto sopra, non è in grado di capire l'orientamento giusto dello schermo e quindi in alcuni casi potrebbe aver trascritto il risultato sbagliato (e cioè come si leggerebbe ruotando lo schermo della calcolatrice di 180°). Da un'approssimazione a stima che si è fatto, gli sembra che i risultati dovrebbero essere numeri abbastanza piccoli...", "points": 4790, "medpos": 100, "avgpos": 85.53571428571429, "average": 49.895833333333336, "highest": 100, "positive": 56, "fullscore": 100, "fullscores": 42, "highlights": [{"id": "/region/laz/frps010009", "name": "Liceo Scientifico Severi, Frosinone", "description": "is the institute with the most points (500)"}, {"id": "/region/emi", "name": "Emilia-Romagna", "description": "is the region with the most points (1650)"}]}, {"name": "gravity", "title": "Assenza di gravità", "statement": "Gabriele è in visita alla stazione spaziale internazionale (ISS), incaricato di aggiornare i sistemi di bordo ai nuovi standard del C--11. Purtroppo l'operazione è andata storta e la stazione è entrata in stato di freeze. Ora bisogna urgentemente riavviare tutti i sistemi di energy e life support prima che gli occupanti rischino la vita! Gabriele, imbracciata la tuta spaziale, esce sulla parete rettangolare esterna dell'astronave in cui si trovano i grossi interruttori di reset di emergenza di tutti i numerosi sistemi che compongono l'astronave. Gli N pesanti interruttori si trovano sulla parete uno di seguito all'altro, ma ciascuno ad una altezza differente H_i. Ogni volta che spingerà un'interruttore per attivare il corrispondente sistema, Gabriele sa che la sua direzione di moto lungo l'asse verticale si invertirà (sbalzato dal principio di azione e reazione), mentre la sua direzione di moto lungo l'asse orizzontale rimarrà invariata...", "points": 2290, "medpos": 10, "avgpos": 45.8, "average": 23.854166666666668, "highest": 100, "positive": 50, "fullscore": 100, "fullscores": 17, "highlights": [{"id": "/region/emi/reis01600q", "name": "Blaise Pascal, Reggio Nell'Emilia", "description": "is the institute with the most points (220)"}, {"id": "/region/emi", "name": "Emilia-Romagna", "description": "is the region with the most points (810)"}]}, {"name": "piroette", "title": "Piroette", "statement": "Uno dei tanti passatempi di Giorgio è quello del coreografo. Di recente si è occupato di curare la coreografia della scena più importante di un balletto, in cui i ballerini eseguono un certo numero P di piroette, ovvero di mezzigiri su una gamba. Giorgio nel copione aveva specificato la quantità di gradi che i ballerini dovevano compiere nella rotazione, cioè la quantità G = 180* P. A causa di un guasto alla stampante, ogni volta che i copioni vengono stampati le cifre di G vengono permutate casualmente. Per questo, ogni ballerino ha ricevuto un copione che specifica una quantità di gradi diversi. Lo spettacolo sta per debuttare, e restano pochi minuti per trovare una soluzione. Per mettere tutti d'accordo, Giorgio stabilisce che il numero di gradi da compiere è pari al massimo numero divisibile per 180 che si ottiene ripermutando le cifre del numero scritto sui copioni...", "points": 1910, "medpos": 40, "avgpos": 47.75, "average": 19.895833333333332, "highest": 100, "positive": 40, "fullscore": 100, "fullscores": 12, "highlights": [{"id": "/region/tre/tnps01000v", "name": "Galileo Galilei, Trento", "description": "is the institute with the most points (280)"}, {"id": "/region/emi", "name": "Emilia-Romagna", "description": "is the region with the most points (490)"}]}, {"name": "remix", "title": "PaH TuNZ", "statement": "Gabriele ha deciso di buttarsi nel mondo della musica trash. Per questo, ha scritto un software in grado di prendere un normale testo e remixarlo. Il processo è semplice, dal momento che tutto quello che fa il software è inserire nel testo un certo numero di effetti musicali, identificati dalle stringhe `PaH' e `TuNZ'. Ad esempio, un testo formato dalle parole `Sette Otto' può essere trasformato nel testo `TuNZTuNZSettePaHPaHTuNZOtto'. In generale, gli effetti sonori possono essere inseriti prima dell'inizio del testo e dopo la fine, ma non sono obbligatori, mentre tra due parole consecutive è sempre inserito almeno un effetto sonoro. Giorgio non è un grande fan di questo genere musicale, e non riesce a distinguere bene le parole che formano il testo originale. Per questo è interessato a ripulire la musica dagli effetti sonori e ricostruire il testo originale. Aiutalo!", "points": 3550, "medpos": 100, "avgpos": 82.55813953488372, "average": 36.979166666666664, "highest": 100, "positive": 43, "fullscore": 100, "fullscores": 32, "highlights": [{"id": "/region/ven/tvtf04000t", "name": "ITI Planck, Villorba", "description": "is the institute with the most points (300)"}, {"id": "/region/emi", "name": "Emilia-Romagna", "description": "is the region with the most points (1130)"}]}, {"name": "solitario", "title": "Tris in solitaria", "statement": "Gabriele, ancora ossessionato dal gioco del tris, ha deciso che non vuole più ricorrere a un programma per vincere contro di Giorgio e ha quindi iniziato un duro programma di allenamento in solitaria. Per allenarsi, Gabriele prende una griglia da tris composta da N × M caselle, e va avanti a segnare X su alcune caselle finché riesce a non creare tris. Questo programma di allenamento, tuttavia, lo sta lasciando insoddisfatto in quanto non riesce a capire se sta andando bene oppure no. Aiuta Gabriele a valutarsi calcolando quante X può segnare al massimo in una griglia N × M senza creare tris!", "points": 1150, "medpos": 10, "avgpos": 23.46938775510204, "average": 11.979166666666666, "highest": 90, "positive": 49, "fullscore": 100, "fullscores": 0, "highlights": [{"id": "/region/tre/tnps01000v", "name": "Galileo Galilei, Trento", "description": "is the institute with the most points (130)"}, {"id": "/region/emi", "name": "Emilia-Romagna", "description": "is the region with the most points (340)"}]}, {"name": "strudel", "title": "Fette di strudel", "statement": "Il dolce preferito di Giorgio è lo strudel, e ne è talmente goloso che sarebbe capace di mangiarne una quantità potenzialmente infinita. Gabriele conosce bene l'amore di Giorgio per lo strudel e per questo, nel famoso viaggio in taxi verso Pinerolo, ha portato con sé uno strudel gigantesco, composto di N sezioni di differente composizione. Purtroppo Gabriele non sapeva che Giorgio odia le mandorle, e credendo di fare cosa gradita le ha inserite nell'impasto. Per fortuna non tutto è perduto: Giorgio ama così tanto lo strudel che è disposto a mangiarne una fetta a patto che la quantità di cannella sia superiore alla quantità di mandorle in quella fetta, di modo da celarne l'odiato sapore. Per questo, dopo una meticolosa ispezione, gli amici hanno determinato quante mandorle mandorle[i] e quanta cannella cannella[i] sono presenti in ognuna delle N sezioni di strudel. Sta ora a Giorgio tagliare la sua fetta di strudel, cioè una parte composta da un numero intero di sezioni contigue...", "points": 1350, "medpos": 10, "avgpos": 32.926829268292686, "average": 14.0625, "highest": 70, "positive": 41, "fullscore": 100, "fullscores": 0, "highlights": [{"id": "/region/tre/tnps01000v", "name": "Galileo Galilei, Trento", "description": "is the institute with the most points (150)"}, {"id": "/region/emi", "name": "Emilia-Romagna", "description": "is the region with the most points (620)"}]}, {"name": "velox", "title": "Limiti di velocità", "statement": "Gabriele vuole mettere alla prova la sua nuova utilitaria sportiva, e sta quindi cercando il tragitto più lungo possibile da fare in un'unica graduale accelerata. Il compito è reso arduo dalla presenza di un complicato sistema di limiti di velocità e sensi unici, che Gabriele non può assolutamente permettersi di violare. La zona di Brescia è composta di N incroci tra cui corrono M tratti di strada di pari lunghezza, ciascuno con il suo limite di velocità V_i. Trova il tragitto più lungo composto da tratti di strada con limiti di velocità strettamente crescenti!", "points": 600, "medpos": 10, "avgpos": 16.216216216216218, "average": 6.25, "highest": 80, "positive": 37, "fullscore": 100, "fullscores": 0, "highlights": [{"id": "/region/emi/fois01100l", "name": "Pascal - Comandini, Cesena", "description": "is the institute with the most points (90)"}, {"id": "/region/emi", "name": "Emilia-Romagna", "description": "is the region with the most points (280)"}]}], "points": 15640, "fullscore": 700, "positive": 63, "highest": 610, "average": 162.91666666666666, "avgpos": 248.25396825396825, "medpos": 220, "teams": 96, "id": "4", "ed_num": 6, "highlights": [{"id": "/edition/6/round/4/velox", "name": "Limiti di velocità", "description": "is the most difficult task of this contest"}, {"id": "/region/tre/tnps01000v", "name": "Galileo Galilei, Trento", "description": "is the institute with the most points (1400)"}, {"id": "/region/emi", "name": "Emilia-Romagna", "description": "is the region with the most points (5320)"}], "rank_tot": 60, "rank_reg": 19, "scores": [10, 10, 0, 0, 0, 0, 0], "total": 20}], "id": "iucuteok", "name": "Carpeggiani2", "institute": "ITI N. Copernico - A. Carpeggiani, Ferrara", "inst_id": "fetf01201c", "region": "emi", "fullregion": "Emilia-Romagna", "coach": "", "members": "", "finalist": false, "medals": [0, 0, 0, 2], "rank_reg": 11, "rank_tot": 35, "rank_excl": 25, "bestrank": 17, "avgrank": 50.52631578947368, "points": 1070, "ed_num": 6, "edition": "6th Edition", "year": "2014/15", "highlights": [{"id": "/edition/6/round/1/licenziamenti", "name": "Tagli al personale", "description": "is the hardest task solved by the team"}, {"id": "/edition/6/round/1", "name": "Round 1", "description": "is the round with the highest rank (17), total points (450), partial scores (6) and regional rank (8)"}, {"id": "/edition/6/round/3", "name": "Round 3", "description": "is the round with the most full scores (4)"}]}